///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается из ТранспортСообщенийОбмена.ВсеТипыТранспорта
// Возвращает все доступные типы транспорта.
// 
// Параметры:
//  ТипыТранспорта - Массив из ОбработкаОбъект.ТранспортСообщенийОбменаCOM,
//    ОбработкаОбъект.ТранспортСообщенийОбменаEMAIL,
//    ОбработкаОбъект.ТранспортСообщенийОбменаESB1C,
//    ОбработкаОбъект.ТранспортСообщенийОбменаFILE,
//    ОбработкаОбъект.ТранспортСообщенийОбменаFTP,
//    ОбработкаОбъект.ТранспортСообщенийОбменаGoogleDrive,
//    ОбработкаОбъект.ТранспортСообщенийОбменаHTTP,
//    ОбработкаОбъект.ТранспортСообщенийОбменаSM,
//    ОбработкаОбъект.ТранспортСообщенийОбменаWS,
//    ОбработкаОбъект.ТранспортСообщенийОбменаПассивныйРежим,
//    ОбработкаОбъект.ТранспортСообщенийОбменаЯндексДиск - обработки транспорта, в т.ч. добавленные при кастомизации.
//
Процедура ПриОпределенииТиповТранспорта(ТипыТранспорта) Экспорт
	
	
	
КонецПроцедуры

// Вызывается в ТранспортСообщенийОбмена.ДоступныеТипыТранспорта
// Определяет доступные типы транспорта для узла плана обмена
// 
// Параметры:
//  ДоступныеТипыТранспорта - Массив из ОбработкаОбъект.ТранспортСообщенийОбменаCOM,
//    ОбработкаОбъект.ТранспортСообщенийОбменаEMAIL,
//    ОбработкаОбъект.ТранспортСообщенийОбменаESB1C,
//    ОбработкаОбъект.ТранспортСообщенийОбменаFILE,
//    ОбработкаОбъект.ТранспортСообщенийОбменаFTP,
//    ОбработкаОбъект.ТранспортСообщенийОбменаGoogleDrive,
//    ОбработкаОбъект.ТранспортСообщенийОбменаHTTP,
//    ОбработкаОбъект.ТранспортСообщенийОбменаSM,
//    ОбработкаОбъект.ТранспортСообщенийОбменаWS,
//    ОбработкаОбъект.ТранспортСообщенийОбменаПассивныйРежим,
//    ОбработкаОбъект.ТранспортСообщенийОбменаЯндексДиск - обработки транспорта, в т.ч. добавленные при кастомизации.
//  Корреспондент - ПланОбменаСсылка - узел, для которого определяются доступные типы транспорта
//  ВариантНастройки - Строка - вариант настройки
//
Процедура ПриОпределенииДоступныхТиповТранспорта(ДоступныеТипыТранспорта, Корреспондент, ВариантНастройки = "") Экспорт

	//
	
КонецПроцедуры

// Вызывается в ОбменДаннымиОперацииВебСервисов.СобратьФайлИзЧастей, 
// при помещении файла в хранилище сообщений обмена (регистр сведений СообщенияОбменаДанными).
// 
// Параметры:
//  ИмяФайла - Строка
//  ИдентификаторФайла - Строка 
//
Процедура ПриПомещенииФайлаВХранилище(ИмяФайла, ИдентификаторФайла) Экспорт
	
	//
	
КонецПроцедуры

// Вызывается в ОбменДаннымиОперацииВебСервисов.ПодготовитьФайлДляПолучения,
// перед получением файла их хранилища сообщений обмена (регистр сведений СообщенияОбменаДанными).
// 
// Параметры:
//  ИдентификаторФайла - Строка
//
Процедура ПередПолучениемФайлаИзХранилища(ИдентификаторФайла) Экспорт

	//
	
КонецПроцедуры

// При проверке того, что все обязательные реквизиты настройки транспорта заполнены.
//
// Параметры:
//  Настройка - РезультатЗапроса, Структура - значения реквизитов настройки транспорта.
//  МенеджерТранспорта - Произвольный - менеджер транспорта см. в функции ТранспортСообщенийОбмена.МенеджерТранспортаПоИдентификатору.
//  НастройкаЗаполнена - Булево - результат проверки заполнения.
//
Процедура ПриПроверкиЗаполненияОбязательныхРеквизитовНастройкиТранспорта(Настройка, МенеджерТранспорта, НастройкаЗаполнена) Экспорт
	
		
КонецПроцедуры

#КонецОбласти
