///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область Прочее

// Формирует схему компоновки данных и возвращает ее адрес по доступным для отбора полям объекта метаданных.
// 
// Параметры:
//  ПолноеИмяТипаМетаданных - Строка - полное имя типа метаданных
//  ДоступныеПоля           - СписокЗначений Из Строка - доступные поля для отбора
//  УникальныйИдентификатор - УникальныйИдентификатор - идентификатор формы, для которой выполняются действия
//  ДляОбъектовИБ            - Булево - на основании чего формируется схема, данных базы или таблицы полученных объектов
// 
// Возвращаемое значение:
//  Строка - Адрес схемы компоновки по доступным полям объекта
Функция АдресСхемыКомпоновкиПоДоступнымПолямОбъекта(ПолноеИмяТипаМетаданных, ДоступныеПоля, УникальныйИдентификатор, ДляОбъектовИБ) Экспорт
	
	СхемаКомпоновки = СхемаКомпоновкиДанных(ПолноеИмяТипаМетаданных, ДоступныеПоля, ДляОбъектовИБ);
	
	Возврат ПоместитьВоВременноеХранилище(СхемаКомпоновки, УникальныйИдентификатор);
	
КонецФункции

// Получает индекс картинки в коллекции картинок объектов метаданных по полному имение.
// 
// Параметры:
//  ПолноеИмяОбъектаМетаданных - Строка - полное имя объекта метаданных
// 
// Возвращаемое значение:
//  Число - Индекс картинки в коллекции
//
Функция ИндексКартинкиТипаОбъектовМетаданных(ПолноеИмяОбъектаМетаданных) Экспорт
	
	СтрокиПолногоИмени = СтрРазделить(ПолноеИмяОбъектаМетаданных, ".");
		
	Если СтрокиПолногоИмени.Количество() <> 2 Тогда
		Возврат 0;
	КонецЕсли;
		
	ИмяТипаМетаданных = СтрокиПолногоИмени[0];
	
	Если ИмяТипаМетаданных = "Справочник" Тогда
		
		Возврат 3;
	
	ИначеЕсли ИмяТипаМетаданных = "Документ" Тогда
		
		Возврат 7;
		
	ИначеЕсли ИмяТипаМетаданных = "РегистрСведений" Тогда
		
		Возврат 15;
		
	КонецЕсли;
	
КонецФункции

// Возвращает количество объектов определенного типа в информационной базе
// 
// Параметры:
//  ПолноеИмяОбъектаМетаданных - Строка - полное имя объекта, для которого выполняется операция
// 
// Возвращаемое значение:
//  Число - Количество объектов типа в информационной базе
Функция КоличествоОбъектовТипаВИнформационнойБазе(ПолноеИмяОбъектаМетаданных) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаОбъектаМетаданных.Ссылка) КАК КоличествоОбъектов
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаОбъектаМетаданных";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТаблицаДанных",  ПолноеИмяОбъектаМетаданных);
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Возврат Выборка.КоличествоОбъектов;
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции

// Возвращает переданное число прописью по типу метаданного.
// 
// Параметры:
//  ЧислоКПриведению            - Число -для которого формируется строка прописью
//  ПолноеИмяОбъектаМетаданных - Строка - полное имя объекта метаданных, для которого формируется строка
// 
// Возвращаемое значение:
//  Строка - сформированное число прописью
//
Функция ЧислоПрописьюПоТипуМетаданного(ЧислоКПриведению, ПолноеИмяОбъектаМетаданных) Экспорт
	
	ИмяТипаМетаданных = РаботаСРезультатамиОбменаКлиентСервер.ИмяТипаМетаданныхПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
	ПредставлениеТипаМетаданных = РаботаСРезультатамиОбменаКлиентСервер.ПредставлениеТипаМетаданных(ИмяТипаМетаданных);
	
	СклоненияСтроки = Новый Массив;
	
	СклоненияСтроки =  ПолучитьСклоненияСтрокиПоЧислу(ПредставлениеТипаМетаданных, ЧислоКПриведению,,"L=ru_RU; ЧС=Количественное", "ПД=Родительный");
	
	Если СклоненияСтроки.Количество() > 0 Тогда
		Возврат СклоненияСтроки[0];
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Возвращает описание типов, который содержит все планы обмена, которые используют функциональность БСП.
// 
// Возвращаемое значение:
//  ОписаниеТипов - 
//
Функция ОписаниеТипаПланыОбменаБСП() Экспорт
	
	ИменаПлановОбменаБСП = ОбменДаннымиПовтИсп.ПланыОбменаБСП();
	ТипыПлановОбмена     = Новый Массив;
	
	Для Каждого ИмяПланаОбменаБСП Из ИменаПлановОбменаБСП Цикл
		
		ТипыПлановОбмена.Добавить(Тип("ПланОбменаСсылка." + ИмяПланаОбменаБСП));
		
	КонецЦикла;
	
	Возврат Новый ОписаниеТипов(ТипыПлановОбмена);
	
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ПроверитьВозможностьЗагрузкиДругихОбъектовПослеУстановкиСоответствия", Истина);
	Методы.Вставить("ПроверитьКорректностьЗаписейВРегистрахПообъектногоОбмена", Истина);
	Методы.Вставить("ЗагрузитьДанныеДанныеБезОбрабатывающихЗаданий", Истина);
	Методы.Вставить("ОбработатьПереданныеНаЗагрузкуОбъекты", Истина);
	Методы.Вставить("УдалитьЗаписиОтклоненныхПользователемОбъектов", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаCJSON

// Получает данные объекта информационной базы из JSON.
// 
// Параметры:
//  ДанныеОбъектаТекстJSON - Строка - сериализованные данные объекта в формате JSON
// 
// Возвращаемое значение:
//  Неопределено, Произвольный - 
//
Функция ДанныеОбъектаИзJSON(ДанныеОбъектаТекстJSON) Экспорт
	
	ПолученныеДанные = Неопределено;
	
	Если ДанныеОбъектаТекстJSON <> Неопределено Тогда
		
		ПотокВПамяти = Новый ПотокВПамяти;
		
		ЗаписьТекста = Новый ЗаписьТекста(ПотокВПамяти, "UTF8");
		
		ЗаписьТекста.Записать(ДанныеОбъектаТекстJSON);
		
		ЗаписьТекста.Закрыть();
		
		ПотокВПамяти.Перейти(0, ПозицияВПотоке.Начало);
		
		ЧтениеJSON = Новый ЧтениеJSON;
		
		ЧтениеJSON.ОткрытьПоток(ПотокВПамяти, "UTF8");
		
		ПолученныеДанные = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
		
		ЧтениеJSON.Закрыть();
		
	КонецЕсли;
	
	Возврат ПолученныеДанные;
	
КонецФункции

#КонецОбласти

#Область ФормыСписковПроблем

// Формирует представления объектов при получении данных динамического списка на сервере.
// 
// Параметры:
//  ИмяЭлемента - Строка - Имя элемента формы
//  Настройки   - НастройкиТаблицыДинамическогоСписка
//  Строки      - СтрокиДинамическогоСписка
//
Процедура ПолучитьПредставленияОбъектовПриПолученииДанныхНаСервереСписка(ИмяЭлемента, Настройки, Строки) Экспорт
	
	ОбъектыКПолучениюДанных = Новый ТаблицаЗначений;
	ОбъектыКПолучениюДанных.Колонки.Добавить("ПолученныйОбъект",                 ОбщегоНазначения.ОписаниеТипаСтрока(40));
	ОбъектыКПолучениюДанных.Колонки.Добавить("ПравилоКонвертации",               ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ОбъектыКПолучениюДанных.Колонки.Добавить("ОбъектФормата",                    ОбщегоНазначения.ОписаниеТипаСтрока(100));
	
	Для Каждого СтрокаСписка Из Строки Цикл
		
		НоваяСтрока = ОбъектыКПолучениюДанных.Добавить();
		НоваяСтрока.ПолученныйОбъект   = СтрокаСписка.Значение.Данные.ПолученныйОбъект;
		НоваяСтрока.ПравилоКонвертации = СтрокаСписка.Значение.Данные.ПравилоКонвертации;
		НоваяСтрока.ОбъектФормата      = СтрокаСписка.Значение.Данные.ОбъектФормата;
		
	КонецЦикла;
	
	Если ОбъектыКПолучениюДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПараметраУзелПланаОбмена = Настройки.ПараметрыДанных.Элементы.Найти("УзелПланаОбмена");
	
	УзелПланаОбмена = ДанныеПараметраУзелПланаОбмена.Значение;
	
	ПредставленияПолученныхОбъектов = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыКПолучениюДанных.ПолученныйОбъект    КАК ПолученныйОбъект,
	|	ОбъектыКПолучениюДанных.ПравилоКонвертации  КАК ПравилоКонвертации,
	|	ОбъектыКПолучениюДанных.ОбъектФормата       КАК ОбъектФормата
	|ПОМЕСТИТЬ ОбъектыКПолучениюДанных
	|ИЗ &ОбъектыКПолучениюДанных КАК ОбъектыКПолучениюДанных
	|;
	|
	|///////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыКЗагрузке.ПолученныйОбъект                 КАК ПолученныйОбъект,
	|	ОбъектыКЗагрузке.ПравилоКонвертации               КАК ПравилоКонвертации,
	|	ОбъектыКЗагрузке.ОбъектФормата                    КАК ОбъектФормата,
	|	ОбъектыКЗагрузке.ДанныеСконвертированногоОбъекта  КАК ДанныеСконвертированногоОбъекта
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъектыКПолучениюДанных КАК ОбъектыКПолучениюДанных
	|		ПО ОбъектыКЗагрузке.ПолученныйОбъект = ОбъектыКПолучениюДанных.ПолученныйОбъект
	|		И ОбъектыКЗагрузке.ПравилоКонвертации = ОбъектыКПолучениюДанных.ПравилоКонвертации
	|		И ОбъектыКЗагрузке.ОбъектФормата = ОбъектыКПолучениюДанных.ОбъектФормата
	|ГДЕ
	|	ОбъектыКЗагрузке.УзелПланаОбмена = &УзелПланаОбмена";
	
	Запрос.УстановитьПараметр("УзелПланаОбмена",         УзелПланаОбмена);
	Запрос.УстановитьПараметр("ОбъектыКПолучениюДанных", ОбъектыКПолучениюДанных);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСконвертированныхОбъектов = Результат.Выгрузить();
	ДанныеСконвертированныхОбъектов.Колонки.Добавить("ПредставлениеСконвертированногоОбъекта", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	
	Для Каждого СтрокаТаблицы Из ДанныеСконвертированныхОбъектов Цикл
		
		ДанныеJSONСконвертированногоОбъекта = СтрокаТаблицы.ДанныеСконвертированногоОбъекта.Получить();
		
		Если ДанныеJSONСконвертированногоОбъекта = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СконвертированныйОбъект = ДанныеОбъектаИзJSON(ДанныеJSONСконвертированногоОбъекта);
		
		СтрокаТаблицы.ПредставлениеСконвертированногоОбъекта = Строка(СконвертированныйОбъект);
		
	КонецЦикла;
	
	Для Каждого СтрокаСписка Из Строки Цикл
		
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("ПолученныйОбъект",   СтрокаСписка.Значение.Данные.ПолученныйОбъект);
		ПараметрыПоиска.Вставить("ПравилоКонвертации", СтрокаСписка.Значение.Данные.ПравилоКонвертации);
		ПараметрыПоиска.Вставить("ОбъектФормата",      СтрокаСписка.Значение.Данные.ОбъектФормата);
		
		НайденныеСтроки = ДанныеСконвертированныхОбъектов.НайтиСтроки(ПараметрыПоиска);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			ПредставлениеСконвертированногоОбъекта = НайденныеСтроки[0].ПредставлениеСконвертированногоОбъекта;
			Если ПустаяСтрока(ПредставлениеСконвертированногоОбъекта) Тогда
				ПредставлениеСконвертированногоОбъекта = НайденныеСтроки[0].ПолученныйОбъект;
			КонецЕсли;
			СтрокаСписка.Значение.Данные.ПредставлениеОбъекта = ПредставлениеСконвертированногоОбъекта;
		Иначе
			СтрокаСписка.Значение.Данные.ПредставлениеОбъекта = СтрокаСписка.Значение.Данные.ПолученныйОбъект;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Установить условное оформление для колонки "Внешняя ссылка на объект" в списках проблем.
// 
// Параметры:
//  СписокУсловноеОформление - УсловноеОформление - коллекция элементов условного оформления
//  ИмяОформляемогоПоля      - Строка - имя оформляемого поля списка
//
Процедура УстановитьУсловноеОформлениеИдентификаторПолученногоОбъекта(СписокУсловноеОформление, ИмяОформляемогоПоля) Экспорт
	
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Гиперссылка, если есть внешняя ссылка на объект.'");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(ИмяОформляемогоПоля);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВнешняяСсылкаНаОбъект");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ГиперссылкаЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт",      ШрифтыСтиля.КликабельнаяНадписьСпискаШрифт);
	
КонецПроцедуры

// Установить условное оформление для колонки "Тип объекта" в списках проблем.
// 
// Параметры:
//  СписокУсловноеОформление - УсловноеОформление - коллекция элементов условного оформления
//
Процедура УстановитьУсловноеОформлениеТипОбъекта(СписокУсловноеОформление) Экспорт
	
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Текст неопределено, если объект формата не удалось определить'");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("ТипОбъекта");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипОбъекта");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийТекст);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст",      НСтр("ru = '<не определен>'"));
	
КонецПроцедуры

// Изменяет комплексный отбор по статусу загрузки и проблеме в формах проблемы.
// 
// Параметры:
//  Список - ДинамическийСписок - список, для которого изменяется отбор
//  СписокПроблемы - СписокЗначений Из Структура - содержит причины добавления и статусы загрузки
//
Процедура ИзменитьОтборСтатусЗагрузкиПроблемаНаСервере(Список, СписокПроблемы) Экспорт
	
	ЭлементыОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы;
	
	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
	                    ЭлементыОтбора,
	                    "ОтборПричинаСтатусЗагрузки",
	                    ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	
	Для Каждого ЭлементСписка Из СписокПроблемы Цикл
		
		ГруппаУсловия = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		                    ГруппаОтбора,
		                    "",
		                    ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаУсловия, 
		                                                       "ПричинаДобавления", 
		                                                       ВидСравненияКомпоновкиДанных.Равно,
		                                                       ЭлементСписка.Значение.Проблема);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаУсловия, 
		                                                       "СтатусЗагрузки", 
		                                                       ВидСравненияКомпоновкиДанных.Равно,
		                                                       ЭлементСписка.Значение.СтатусЗагрузки);
		
	КонецЦикла;
	
КонецПроцедуры

// Получает сохраненные настройки.
// 
// Параметры:
//  Настройки - Структура - сохраненные настройки формы
//  ДоступныеДляОтбораТипыОбъектов - СписокЗначений Из СправочникСсылка.ИдентификаторыОбъектовМетаданных - типы, которые
//      сейчас доступны для отбора
//  ОбъектыМетаданныхОтбор         - СписокЗначений Из СправочникСсылка.ИдентификаторыОбъектовМетаданных - сохраненный
//      отбор по типам
//  Список                         - ДинамическийСписок - список, для которых устанавливается отбор
//
Процедура ОбработатьСохраненныеНастройкиОтбораОбъектыМетаданныхПередЗагрузкой(Настройки, ДоступныеДляОтбораТипыОбъектов, ОбъектыМетаданныхОтбор, Список) Экспорт
	
	НастройкиОбъектыМетаданныхОтбор = Настройки.Получить("ОбъектыМетаданныхОтбор");
	
	Если НастройкиОбъектыМетаданныхОтбор <> Неопределено Тогда
		
		Для Каждого ЭлементСписка Из НастройкиОбъектыМетаданныхОтбор Цикл
			
			Если ДоступныеДляОтбораТипыОбъектов.НайтиПоЗначению(ЭлементСписка.Значение) <> Неопределено Тогда
				
				ОбъектыМетаданныхОтбор.Добавить(ЭлементСписка.Значение);
				
			КонецЕсли;
			
		КонецЦикла;
		
		УстановитьОтборТипМетаданныхВСписке(Список, ОбъектыМетаданныхОтбор);
		
		Настройки.Удалить("ОбъектыМетаданныхОтбор");
		
	КонецЕсли;

КонецПроцедуры

// Устанавливает отбор по типам метаданных в списке проблем.
// 
// Параметры:
//  Список - ДинамическийСписок - список, в котором устанавливается отбор
//  ОбъектыМетаданныхОтбор      - СписокЗначений Из СправочникСсылка.ИдентификаторыОбъектовМетаданных - устанавливаемый отбор
//
Процедура УстановитьОтборТипМетаданныхВСписке(Список, ОбъектыМетаданныхОтбор) Экспорт
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
	                                                                        "ТипОбъекта",
	                                                                         ОбъектыМетаданныхОтбор,
	                                                                         ВидСравненияКомпоновкиДанных.ВСписке,
	                                                                         ,
	                                                                         ОбъектыМетаданныхОтбор.Количество() > 0);
	
КонецПроцедуры

// Получает представление объекта из данных сконвертированного объекта.
// 
// Параметры:
//  ДанныеСконвертированногоОбъекта - ХранилищеЗначения - данные сконвертированного объекта
// 
// Возвращаемое значение:
//  Неопределено, Строка - 
Функция ПредставлениеИзДанныхСконвертированногоОбъекта(ДанныеСконвертированногоОбъекта) Экспорт
	
	ДанныеJSONСконвертированногоОбъекта = ДанныеСконвертированногоОбъекта.Получить();
		
	Если ДанныеJSONСконвертированногоОбъекта = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СконвертированныйОбъект = ДанныеОбъектаИзJSON(ДанныеJSONСконвертированногоОбъекта);
	
	Возврат Строка(СконвертированныйОбъект);
	
КонецФункции

// Формирует навигационную ссылку для формы списка типа проблем
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, для которой получается навигационная ссылка
// 
// Возвращаемое значение:
//  Строка - Навигационная ссылка формы списка
Функция НавигационнаяСсылкаФормыСписка(Форма) Экспорт
	
	ДанныеНавигационнойСсылки = Новый Структура;
	ДанныеНавигационнойСсылки.Вставить("УзелИнформационнойБазы", Форма.УзелИнформационнойБазы);
	ДанныеНавигационнойСсылки.Вставить("ИмяФормы",               Форма.ИмяФормы);
	
	Возврат ПолучитьНавигационнуюСсылку(
		Метаданные.Обработки.РаботаСРезультатамиОбмена, Форма.Заголовок, ДанныеНавигационнойСсылки);
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаПоПользовательскойКоманде

// Метод-конструктор, который используется для описания действий, которые позволяют отключать проверки происходящие
// в процессе при конвертации объектов.
//
// Возвращаемое значение:
//   Структура:
//    * ИгнорироватьНедостающиеСсылки                    - Булево - признак необходимости отключения проверки
//                                                                  недостающих ссылок.
//    * ПодтверждениеЗагрузкиВыполнено                   - Булево - признак, что подтверждение загрузки было выполнено,
//                                                                  т.е. отключает запрет загрузки объектов, требующих
//                                                                  подтверждения пользователя.
//    * НеПроверятьОсвободившиесяОбъектыПриЗаписиВПИСО   - Булево - признак необходимости отключения проверки
//                                                                  освобожденных объектов при записи в ПИСО
//    * ИгнорироватьПроблемыПриЗаписи                    - Булево - признак того, что следует игнорировать проблемы при записи
//    * ИспользоватьПереданныеДействияПриПолучении       - Булево - признак того, что вместо настроек из РС "Действия
//                                                                  при получении данных обмена" нужно использовать
//                                                                  значения из параметра "ДействияПриПолучении"
//    * ДействияПриПолучении                             - Структура - содержит:
//      ** УстанавливатьСоответствия - ПеречислениеСсылка.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных - 
//      ** КакЗагружать              - ПеречислениеСсылка.ВариантыДействийПриПолученииДанныхОбмена - 
//
Функция НовыйПараметрыПередачиОбъектовНаЗагрузку() Экспорт
	
	ДействияПриПолучении = Новый Структура;
	ДействияПриПолучении.Вставить("УстанавливатьСоответствия", Неопределено);
	ДействияПриПолучении.Вставить("КакЗагружать",              Неопределено);
	
	ПараметрыПередачи = Новый Структура;
	ПараметрыПередачи.Вставить("ИгнорироватьНедостающиеСсылки",                  Ложь);
	ПараметрыПередачи.Вставить("ПодтверждениеЗагрузкиВыполнено",                 Ложь);
	ПараметрыПередачи.Вставить("НеПроверятьОсвободившиесяОбъектыПриЗаписиВПИСО", Ложь);
	ПараметрыПередачи.Вставить("ИгнорироватьПроблемыПриЗаписи",                  Ложь);
	ПараметрыПередачи.Вставить("ИспользоватьПереданныеДействияПриПолучении",     Ложь);
	ПараметрыПередачи.Вставить("ДействияПриПолучении",                           ДействияПриПолучении);
	
	Возврат ПараметрыПередачи;
	
КонецФункции

// Устанавливает для записей РС "Объекты к загрузке" причину добавления "Готов к загрузке" при выполнении пользователем
// команды в списке.
// 
// Параметры:
//  КлючиЗаписейКОбработке - Массив Из См. РаботаСРезультатамиОбменаКлиентСервер.НовыйКлючЗаписиОбъектыКЗагрузке -
//                           изменяемые записи
// 
// Возвращаемое значение:
//  Структура - Результат установки причины готов к загрузке:
// * КоличествоКОбработке         - Число - количество записей, которое было передано на обработку
// * КоличествоОбработано         - Число - количество успешно обработанных записей
// * Ошибки                       - Массив Из Строка - содержит ошибки, если таковые были
// * ИдентификаторФоновогоЗадания - Строка - идентификатор обрабатывающего фонового задания
//
Функция РезультатУстановкиПричиныГотовКЗагрузке(КлючиЗаписейКОбработке) Экспорт
	
	РезультатУстановки = Новый Структура;
	РезультатУстановки.Вставить("КоличествоКОбработке",         КлючиЗаписейКОбработке.Количество());
	РезультатУстановки.Вставить("КоличествоОбработано",         0);
	РезультатУстановки.Вставить("Ошибки",                       Новый Массив);
	РезультатУстановки.Вставить("ИдентификаторФоновогоЗадания", НовыйИдентификаторФоновогоЗадания());
	
	Для Каждого КлючЗаписиКОбработке Из КлючиЗаписейКОбработке Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			ДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеИзмененияЗаписиРегистра();
			
			ДанныеЗаписи.ПолученныйОбъект   = КлючЗаписиКОбработке.ПолученныйОбъект;
			ДанныеЗаписи.ПравилоКонвертации = КлючЗаписиКОбработке.ПравилоКонвертации;
			ДанныеЗаписи.ОбъектФормата      = КлючЗаписиКОбработке.ОбъектФормата;
			ДанныеЗаписи.УзелПланаОбмена    = КлючЗаписиКОбработке.УзелПланаОбмена;
			
			ДанныеЗаписи.ДатаУстановкиПричиныДобавления = ТекущаяДатаСеанса();
			ДанныеЗаписи.ПричинаДобавления              = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ГотовоКЗагрузке;
			ДанныеЗаписи.КлючОбрабатывающегоЗадания     = РезультатУстановки.ИдентификаторФоновогоЗадания;
			
			РегистрыСведений.ОбъектыКЗагрузке.ИзменитьЗаписьРегистра(ДанныеЗаписи);
			
			РезультатУстановки.КоличествоОбработано = РезультатУстановки.КоличествоОбработано + 1;
			
			ЗафиксироватьТранзакцию();
		
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстШаблона = НСтр("ru = 'При выполнении операции отклонения загрузки объекта с идентификатором %1 для приложения корреспондента %2 произошла ошибка'");
			РезультатУстановки.Ошибки.Добавить(СтрШаблон(ТекстШаблона, КлючЗаписиКОбработке.ПолученныйОбъект, КлючЗаписиКОбработке.УзелПланаОбмена));
		
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат РезультатУстановки;
	
КонецФункции

// Стартует фоновое задание по загрузке объектов при выполнении пользовательской команды.
// 
// Параметры:
//  УникальныйИдентификатор       - УникальныйИдентификатор - идентификатор фонового задания
//  УзелИнформационнойБазы        - ПланОбменаСсылкаИмяПланаОбмена - узел приложения корреспондента
//  КлючФоновогоЗадания           - Строка    - уникальный ключ для активных фоновых заданий, имеющих такое же имя процедуры
//  ПараметрыПередачи             - Структура - см.РаботаСРезультатамиОбмена.НовыйПараметрыПередачиОбъектовНаЗагрузку.
//  ИгнорироватьПроблемыПриЗаписи - Булево - признак того, что при загрузке нужно игнорировать возникающие проблемы при записи.
// 
// Возвращаемое значение:
//   см. ДлительныеОперации.ВыполнитьВФоне
// 
Функция ДлительнаяОперацияЗагрузкиОбъектов(УникальныйИдентификатор, УзелИнформационнойБазы, КлючФоновогоЗадания, ПараметрыПередачи) Экспорт
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("УзелИнформационнойБазы",        УзелИнформационнойБазы);
	ПараметрыПроцедуры.Вставить("КлючФоновогоЗадания",           КлючФоновогоЗадания);
	ПараметрыПроцедуры.Вставить("ПараметрыПередачи",             ПараметрыПередачи);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.КлючФоновогоЗадания = КлючФоновогоЗадания;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка объектов, полученных по обмену, инициированная пользователем'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("РаботаСРезультатамиОбмена.ОбработатьПереданныеНаЗагрузкуОбъекты",
	                                                       ПараметрыПроцедуры, ПараметрыВыполнения);
	Возврат ДлительнаяОперация;
	
КонецФункции

// Обработать переданные на загрузку объекты пользователем объекты.
// 
// Параметры:
//  ПараметрыОбработки - Структура - содержит:
//    * УзелИнформационнойБазы         - ПланОбменаСсылкаИмяПланаОбмена - узел приложения корреспондента
//    * КлючФоновогоЗадания           - Строка    - уникальный ключ для активных фоновых заданий, имеющих такое же имя процедуры
//    * ИгнорироватьНедостающиеСсылки - Булево - признак того, что при загрузке нужно игнорировать недостающие в
//                                               загружаемом объекте ссылки.
//  АдресХранилища     - Строка - адрес временного хранилища, в который будет помещен результат обработки
//
Процедура ОбработатьПереданныеНаЗагрузкуОбъекты(ПараметрыОбработки, АдресХранилища) Экспорт
	
	РезультатОбработки = РезультатОбработкиПереданныхНаЗагрузкуОбъектов(
		ПараметрыОбработки.УзелИнформационнойБазы,
		ПараметрыОбработки.КлючФоновогоЗадания,
		ПараметрыОбработки.ПараметрыПередачи);
	
	ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);
	
КонецПроцедуры

// Выполняет загрузку объектов после выполнения пользовательской команды
// 
// Параметры:
//  УзелПланаОбмена               - ПланОбменаСсылкаИмяПланаОбмена - узел приложения корреспондента
//  ИдентификаторФоновогоЗадания  - Строка    - идентификатор фонового задания, который обрабатывает данную команду
//  ПараметрыЗагрузки - см. РаботаСРезультатамиОбмена.НовыйПараметрыПередачиОбъектовНаЗагрузку 
// 
// Возвращаемое значение:
//  Структура - Результат обработки переданных на загрузку объектов:
// * Успешно - Булево - признак успешности выполнения операции
// * СтатусыЗагрузки - Массив Из ПеречислениеСсылка.СтатусыОбновленияОбъектаПриПроблемахЗаписи, Неопределено
// * Ошибки - Массив Из Строка - содержит ошибки, если такие возникали
// * НовыеПричины - Соответствие Из Число - 
// * ОповещатьОбИзменении - Булево - признак, необходимости оповещать об изменении открытые формы списков проблем 
Функция РезультатОбработкиПереданныхНаЗагрузкуОбъектов(УзелПланаОбмена, ИдентификаторФоновогоЗадания, ПараметрыЗагрузки) Экспорт
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("Успешно",              Истина);
	РезультатОбработки.Вставить("Ошибки",               Новый Массив);
	РезультатОбработки.Вставить("СтатусыЗагрузки",      Новый Массив);
	РезультатОбработки.Вставить("НовыеПричины",         Новый Соответствие);
	РезультатОбработки.Вставить("ОповещатьОбИзменении", Ложь);
	
	ИдентификаторЗаданияСтрокой = СтрЗаменить(Строка(ИдентификаторФоновогоЗадания), "-", "_");
	
	КомпонентыОбмена = КонвертацияОбъектноСлужебныйПовтИсп.КомпонентыОбменаДляИнтерактивнойРаботы(УзелПланаОбмена, "Получение");
	
	Если КомпонентыОбмена = Неопределено Тогда
		
		РезультатОбработки.Успешно = Ложь;
		РезультатОбработки.Ошибки.Добавить(НСтр("ru = 'Не удалось инициализировать компоненты обмена.'"));
		
		Возврат РезультатОбработки;
		
	КонецЕсли;
	
	Пока Истина Цикл
		
		ДанныеДляЗагрузки = 
			РегистрыСведений.ОбъектыКЗагрузке.ДанныеДляЗагрузкиПоИдентификаторуФоновогоЗадания(ИдентификаторЗаданияСтрокой);
			
		Если ДанныеДляЗагрузки.Количество() = 0 Тогда
			Возврат РезультатОбработки;
		КонецЕсли;
		
		РезультатКонвертацииИЗагрузки = 
			КонвертацияОбъектноСервер.КонвертироватьЗачитанныеДанныеСОтчетом(КомпонентыОбмена, ДанныеДляЗагрузки, ПараметрыЗагрузки);
		
		ПреобразованныйРезультат = ПреобразованныйРезультатКонвертацииИЗагрузкиДляВыводаПользователю(РезультатКонвертацииИЗагрузки, УзелПланаОбмена);
		
		ДополнитьНовыеПричины(РезультатОбработки.НовыеПричины, ПреобразованныйРезультат.НовыеПричины);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РезультатОбработки.Ошибки,          ПреобразованныйРезультат.Ошибки);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РезультатОбработки.СтатусыЗагрузки, ПреобразованныйРезультат.СтатусыЗагрузки);
		
		Если РезультатОбработки.НовыеПричины.Количество() > 0 Тогда
			
			РезультатОбработки.ОповещатьОбИзменении = Истина;
			
		КонецЕсли;
		
		Если ПреобразованныйРезультат.УстановленныеСоответствия.Количество() > 0 Тогда
			
			ОбработатьУстановкуСоответствияДляМассиваОбъектов(ПреобразованныйРезультат.УстановленныеСоответствия, 
			                                                  ИдентификаторЗаданияСтрокой,
			                                                  УзелПланаОбмена);
			
		КонецЕсли;
	
	КонецЦикла;
	
	ПолучитьСообщенияПользователю(Истина);
	
	Возврат РезультатОбработки;
	
КонецФункции

// Выполняет необходимые действия после установки соответствий. 
// Удаляет записи из РС "Объекты, блокирующие загрузку", проверяет необходимость удаления записей из РС "Объекты к загрузке"
// Проверяет объекты с причиной добавления "Ожидает загрузку других объектов" на предмет возможности их загрузки.
// 
// Параметры:
//  УстановленныеСоответствия - Массив Из Структура - Данные объектов, которым было установлено соответствия
//  ИдентификаторФоновогоЗадания - Строка - Идентификатор фонового задания
//
Процедура ОбработатьУстановкуСоответствияДляМассиваОбъектов(УстановленныеСоответствия, ИдентификаторФоновогоЗадания, УзелПланаОбмена) Экспорт
	
	Если УстановленныеСоответствия.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаИдентификаторов = РегистрыСведений.ОбъектыБлокирующиеЗагрузку.НовыйТаблицаИдентификаторовКПроверке();
	
	Для Каждого ДанныеСопоставленногоОбъекта Из УстановленныеСоответствия Цикл
		
		НоваяСтрока = ТаблицаИдентификаторов.Добавить();
		НоваяСтрока.Идентификатор          = ДанныеСопоставленногоОбъекта.ПолученныйОбъект;
		НоваяСтрока.ОбъектФормата          = ДанныеСопоставленногоОбъекта.ОбъектФормата;
		НоваяСтрока.УзелИнформационнойБазы = УзелПланаОбмена;
		
	КонецЦикла;
	
	ДанныеЗаписейКУдалению = 
		РегистрыСведений.ОбъектыБлокирующиеЗагрузку.ДанныеЗаписейКУдалениюПослеУстановкиСоответствий(ТаблицаИдентификаторов);
		
	Если ДанныеЗаписейКУдалению.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыКЗагрузкеКПроверке = ДанныеЗаписейКУдалению.Скопировать();
	ОбъектыКЗагрузкеКПроверке.Свернуть("ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата, УзелПланаОбмена");
	
	РегистрыСведений.ОбъектыБлокирующиеЗагрузку.УдалитьЗаписиРегистраПоТаблице(ДанныеЗаписейКУдалению, Истина);
	
	РезультатОбработкиОбъектовОбъектовКЗагрузкеПослеУдаленияБлокирующих(ОбъектыКЗагрузкеКПроверке, ИдентификаторФоновогоЗадания);
	
КонецПроцедуры

// Результат загрузки объекта из формы проблемы.
// 
// Параметры:
//  ДанныеОбъектаКОбработке - см. РаботаСРезультатамиОбменаКлиент.ДанныеПроблемыКОбработкеПоДаннымФормы
// 
// Возвращаемое значение:
//  Структура - Результат загрузки объекта из формы проблемы:
// * Успешно - Булево - признак успешности выполнения операции
// * ИдентификаторФоновогоЗадания - Строка - идентификатор обрабатывающего фонового задания
// * УстановленныеСоответствия - Массив Из Строка - идентификаторы объектов, которым были установлены соответствия
// * СтатусыЗагрузки - Массив Из Структура - Статусы загрузки обработанных записей
// * Ошибки - Массив Из Строка - содержит ошибки, если такие возникли при обработке 
// * РезультатОбработки - Неопределено, Соответствие Из Число - установленные причины и их количество
//
Функция РезультатЗагрузкиОбъектаИзФормыПроблемы(ДанныеОбъектаКОбработке) Экспорт
	
	РезультатЗагрузки = Новый Структура;
	РезультатЗагрузки.Вставить("Успешно",                      Истина);
	РезультатЗагрузки.Вставить("ИдентификаторФоновогоЗадания", НовыйИдентификаторФоновогоЗадания());
	РезультатЗагрузки.Вставить("УстановленныеСоответствия",    Новый Массив);
	РезультатЗагрузки.Вставить("СтатусыЗагрузки",              Новый Массив);
	РезультатЗагрузки.Вставить("Ошибки",                       Новый Массив);
	РезультатЗагрузки.Вставить("РезультатОбработки",           Неопределено);
	
	БылРаспроведенДокумент = Ложь;
	ПредставлениеДокумента = "";
	
	НачатьТранзакцию();
	
	Попытка
		
		Если ДанныеОбъектаКОбработке.УстановленноеСоответствие <> Неопределено Тогда
			
			РезультатОтражения = РезультатОтраженияРучногоСопоставления(ДанныеОбъектаКОбработке.ПолученныйОбъект,
			                                                            ДанныеОбъектаКОбработке.ПравилоКонвертации,
			                                                            ДанныеОбъектаКОбработке.ОбъектФормата,
			                                                            ДанныеОбъектаКОбработке.УзелПланаОбмена,
			                                                            ДанныеОбъектаКОбработке.УстановленноеСоответствие);
			
			Если Не РезультатОтражения.Успешно Тогда
				
				РезультатЗагрузки.Успешно     = Ложь;
				РезультатЗагрузки.Ошибки.Добавить(РезультатОтражения.ТекстОшибки);
				
				ОтменитьТранзакцию();
				
				Возврат РезультатЗагрузки;
				
			Иначе
				
				ДанныеСопоставления = Новый Структура;
				ДанныеСопоставления.Вставить("ПолученныйОбъект", ДанныеОбъектаКОбработке.ПолученныйОбъект);
				ДанныеСопоставления.Вставить("ОбъектИБ",         ДанныеОбъектаКОбработке.УстановленноеСоответствие);
				
				РезультатЗагрузки.УстановленныеСоответствия.Добавить(ДанныеСопоставления);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ДанныеОбъектаКОбработке.ИгнорироватьПроблемыПриЗаписи  Тогда
			
			Если ДанныеОбъектаКОбработке.СоответствиеВИБ <> Неопределено Тогда
				
				Если ОбщегоНазначения.ЭтоДокумент(ДанныеОбъектаКОбработке.СоответствиеВИБ.Метаданные()) Тогда
					
					ДокументОбъект         = ДанныеОбъектаКОбработке.СоответствиеВИБ.ПолучитьОбъект();
					ПредставлениеДокумента = Строка(ДокументОбъект);
					
					Если ДокументОбъект.Проведен Тогда
					
						Попытка
							
							ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
							БылРаспроведенДокумент = Истина;
							
						Исключение
							
							РезультатЗагрузки.Успешно = Ложь;
							ТекстШаблона = НСтр("ru = 'Не удалось загрузить объект по причине. При попытке отменить проведение возникла ошибка ""%1""'");
							РезультатЗагрузки.Ошибки.Добавить(СтрШаблон(ТекстШаблона, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
							
							Возврат РезультатЗагрузки;
						
						КонецПопытки;
					
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеИзмененияЗаписиРегистра();
		
		ДанныеЗаписи.ПолученныйОбъект   = ДанныеОбъектаКОбработке.ПолученныйОбъект;
		ДанныеЗаписи.ПравилоКонвертации = ДанныеОбъектаКОбработке.ПравилоКонвертации;
		ДанныеЗаписи.ОбъектФормата      = ДанныеОбъектаКОбработке.ОбъектФормата;
		ДанныеЗаписи.УзелПланаОбмена    = ДанныеОбъектаКОбработке.УзелПланаОбмена;
		
		ДанныеЗаписи.ДатаУстановкиПричиныДобавления = ТекущаяДатаСеанса();
		ДанныеЗаписи.ПричинаДобавления              = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ГотовоКЗагрузке;
		ДанныеЗаписи.КлючОбрабатывающегоЗадания     = РезультатЗагрузки.ИдентификаторФоновогоЗадания;
		
		Если РезультатЗагрузки.УстановленныеСоответствия.Количество() > 0 Тогда
			ДанныеЗаписи.СсылкаНаОбъект = РезультатЗагрузки.УстановленныеСоответствия[0].ОбъектИБ;
		КонецЕсли;
		
		РегистрыСведений.ОбъектыКЗагрузке.ИзменитьЗаписьРегистра(ДанныеЗаписи);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		РезультатЗагрузки.Успешно = Ложь;
		ТекстШаблона = НСтр("ru = 'Не удалось загрузить объект по причине ""%1""'");
		РезультатЗагрузки.Ошибки.Добавить(СтрШаблон(ТекстШаблона, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
		
		Возврат РезультатЗагрузки;
		
	КонецПопытки;
	
	ДанныеДляЗагрузки = РегистрыСведений.ОбъектыКЗагрузке.ДанныеДляЗагрузкиПоИдентификаторуФоновогоЗадания(РезультатЗагрузки.ИдентификаторФоновогоЗадания);
	
	КомпонентыОбмена = КонвертацияОбъектноСлужебныйПовтИсп.КомпонентыОбменаДляИнтерактивнойРаботы(ДанныеОбъектаКОбработке.УзелПланаОбмена, "Получение");
	
	Если КомпонентыОбмена = Неопределено Тогда
		
		РезультатЗагрузки.Успешно = Ложь;
		РезультатЗагрузки.Ошибки.Добавить(НСтр("ru = 'Загрузка не выполнена. Не удалось инициализировать компоненты обмена.'"));
		
		Возврат РезультатЗагрузки
		
	КонецЕсли;
	
	ПараметрыЗагрузки = НовыйПараметрыПередачиОбъектовНаЗагрузку();
	ПараметрыЗагрузки.ИгнорироватьНедостающиеСсылки                   = ДанныеОбъектаКОбработке.ИгнорироватьНедостающиеСсылки;
	ПараметрыЗагрузки.ИгнорироватьПроблемыПриЗаписи                   = ДанныеОбъектаКОбработке.ИгнорироватьПроблемыПриЗаписи; 
	ПараметрыЗагрузки.ПодтверждениеЗагрузкиВыполнено                  = Истина;
	ПараметрыЗагрузки.НеПроверятьОсвободившиесяОбъектыПриЗаписиВПИСО  = Истина;
	
	РезультатКонвертацииИЗагрузки = 
		КонвертацияОбъектноСервер.КонвертироватьЗачитанныеДанныеСОтчетом(КомпонентыОбмена, ДанныеДляЗагрузки, ПараметрыЗагрузки);
	
	Если КомпонентыОбмена.ИсторияКонвертацииДанных.ЕстьОшибкаСобытияПередКонвертацией = Истина Тогда
		
		ДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеИзмененияЗаписиРегистра();
		ЗаполнитьЗначенияСвойств(ДанныеЗаписи, ДанныеОбъектаКОбработке);
		
		ДанныеЗаписи.ДатаУстановкиПричиныДобавления = ТекущаяДатаСеанса();
		ДанныеЗаписи.ПолноеПредставлениеОшибки = КомпонентыОбмена.ИсторияКонвертацииДанных["ТекстыОшибок"]["ОшибкаСобытияПередКонвертацией"];
		ДанныеЗаписи.КраткоеПредставлениеОшибки = КомпонентыОбмена.ИсторияКонвертацииДанных["ТекстыОшибок"]["ОшибкаСобытияПередКонвертацией"];
		
		РегистрыСведений.ОбъектыКЗагрузке.ИзменитьЗаписьРегистра(ДанныеЗаписи);
		
		Возврат РезультатЗагрузки;
		
	КонецЕсли; 
	
	ПреобразованныйРезультат = ПреобразованныйРезультатКонвертацииИЗагрузкиДляВыводаПользователю(РезультатКонвертацииИЗагрузки, ДанныеОбъектаКОбработке.УзелПланаОбмена);
	
	РезультатЗагрузки.РезультатОбработки        = ПреобразованныйРезультат.НовыеПричины;
	
	Если БылРаспроведенДокумент Тогда
		
		Для Каждого ОбработаннаяЗапись Из ПреобразованныйРезультат.СтатусыЗагрузки Цикл
			
			Если ОбработаннаяЗапись.ПричинаДобавления <> "Загружен" Тогда
				
				ТекстОтменыПроведения = СтрШаблон(НСтр("ru = 'При интерактивной загрузке документа ""%1"" была выполнена отмена его проведения. При последующей обработке возникла ошибка.'"),
				                                  ПредставлениеДокумента);
				
				ДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеЗаписиРегистра();
				ДанныеЗаписи.ПолученныйОбъект   = ОбработаннаяЗапись.ПолученныйОбъект;
				ДанныеЗаписи.ПравилоКонвертации = ОбработаннаяЗапись.ПравилоКонвертации;
				ДанныеЗаписи.ОбъектФормата      = ОбработаннаяЗапись.ОбъектФормата;
				ДанныеЗаписи.УзелПланаОбмена    = ОбработаннаяЗапись.УзелПланаОбмена;
				
				ПрочитанныеДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.ДанныеЗаписиРегистра(ДанныеЗаписи);
				
				ДанныеИзмененияЗаписи = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеИзмененияЗаписиРегистра();
				ДанныеИзмененияЗаписи.ПолученныйОбъект   = ОбработаннаяЗапись.ПолученныйОбъект;
				ДанныеИзмененияЗаписи.ПравилоКонвертации = ОбработаннаяЗапись.ПравилоКонвертации;
				ДанныеИзмененияЗаписи.ОбъектФормата      = ОбработаннаяЗапись.ОбъектФормата;
				ДанныеИзмененияЗаписи.УзелПланаОбмена    = ОбработаннаяЗапись.УзелПланаОбмена;
				ДанныеИзмененияЗаписи.КраткоеПредставлениеОшибки = ТекстОтменыПроведения + Символы.ПС + Символы.ПС + ПрочитанныеДанныеЗаписи.КраткоеПредставлениеОшибки;
				ДанныеИзмененияЗаписи.ПолноеПредставлениеОшибки  = ТекстОтменыПроведения + Символы.ПС + Символы.ПС + ПрочитанныеДанныеЗаписи.ПолноеПредставлениеОшибки;
				
				РегистрыСведений.ОбъектыКЗагрузке.ИзменитьЗаписьРегистра(ДанныеИзмененияЗаписи);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	РезультатЗагрузки.Ошибки                    = ПреобразованныйРезультат.Ошибки;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РезультатЗагрузки.УстановленныеСоответствия, ПреобразованныйРезультат.УстановленныеСоответствия);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РезультатЗагрузки.СтатусыЗагрузки,           ПреобразованныйРезультат.СтатусыЗагрузки);
	
	ПолучитьСообщенияПользователю(Истина);
	
	Возврат РезультатЗагрузки;
	
КонецФункции

#КонецОбласти

#Область ОтклонениеЗагрузки

// Устанавливает для записей РС "Объекты к загрузке" причину добавления "Загрузка отклонена" при выполнении
// пользователем команды в списке.
// 
// Параметры:
//  КлючиЗаписейКОбработке - Массив Из См. РаботаСРезультатамиОбменаКлиентСервер.НовыйКлючЗаписиОбъектыКЗагрузке -
//                           изменяемые записи
// 
// Возвращаемое значение:
//  Структура - Результат установки причины готов к загрузке:
// * КоличествоКОбработке         - Число - количество записей, которое было передано на обработку
// * КоличествоОбработано         - Число - количество успешно обработанных записей
// * Ошибки                       - Массив Из Строка - содержит ошибки, если таковые были
// * ИдентификаторФоновогоЗадания - Строка - идентификатор обрабатывающего фонового задания
//
Функция РезультатУстановкиПричиныЗагрузкаОтклонена(КлючиЗаписейКОбработке) Экспорт
	
	РезультатУстановки = Новый Структура;
	РезультатУстановки.Вставить("КоличествоКОбработке",         КлючиЗаписейКОбработке.Количество());
	РезультатУстановки.Вставить("КоличествоОбработано",         0);
	РезультатУстановки.Вставить("Ошибки",                       Новый Массив);
	РезультатУстановки.Вставить("ИдентификаторФоновогоЗадания", НовыйИдентификаторФоновогоЗадания());
	
	Для Каждого КлючЗаписиКОбработке Из КлючиЗаписейКОбработке Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			ДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеИзмененияЗаписиРегистра();
			
			ДанныеЗаписи.ПолученныйОбъект   = КлючЗаписиКОбработке.ПолученныйОбъект;
			ДанныеЗаписи.ПравилоКонвертации = КлючЗаписиКОбработке.ПравилоКонвертации;
			ДанныеЗаписи.ОбъектФормата      = КлючЗаписиКОбработке.ОбъектФормата;
			ДанныеЗаписи.УзелПланаОбмена    = КлючЗаписиКОбработке.УзелПланаОбмена;
			
			ДанныеЗаписи.ДатаУстановкиПричиныДобавления              = ТекущаяДатаСеанса();
			ДанныеЗаписи.ПричинаДобавления                           = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ЗагрузкаОтклонена;
			ДанныеЗаписи.КлючОбрабатывающегоЗадания                  = РезультатУстановки.ИдентификаторФоновогоЗадания;
			
			РегистрыСведений.ОбъектыКЗагрузке.ИзменитьЗаписьРегистра(ДанныеЗаписи);
			
			РезультатУстановки.КоличествоОбработано = РезультатУстановки.КоличествоОбработано + 1;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстШаблона = НСтр("ru = 'При выполнении операции отклонения загрузки объекта с идентификатором %1 для приложения корреспондента %2 произошла ошибка'");
			ТекстОшибки = СтрШаблон(ТекстШаблона, КлючЗаписиКОбработке.ПолученныйОбъект, КлючЗаписиКОбработке.УзелПланаОбмена);
			РезультатУстановки.Ошибки.Добавить(ТекстОшибки);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат РезультатУстановки;
	
КонецФункции

// Стартует фоновое задание по загрузке объектов при выполнении пользовательской команды.
// 
// Параметры:
//  УникальныйИдентификатор       - УникальныйИдентификатор - идентификатор фонового задания
//  КлючФоновогоЗадания           - Строка    - уникальный ключ для активных фоновых заданий, имеющих такое же имя процедуры
// 
// Возвращаемое значение:
//   см. ДлительныеОперации.ВыполнитьВФоне
// 
Функция ДлительнаяОперацияУдаленияОтклоненныхЗаписей(УникальныйИдентификатор, КлючФоновогоЗадания) Экспорт
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("КлючФоновогоЗадания",    КлючФоновогоЗадания);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.КлючФоновогоЗадания = КлючФоновогоЗадания;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Удаление записей отклоненных пользователем объектов'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("РаботаСРезультатамиОбмена.УдалитьЗаписиОтклоненныхПользователемОбъектов",
	                                                       ПараметрыПроцедуры, ПараметрыВыполнения);
	Возврат ДлительнаяОперация;
	
КонецФункции

// Обработчик фонового задания, который выполняет фактическое удаление записей, отклоненных пользователем.
// 
// Параметры:
//  ПараметрыОбработки - Структура - содержит:
//    * КлючФоновогоЗадания           - Строка    - уникальный ключ для активных фоновых заданий, имеющих такое же имя процедуры
//  АдресХранилища     - Строка - адрес временного хранилища, в который будет помещен результат обработки
//
Процедура УдалитьЗаписиОтклоненныхПользователемОбъектов(ПараметрыОбработки, АдресХранилища) Экспорт
	
	РезультатУдаления = РезультатУдаленияЗаписейОтклоненныхПользователемОбъектов(
		ПараметрыОбработки.КлючФоновогоЗадания);
	
	ПоместитьВоВременноеХранилище(РезультатУдаления, АдресХранилища);
	
КонецПроцедуры

// Выполняет фактическое удаление записей, отклоненных пользователем
// 
// Параметры:
//  УзелПланаОбмена                - ПланОбменаСсылкаИмяПланаОбмена - узел приложения корреспондента
//  КлючФоновогоЗадания  - Строка  - идентификатор фонового задания, который обрабатывает данную команду
//  ИгнорироватьНедостающиеСсылки  - Булево - признак того, что при загрузке нужно игнорировать недостающие в
//                                            загружаемом объекте ссылки.
// 
// Возвращаемое значение:
//  Структура - Результат обработки переданных на загрузку объектов:
// * Успешно - Булево - признак успешности выполнения операции
// * Ошибки - Массив Из Строка - содержит ошибки, если такие возникали
//
Функция РезультатУдаленияЗаписейОтклоненныхПользователемОбъектов(КлючФоновогоЗадания) Экспорт
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("Успешно",    Истина);
	РезультатОбработки.Вставить("Ошибки",     Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыКЗагрузке.ПолученныйОбъект               КАК ПолученныйОбъект,
	|	ОбъектыКЗагрузке.ПравилоКонвертации             КАК ПравилоКонвертации,
	|	ОбъектыКЗагрузке.ОбъектФормата                  КАК ОбъектФормата,
	|	ОбъектыКЗагрузке.УзелПланаОбмена                КАК УзелПланаОбмена,
	|	ОбъектыКЗагрузке.ДатаОбрабатываемойВерсии       КАК ДатаОбрабатываемойВерсии
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|ГДЕ
	|	ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ЗагрузкаОтклонена)
	|	И ОбъектыКЗагрузке.КлючОбрабатывающегоЗадания = &КлючФоновогоЗадания";
	
	Запрос.УстановитьПараметр("КлючФоновогоЗадания", КлючФоновогоЗадания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат РезультатОбработки;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			ДанныеУспешнойОбработки = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеУспешнойОбработкиОбъекта();
			
			ДанныеУспешнойОбработки.ПолученныйОбъект                      = Выборка.ПолученныйОбъект;
			ДанныеУспешнойОбработки.ПравилоКонвертации                    = Выборка.ПравилоКонвертации;
			ДанныеУспешнойОбработки.ОбъектФормата                         = Выборка.ОбъектФормата;
			ДанныеУспешнойОбработки.УзелПланаОбмена                       = Выборка.УзелПланаОбмена;
			ДанныеУспешнойОбработки.ДатаОбрабатываемойВерсии              = Выборка.ДатаОбрабатываемойВерсии;
			
			РегистрыСведений.ОбъектыКЗагрузке.ОтразитьУспешнуюОбработкуОбъекта(ДанныеУспешнойОбработки);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			РезультатОбработки.Ошибки.Добавить(ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
		КонецПопытки;
	
	КонецЦикла;
	
	Возврат РезультатОбработки;
	
КонецФункции

// Результат отклонения загрузки объекта из формы проблемы.
// 
// Параметры:
//  ДанныеОбъектаКОбработке - см. РаботаСРезультатамиОбменаКлиент.ДанныеПроблемыКОбработкеПоДаннымФормы
// 
// Возвращаемое значение:
//  Структура - Результат загрузки объекта из формы проблемы:
// * Успешно - Булево - признак успешности выполнения операции
// * ИдентификаторФоновогоЗадания - Строка - идентификатор обрабатывающего фонового задания
// * УстановленоСоответствие - Булево - признак того, что полученному объекту было установлено соответствие
// * ТекстОшибки - Строка - содержит текст ошибки, если таковая возникла 
//
Функция РезультатУстановкиПричиныЗагрузкаОтклоненаВФормеПроблемы(ДанныеОбъектаКОбработке) Экспорт
	
	РезультатУстановки = Новый Структура;
	РезультатУстановки.Вставить("Успешно",                      Истина);
	РезультатУстановки.Вставить("ИдентификаторФоновогоЗадания", НовыйИдентификаторФоновогоЗадания());
	РезультатУстановки.Вставить("УстановленоСоответствие",      Ложь);
	РезультатУстановки.Вставить("ТекстОшибки",                  "");
	
	НачатьТранзакцию();
	
	Попытка
		
		Если ДанныеОбъектаКОбработке.УстановленноеСоответствие <> Неопределено Тогда
		
			РезультатОтражения = РезультатОтраженияРучногоСопоставления(ДанныеОбъектаКОбработке.ПолученныйОбъект,
			                                                            ДанныеОбъектаКОбработке.ПравилоКонвертации,
			                                                            ДанныеОбъектаКОбработке.ОбъектФормата,
			                                                            ДанныеОбъектаКОбработке.УзелПланаОбмена,
			                                                            ДанныеОбъектаКОбработке.УстановленноеСоответствие);
			
			Если Не РезультатОтражения.Успешно Тогда
				
				РезультатУстановки.Успешно     = Ложь;
				РезультатУстановки.ТекстОшибки = РезультатОтражения.ТекстОшибки;
				
				ОтменитьТранзакцию();
				
				Возврат РезультатУстановки;
				
			Иначе
				РезультатУстановки.ИдентификаторФоновогоЗадания = РезультатОтражения.ИдентификаторФоновогоЗадания;
				РезультатУстановки.УстановленоСоответствие      = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеЗаписи  = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеУспешнойОбработкиОбъекта();
		ДанныеЗаписи.ПолученныйОбъект                       = ДанныеОбъектаКОбработке.ПолученныйОбъект;
		ДанныеЗаписи.ПравилоКонвертации                     = ДанныеОбъектаКОбработке.ПравилоКонвертации;
		ДанныеЗаписи.ОбъектФормата                          = ДанныеОбъектаКОбработке.ОбъектФормата;
		ДанныеЗаписи.УзелПланаОбмена                        = ДанныеОбъектаКОбработке.УзелПланаОбмена;
		ДанныеЗаписи.ДатаОбрабатываемойВерсии               = ДанныеОбъектаКОбработке.ДатаОбрабатываемойВерсии;
		
		РегистрыСведений.ОбъектыКЗагрузке.ОтразитьУспешнуюОбработкуОбъекта(ДанныеОбъектаКОбработке);
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		
		ОтменитьТранзакцию();
		
		РезультатУстановки.Успешно = Ложь;
		ТекстШаблона = НСтр("ru = 'Не удалось отклонить загрузку объекта по причине ""%1""'");
		РезультатУстановки.ТекстОшибки = СтрШаблон(ТекстШаблона, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	Возврат РезультатУстановки;
	
КонецФункции

#КонецОбласти

#Область ЗапросыПоНаборамЗаписей

// Формирует условие запроса по отбору набора записей.
// 
// Параметры:
//  Запрос - Запрос - запрос, в него будут установлены параметры
//  Отбор  - Отбор - отбор набора записей
// 
// Возвращаемое значение:
//  Строка - Условие запроса по отбору набора записей
Функция УсловиеЗапросаПоОтборуНабораЗаписей(Запрос, Отбор) Экспорт
	
	УсловияОтбора = Новый Массив;
	
	Для Инд = 1 По Отбор.Количество() Цикл 
		
		ЭлементОтбора = Отбор.Получить(Инд - 1);
		
		Если ЗначениеЗаполнено(ЭлементОтбора.Значение) Тогда
			УсловияОтбора.Добавить(СтрШаблон("ТаблицаРегистра.%1 = &%1", ЭлементОтбора.Имя));
			Запрос.УстановитьПараметр(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Если УсловияОтбора.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат СтрСоединить(УсловияОтбора, " И ");
	
КонецФункции

// Формирует таблицу по переданным полям и отбору набора записей.
// 
// Параметры:
//  Отбор        - Отбор - отбор набора записей
//  ИмяРегистра  - Строка - имя регистра, для которого выполняется операция
//  ИменаПолей   - Массив Из Строка - имена полей, которые нужно вывести в таблицу
// 
// Возвращаемое значение:
//  Неопределено, ТаблицаЗначений - Условие запроса по отбору набора записей
//
Функция ТаблицаЗаписейПоОтборуНабораЗаписей(Отбор, ИмяРегистра, ИменаПолей) Экспорт
	
	Запрос = Новый Запрос;
	
	ТекстУсловия = УсловиеЗапросаПоОтборуНабораЗаписей(Запрос, Отбор);
	
	Если ПустаяСтрока(ТекстУсловия) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокиПолейЗапроса = Новый Массив;
	МассивПолей = СтрРазделить(ИменаПолей, ",");
	Для Каждого ИмяПоля Из МассивПолей Цикл
		СтрокиПолейЗапроса.Добавить(СтрШаблон("ТаблицаРегистра.%1 КАК %1", СокрЛП(ИмяПоля)));
	КонецЦикла;
	
	Если СтрокиПолейЗапроса.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстПоляЗапроса = СтрСоединить(СтрокиПолейЗапроса, ", " + Символы.ПС);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&ПоляЗапроса
	|ИЗ
	|	&ИмяТаблицы КАК ТаблицаРегистра
	|ГДЕ
	|	&УсловиеОтбора";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", "РегистрСведений." + ИмяРегистра);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляЗапроса", ТекстПоляЗапроса);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", ТекстУсловия);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область ПослеРучнойУстановкиСоответствия

#Область ПреобразованиеТекстаВФорматированныйДокумент

// Формирует форматированный документ из текста со ссылками.
// 
// Параметры:
//  ПреобразуемыйТекст - строка
// 
// Возвращаемое значение:
//  ФорматированныйДокумент - сформированный форматированный документ
//
Функция ФорматированныйДокументИзТекстаСоСсылками(ПреобразуемыйТекст) Экспорт
	
	ФормируемаяСтрока = "";
	
	СтрокиТекста = СтрРазделить(ПреобразуемыйТекст, Символы.ПС);
	
	Для Каждого СтрокаТекста Из СтрокиТекста Цикл
		
		СимволСоединения = ?(ПустаяСтрока(ФормируемаяСтрока), "", Символы.ПС);
		
		Если РаботаСРезультатамиОбменаКлиентСервер.ЕстьГиперссылкиВТексте(СтрокаТекста) Тогда
			
			ФормируемаяСтрока = Новый ФорматированнаяСтрока(ФормируемаяСтрока, СимволСоединения,  СтрокаСПреобразованнымиНайденнымиСсылками(СтрокаТекста));
			
		Иначе
			
			ФормируемаяСтрока = Новый ФорматированнаяСтрока(ФормируемаяСтрока, СимволСоединения, СтрокаТекста);
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	СформированныйДокумент = Новый ФорматированныйДокумент;
	СформированныйДокумент.УстановитьФорматированнуюСтроку(ФормируемаяСтрока);
	
	Возврат СформированныйДокумент;

КонецФункции

#КонецОбласти

#Область ПослеУстановкиСоответствий

// Стартует фоновое задание после ручной установки соответствия объекту.
// 
// Параметры:
//  УникальныйИдентификатор       - УникальныйИдентификатор        - идентификатор фонового задания
//  КлючФоновогоЗадания           - Строка                         - уникальный ключ для активных фоновых заданий,
//                                                                   имеющих такое же имя процедуры
//  ПолученныйОбъект              - Строка                         - идентификатор полученного объекта.
//  УзелИнформационнойБазы        - ПланОбменаСсылкаИмяПланаОбмена - узел приложения корреспондента
// 
// Возвращаемое значение:
//   см. ДлительныеОперации.ВыполнитьВФоне
// 
Функция ДлительнаяОперацияПослеУстановкиСоответствия(УникальныйИдентификатор, КлючФоновогоЗадания, ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы) Экспорт
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("СопоставленныйОбъект",   ПолученныйОбъект);
	ПараметрыПроцедуры.Вставить("ОбъектФормата",          ОбъектФормата);
	ПараметрыПроцедуры.Вставить("УзелИнформационнойБазы", УзелИнформационнойБазы);
	ПараметрыПроцедуры.Вставить("КлючФоновогоЗадания",    КлючФоновогоЗадания);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.КлючФоновогоЗадания = КлючФоновогоЗадания;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверка возможности загрузки объектов после установки соответствия'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("РаботаСРезультатамиОбмена.ПроверитьВозможностьЗагрузкиДругихОбъектовПослеУстановкиСоответствия",
	                                                       ПараметрыПроцедуры, ПараметрыВыполнения);
	Возврат ДлительнаяОперация;
	
КонецФункции

// Обрабатывает фоновое задание по проверке возможности загрузки других объектов после установки соответствий.
// 
// Параметры:
//  ПараметрыПроверки - Структура - содержит:
//    * УзелИнформационнойБазы        - ПланОбменаСсылкаИмяПланаОбмена - узел приложения корреспондента
//    * КлючФоновогоЗадания           - Строка - уникальный ключ для активных фоновых заданий, имеющих такое же имя процедуры
//    * СопоставленныйОбъект          - Строка - идентификатор полученного объекта, которому установлено соответствие. 
//  АдресХранилища     - Строка - адрес временного хранилища, в который будет помещен результат обработки
//
Процедура ПроверитьВозможностьЗагрузкиДругихОбъектовПослеУстановкиСоответствия(ПараметрыПроверки, АдресХранилища) Экспорт
	
	РезультатПроверки = РезультатОбработкиОбъектовПослеУстановкиСоответствия(
		ПараметрыПроверки.СопоставленныйОбъект,
		ПараметрыПроверки.ОбъектФормата,
		ПараметрыПроверки.УзелИнформационнойБазы,
		ПараметрыПроверки.КлючФоновогоЗадания); 
		
	Если РезультатПроверки.Успешно
		И РезультатПроверки.ИзмененныеЗаписи.Количество() > 0 Тогда
		
		РезультатПроверки.ОповещатьОбИзменении = Истина;
		
		ПараметрыПередачи = НовыйПараметрыПередачиОбъектовНаЗагрузку();
		
		ПараметрыПередачи.НеПроверятьОсвободившиесяОбъектыПриЗаписиВПИСО = Истина;
		
		РезультатЗагрузки = РезультатОбработкиПереданныхНаЗагрузкуОбъектов(
			ПараметрыПроверки.УзелИнформационнойБазы, ПараметрыПроверки.КлючФоновогоЗадания, ПараметрыПередачи);
			
			Если РезультатЗагрузки.Успешно Тогда
				
				РезультатПроверки.НовыеПричины = РезультатЗагрузки.НовыеПричины;
				
			КонецЕсли;
			
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатПроверки, АдресХранилища);
	
КонецПроцедуры

// Возвращает новый уникальный идентификатор в виде строки
// 
// Возвращаемое значение:
//  Строка - 
Функция НовыйИдентификаторФоновогоЗадания() Экспорт
	
	Возврат УникальныйИдентификаторСтрокой(Новый УникальныйИдентификатор());
	
КонецФункции

// Получает идентификатор фонового задания, которое было запущено из регламентного задания и выполняется в текущем
// сеансе ИБ
// 
// Возвращаемое значение:
//  Строка - 
Функция ИдентификаторТекущегоФоновогоЗаданияСтрокой() Экспорт
	
	ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();
	
	Если ФоновоеЗадание = Неопределено Тогда
		Возврат "";
	Иначе
		Возврат УникальныйИдентификаторСтрокой(ФоновоеЗадание.УникальныйИдентификатор);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ПроверкаИОчисткаНекорректныхЗаписей

// Обработчик регламентного задания по выявлению и исправлению некорректных записей в РС пообъектного обмена.
Процедура ПроверитьКорректностьЗаписейВРегистрахПообъектногоОбмена() Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ПроверкаКорректностиЗаписейПообъектногоОбмена);
	
	Если НЕ КонвертацияОбъектноСлужебныйПовтИсп.ЕстьУзлыИспользующиеПообъектныйОбмен() Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.ОбъектыКЗагрузке.ПроверитьНаличиеЗаписейБезАктуальныхПКО();
	
	РегистрыСведений.ОбъектыБлокирующиеЗагрузку.ПроверитьЗаписиБезСоответствийВОбъектыКЗагрузке();
	
	РегистрыСведений.ДействияПриПолученииДанныхОбмена.АктуализироватьСтратегииПоискаПоКлючам();

КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанныхПообъектногоОбменаБезОбрабатывающихЗаданий

// Обработчик регламентного задания, который выявляет записи, которые помечены фоновыми заданиями для обработки, но эти
// фоновые задания отсутствуют.
//
Процедура ЗагрузитьДанныеДанныеБезОбрабатывающихЗаданий() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ПроверкаКорректностиЗаписейПообъектногоОбмена);
	
	Если НЕ КонвертацияОбъектноСлужебныйПовтИсп.ЕстьУзлыИспользующиеПообъектныйОбмен() Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.ОбъектыКЗагрузке.ПеревестиБолееНеБлокируемыеОбъектыВСтатусГотовКЗагрузке();
	
	РегистрыСведений.ОбъектыБлокирующиеЗагрузку.ПроверитьЗаписиНаПредметНаличияСоответствияПИСО();
	
	ИдентификаторыОтсутствующихОбрабатывающихЗаданий = ИдентификаторыОтсутствующихОбрабатывающихЗаданий();
	
	СчетчикИтераций = 0;
	
	Пока СчетчикИтераций <> 1000 Цикл
		
		// @skip-check query-in-loop - порционная обработка данных
		ВыборкаУзлыПланаОбмена = ДанныеДляЗагрузкиПоОтсутствующимЗаданиям(ИдентификаторыОтсутствующихОбрабатывающихЗаданий);
		
		Если ВыборкаУзлыПланаОбмена.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Пока ВыборкаУзлыПланаОбмена.Следующий() Цикл
			
			ВыборкаДанныеЗагрузки = ВыборкаУзлыПланаОбмена.Выбрать();
			
			КомпонентыОбмена = КонвертацияОбъектноСлужебныйПовтИсп.КомпонентыОбменаДляИнтерактивнойРаботы(ВыборкаУзлыПланаОбмена.УзелПланаОбмена, "Получение");
			
			ПараметрыЗагрузки = НовыйПараметрыПередачиОбъектовНаЗагрузку();
			
			КонвертацияОбъектноСервер.КонвертироватьЗачитанныеДанныеСОтчетом(КомпонентыОбмена, ВыборкаДанныеЗагрузки, ПараметрыЗагрузки);
			
		КонецЦикла;
		
		СчетчикИтераций = СчетчикИтераций + 1;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область БлокируемыеОбъекты

// Преобразовывает строки таблицы значений для вывода в отчет "Блокируемые объекты".
// 
// Параметры:
//  ТаблицаПриемник - ТаблицаЗначений - формируемая таблица
//  ТаблицаИсточник - ТаблицаЗначений - таблица источник
Процедура ДобавитьСтрокиБлокируемыеОбъекты(ТаблицаПриемник, ТаблицаИсточник) Экспорт
	
	Если ТаблицаИсточник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ТаблицаИсточник Цикл
		
		НоваяСтрока = ТаблицаПриемник.Добавить();
		НоваяСтрока.ДатаВозникновения    = СтрокаТаблицы.ДатаВозникновения;
		НоваяСтрока.ОбъектМетаданных     = СтрокаТаблицы.ОбъектМетаданных;
		НоваяСтрока.ПравилоКонвертации   = СтрокаТаблицы.ПравилоКонвертации;
		НоваяСтрока.ПолученныйОбъект     = СтрокаТаблицы.ПолученныйОбъект;
		НоваяСтрока.ОбъектФормата        = СтрокаТаблицы.ОбъектФормата;
		НоваяСтрока.СоответствиеВИБ      = СтрокаТаблицы.СоответствиеВИБ;
		НоваяСтрока.Представление        = ПредставлениеИзДанныхСконвертированногоОбъекта(СтрокаТаблицы.ДанныеСконвертированногоОбъекта);
		НоваяСтрока.ИндексКартинки       = РаботаСРезультатамиОбменаКлиентСервер.ИндексКартинкиПоПорядку(СтрокаТаблицы.ПорядокКоллекции);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаОтображаемыеРеквизиты

// Удаляет сохраненную настройку форму.
// 
// Параметры:
//  Настройки -  Структура Из Произвольный - сохраненные настройки формы
//  ИмяНастройки - Строка - имя настройки, которую требуется удалить
//
Процедура УдалитьСохраняемуюНастройкуФорму(Настройки, ИмяНастройки) Экспорт
	
	Если Настройки.Получить(ИмяНастройки) <> Неопределено Тогда
		Настройки.Удалить(ИмяНастройки);
	КонецЕсли;
	
КонецПроцедуры 

// Вызывается при сохранении данных отображаемых реквизитов в настройках формы.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой выполняется действие
//  Настройки - Структура Из Произвольный - сохраняемые настройки формы
Процедура ПриСохраненииДанныхОтображаемыхРеквизитовВНастройках(Форма, Настройки) Экспорт
	
	УдалитьСохраняемуюНастройкуФорму(Настройки, "ОтображаемыеРеквизиты");
	
	НастройкиВсехОбъектов = СохраненныеНастройкиОтображаемыеРеквизитыФормыПроблемы();
	
	Если НастройкиВсехОбъектов = Неопределено Тогда
		
		НастройкиВсехОбъектов = Новый Соответствие;
		
	КонецЕсли;
	
	НастройкиОбъектаМетаданных = НастройкиВсехОбъектов.Получить(Форма.ИдентификаторОбъектаМетаданных);
	
	Если НастройкиОбъектаМетаданных = Неопределено Тогда
		
		НастройкиОбъектаМетаданных = Новый Соответствие;
		
	КонецЕсли;
	
	НастройкиВсехОбъектов.Вставить(Форма.ИдентификаторОбъектаМетаданных, 
	                               ДанныеОтображаемыхРеквизитовДляСохранения(Форма.ОтображаемыеРеквизиты));
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"ПообъектныйОбмен", 
		"ОтображаемыеРеквизитыФормыПроблемы", 
		НастройкиВсехОбъектов);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеСохраняемыеНастройки

// Вызывается при сохранении признака "Только отличия" в настройках формы.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой выполняется действие
//  Настройки - Структура Из Произвольный - сохраняемые настройки формы
Процедура ПриСохраненииПризнакаТолькоОтличияВФормеПроблемы(Форма, Настройки) Экспорт
	
	УдалитьСохраняемуюНастройкуФорму(Настройки, "ТолькоОтличия");
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"ПообъектныйОбмен", 
		"ТолькоОтличияОтчетСравнениеОбъектов", 
		Форма.ТолькоОтличия);
	
КонецПроцедуры

// Вызывается при сохранении признака "Отображать легенду" в настройках формы.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой выполняется действие
//  Настройки - Структура Из Произвольный - сохраняемые настройки формы
//
Процедура ПриСохраненииПризнакаОтображатьЛегендуВФормеПроблемы(Форма, Настройки) Экспорт
	
	УдалитьСохраняемуюНастройкуФорму(Настройки, "ОтображатьЛегенду");
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"ПообъектныйОбмен", 
		"ОтображатьЛегендуОтчетТребуетсяПолучение", 
		Форма.ОтображатьЛегенду);
	
КонецПроцедуры

// Получает сохраненную настройку "Только отличия" для формы проблемы.
// 
// Возвращаемое значение:
//  Булево, Неопределено - 
Функция СохраненнаяНастройкаТолькоОтличияФормыПроблемы() Экспорт
	
	Возврат ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПообъектныйОбмен", "ТолькоОтличияОтчетСравнениеОбъектов", Ложь);
	
КонецФункции

// Получает сохраненную настройку "Отображать легенду" для формы проблемы.
// 
// Возвращаемое значение:
//  Булево, Неопределено - 
Функция СохраненнаяНастройкаОтображатьЛегендуФормаПроблемы() Экспорт
	
	Возврат ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПообъектныйОбмен", "ОтображатьЛегендуОтчетТребуетсяПолучение", Ложь);
	
КонецФункции

#КонецОбласти

#Область ИнициализацияФормыПроблемы

// Инициализирует данные формы проблемы.
// 
// Параметры:
//  Форма                 - ФормаКлиентскогоПриложения - форма, для которой выполняется операция
//  ИмяМакетаРекомендации - Строка                     - имя макета с рекомендациями
//
Процедура ИнициализироватьДанныеФормыПроблемы(Форма, ИмяМакетаРекомендации) Экспорт
	
	Форма.ЦветГиперссылки     = ЦветаСтиля.ГиперссылкаЦвет;
	Форма.КартинкаКомментарий = БиблиотекаКартинок.НаличиеКомментария;
	
	Если Не ПустаяСтрока(ИмяМакетаРекомендации) Тогда
		Форма.РекомендацииПоРаботе = Обработки.РаботаСРезультатамиОбмена.ПолучитьМакет(ИмяМакетаРекомендации).ПолучитьТекст();
	КонецЕсли;
	
	Форма.ПоказыватьПредупреждениеПриПовторномОткрытииФормыПроблемы =
		ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработка.РаботаСРезультатамиОбмена", "НеобходимостьПредупрежденияПриПовторномОткрытииФормыПроблемы", Истина)
		И Форма.Параметры.ЭтоПовторноеОткрытиеФормыПроблемы;
	
КонецПроцедуры

// Заполнить реквизиты формы проблемы по переданным в нее параметрам.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, для которой выполняется операция
//
Процедура ЗаполнитьРеквизитыФормыПроблемыПоПараметрам(Форма) Экспорт
	
	Форма.ПравилоКонвертации      = Форма.Параметры.ДанныеЗаписиОбъектКЗагрузке.ПравилоКонвертации;
	Форма.ПолученныйОбъект        = Форма.Параметры.ДанныеЗаписиОбъектКЗагрузке.ПолученныйОбъект;
	Форма.ОбъектФормата           = Форма.Параметры.ДанныеЗаписиОбъектКЗагрузке.ОбъектФормата;
	Форма.УзелИнформационнойБазы  = Форма.Параметры.ДанныеЗаписиОбъектКЗагрузке.УзелПланаОбмена;
	
	ДанныеЗаписиОбъектКЗагрузке = Новый Структура;
	ДанныеЗаписиОбъектКЗагрузке.Вставить("УзелПланаОбмена",    Форма.УзелИнформационнойБазы);
	ДанныеЗаписиОбъектКЗагрузке.Вставить("ПравилоКонвертации", Форма.ПравилоКонвертации);
	ДанныеЗаписиОбъектКЗагрузке.Вставить("ПолученныйОбъект",   Форма.ПолученныйОбъект);
	ДанныеЗаписиОбъектКЗагрузке.Вставить("ОбъектФормата",      Форма.ОбъектФормата);
	
	ДанныеНавигационнойСсылки = Новый Структура;
	
	ДанныеНавигационнойСсылки.Вставить("ИмяФормы",                    "ФормаПроблемы");
	ДанныеНавигационнойСсылки.Вставить("ДанныеЗаписиОбъектКЗагрузке", ДанныеЗаписиОбъектКЗагрузке);
	
	Форма.НавигационнаяСсылкаФормы = ПолучитьНавигационнуюСсылку(
		Метаданные.Обработки.РаботаСРезультатамиОбмена, Форма.Заголовок, ДанныеНавигационнойСсылки);
	
КонецПроцедуры

// Формирует заголовок формы проблемы при одной из ошибок при записи.
// 
// Параметры:
//  ПричинаДобавления - ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке
// 
// Возвращаемое значение:
//  Строка - Заголовок формы проблемы ошибки при записи
Функция ЗаголовокФормыПроблемыОшибкиПриЗаписи(ПричинаДобавления) Экспорт
	
	Если ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи Тогда
		
		Возврат НСтр("ru = 'Ошибка записи (без проверки заполнения)'");
		
	ИначеЕсли ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи Тогда 
		
		Возврат НСтр("ru = 'Ошибка записи (с проверкой заполнения)'");
		
	ИначеЕсли ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроведения Тогда
		
		Возврат НСтр("ru = 'Ошибка проведения'");
		
	КонецЕсли;
	
КонецФункции

// Получает имя макета рекомендаций для форм проблемы одного из вида ошибок при записи.
// 
// Параметры:
//  ПричинаДобавления - ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке - 
//  СтатусОбновленияОбъектаВИБ - ПеречислениеСсылка.СтатусыОбновленияОбъектаПриПроблемахЗаписи -
// 
// Возвращаемое значение:
//  Строка - Имя макета рекомендации форма проблемы ошибка при записи
//
Функция ИмяМакетаРекомендацииФормаПроблемыОшибкаПриЗаписи(ПричинаДобавления, СтатусОбновленияОбъектаВИБ) Экспорт
	
	Если ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроведения Тогда
		
		Если СтатусОбновленияОбъектаВИБ = ПредопределенноеЗначение("Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженСозданНовый") Тогда
			
			Возврат "РекомендацииПроблемаОшибкаПроведенияСоздан";
			
		ИначеЕсли СтатусОбновленияОбъектаВИБ = ПредопределенноеЗначение("Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженОбновлен") Тогда
			
			Возврат "РекомендацииПроблемаОшибкаПроведенияОбновлен";
			
		Иначе
			
			Возврат "РекомендацииОшибкаПроведенияНеОбновлен";
			
		КонецЕсли;
		
	ИначеЕсли СтатусОбновленияОбъектаВИБ = ПредопределенноеЗначение("Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеСоздан") Тогда
		
		Возврат "РекомендацииПроблемОшибкаЗаписиНеЗагруженНеСоздан";
		
	ИначеЕсли СтатусОбновленияОбъектаВИБ = ПредопределенноеЗначение("Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеОбновлен") Тогда
		
		Возврат "РекомендацииОшибкаПриЗаписиНеЗагруженНеОбновлен";
		
	ИначеЕсли СтатусОбновленияОбъектаВИБ = ПредопределенноеЗначение("Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженСозданНовый") Тогда
		
		Возврат "РекомендацииПроблемаОшибкаЗаписиСоздан";
		
	КонецЕсли;
	
КонецФункции

// Заполняет данные объекта метаданных в форме проблемы.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой выполняется операция
//  ОбъектМетаданных - СправочникСсылка.ИдентификаторыОбъектовМетаданных - объект метаданных, для которого заполняются данные
//  ЗаполнятьВыборРеквизитов - Булево - признак необходимости заполнить выбор отображаемых реквизитов для отчетов формы.
//  ЗаполнятьВопросПриЗаписи - Булево - признак необходимости заполнить вопрос при записи объекта с ошибкой.
//
Процедура ЗаполнитьДанныеОбъектаМетаданныхВФормеПроблемы(Форма, ОбъектМетаданных, ЗаполнятьВыборРеквизитов, ЗаполнятьВопросПриЗаписи = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектМетаданных) Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеОбъекта                = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ОбъектМетаданных);
	Форма.ПолноеИмяОбъектаМетаданных = МетаданныеОбъекта.ПолноеИмя(); 
	
	Форма.УстановкаСоответствияНевозможна = ОбщегоНазначения.ЭтоРегистрСведений(МетаданныеОбъекта);
	
	Если ЗаполнятьВыборРеквизитов Тогда
		ЗаполнитьВыборРеквизитовОбъектаМетаданных(Форма, МетаданныеОбъекта);
	КонецЕсли;
	
	Если ЗаполнятьВопросПриЗаписи Тогда
		Форма.ТекстВопросаПриЗаписи = ТекстВопросаПриЗаписиСОшибкой(МетаданныеОбъекта, Форма.ПричинаДобавления)
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИспользованиеРегламентныхЗаданийПообъектногоОбмена

// Проверяет потребность и устанавливает признак использования регламентных заданий пообъектного обмена.
// 
Процедура ПроверитьНеобходимостьИспользованияЗаданийПообъектногоОбмена() Экспорт
	
	ПообъектныйОбменИспользуется = РегистрыСведений.ОбщиеНастройкиУзловИнформационныхБаз.ЕстьУзлыИспользующиеПообъектныйОбмен();
	
	ИспользоватьРегламентноеЗаданиеЕстьНеобходимо(Метаданные.РегламентныеЗадания.ЗагрузкаДанныхПообъектногоОбменаБезОбрабатывающихЗаданий.Имя, ПообъектныйОбменИспользуется);
	ИспользоватьРегламентноеЗаданиеЕстьНеобходимо(Метаданные.РегламентныеЗадания.ПроверкаКорректностиЗаписейПообъектногоОбмена.Имя, ПообъектныйОбменИспользуется);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПреобразованиеТекстаВФорматированныйДокумент

Функция СтрокаСПреобразованнымиНайденнымиСсылками(СтрокаТекста)

	НачальнаяПозиция = 1;
	ПреобразованнаяСтрока = "";
	
	Пока НачальнаяПозиция < СтрДлина(СтрокаТекста) Цикл
		
		СсылкаНайдена = Ложь;
		
		Для Каждого АнализируемыйПрефикс Из РаботаСРезультатамиОбменаКлиентСервер.АнализируемыеПрефиксыСсылок() Цикл
			
			НайденнаяПозиция = НайденнаяПозицияВСтрокеПослеУказаннойПозиции(СтрокаТекста, АнализируемыйПрефикс, НачальнаяПозиция);
			
			Если НайденнаяПозиция > 0 Тогда
				
				СсылкаНайдена        = Истина;
				ОбрабатываемаяСтрока = Сред(СтрокаТекста, НайденнаяПозиция);
				СтрокаСсылки         = "";
				НайденоОкончание     = Ложь;
				СчетчикПозиций       = 1;
				СимволыОкончания     = СимволыОкончания();
				
				Пока Не НайденоОкончание Цикл
					
					ТекущийСимвол = Сред(ОбрабатываемаяСтрока, СчетчикПозиций, 1);
					
					Если Не ПустаяСтрока(ТекущийСимвол) 
						И СимволыОкончания.Найти(ТекущийСимвол) = Неопределено Тогда
						
						СтрокаСсылки = СтрокаСсылки + ТекущийСимвол;
						
						СчетчикПозиций = СчетчикПозиций + 1;
						
					Иначе
						
						НайденоОкончание = Истина;
						
					КонецЕсли;
					
				КонецЦикла;
				
				ТекстДоСсылки = Сред(СтрокаТекста, НачальнаяПозиция, НайденнаяПозиция - НачальнаяПозиция);
				СтрокаСсылки  = СтроковыеФункции.ФорматированнаяСтрока("<a href = ""%1""><span style=""color: ЗаблокированныйРеквизитЦвет"">%2</span></a>", СтрокаСсылки, СтрокаСсылки);
				
				ПреобразованнаяСтрока =  Новый ФорматированнаяСтрока(ПреобразованнаяСтрока, ТекстДоСсылки, СтрокаСсылки);
				
				НачальнаяПозиция = НайденнаяПозиция + СчетчикПозиций - 1;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не СсылкаНайдена Тогда
			ПреобразованнаяСтрока = Новый ФорматированнаяСтрока(ПреобразованнаяСтрока, Сред(СтрокаТекста, НачальнаяПозиция));
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ПреобразованнаяСтрока;
	
КонецФункции

Функция СимволыОкончания()
	
	СимволыОкончания = Новый Массив;
	
	СимволыОкончания.Добавить(" ");
	СимволыОкончания.Добавить("""");
	СимволыОкончания.Добавить(Символы.ПС);
	
	Возврат СимволыОкончания;
	
КонецФункции

Функция НайденнаяПозицияВСтрокеПослеУказаннойПозиции(Строка, Подстрока, НачальнаяПозиция = 0)
	
	Если СтрДлина(Строка) <= НачальнаяПозиция Тогда
		Возврат 0;
	КонецЕсли;
	
	Позиция = СтрНайти(Строка, Подстрока, НаправлениеПоиска.СНачала, НачальнаяПозиция + 1);
	Возврат Позиция;
	
КонецФункции 

#КонецОбласти

#Область ЗагрузкаДанныхПообъектногоОбменаБезОбрабатывающихЗаданий

Функция ДанныеДляЗагрузкиПоОтсутствующимЗаданиям(ИдентификаторыОтсутствующихОбрабатывающихЗаданий)
	
	ИдентификаторыОтсутствующихОбрабатывающихЗаданий.Добавить("");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 100
	|	ВложенныйЗапрос.ПолученныйОбъект           КАК ПолученныйОбъект,
	|	ВложенныйЗапрос.Приоритет                  КАК Приоритет,
	|	ВложенныйЗапрос.ДатаОбъектаВИсточнике      КАК ДатаОбъектаВИсточнике,
	|	ВложенныйЗапрос.УзелПланаОбмена            КАК УзелПланаОбмена,
	|	ВложенныйЗапрос.ДатаДобавления             КАК ДатаДобавления,
	|	ВложенныйЗапрос.ДатаОбрабатываемойВерсии   КАК ДатаОбрабатываемойВерсии,
	|	ВложенныйЗапрос.ПространствоИменURI        КАК ПространствоИменURI,
	|	ВложенныйЗапрос.ОбъектФормата              КАК ОбъектФормата,
	|	ВложенныйЗапрос.ПричинаДобавления          КАК ПричинаДобавления,
	|	ВложенныйЗапрос.ПравилоКонвертации         КАК ПравилоКонвертации,
	|	ВложенныйЗапрос.КлючОбрабатывающегоЗадания КАК КлючОбрабатывающегоЗадания
	|ПОМЕСТИТЬ ДанныеДляОбработки
	|ИЗ 
	|(ВЫБРАТЬ
	|	ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект                                                    КАК ПолученныйОбъект,
	|	ПрочитанныеДанныеСообщенийОбмена.Приоритет                                                           КАК Приоритет,
	|	ПрочитанныеДанныеСообщенийОбмена.ДатаОбъектаВИсточнике                                               КАК ДатаОбъектаВИсточнике,
	|	ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена                                                     КАК УзелПланаОбмена,
	|	ПрочитанныеДанныеСообщенийОбмена.ДатаДобавления                                                      КАК ДатаДобавления,
	|	ЕстьNULL(ОбъектыКЗагрузке.ДатаОбрабатываемойВерсии, ПрочитанныеДанныеСообщенийОбмена.ДатаДобавления) КАК ДатаОбрабатываемойВерсии,
	|	ПрочитанныеДанныеСообщенийОбмена.ПространствоИменURI                                                 КАК ПространствоИменURI,
	|	ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата                                                       КАК ОбъектФормата,
	|	НЕОПРЕДЕЛЕНО                                                                                         КАК ПричинаДобавления,
	|	""""                                                                                                 КАК ПравилоКонвертации,
	|	ПрочитанныеДанныеСообщенийОбмена.КлючОбрабатывающегоЗадания                                          КАК КлючОбрабатывающегоЗадания
	|ИЗ
	|	РегистрСведений.ПрочитанныеДанныеСообщенийОбмена КАК ПрочитанныеДанныеСообщенийОбмена
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ПО ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект = ОбъектыКЗагрузке.ПолученныйОбъект
	|		И ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата = ОбъектыКЗагрузке.ОбъектФормата
	|		И ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена = ОбъектыКЗагрузке.УзелПланаОбмена
	|		И ОбъектыКЗагрузке.ПричинаДобавления <> ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетсяПолучениеЭтогоОбъекта)
	|ГДЕ
	|	ПрочитанныеДанныеСообщенийОбмена.Приоритет > -2
	|	И ПрочитанныеДанныеСообщенийОбмена.КлючОбрабатывающегоЗадания В (&ИдентификаторыОтсутствующихОбрабатывающихЗаданий)
	|	И ОбъектыКЗагрузке.ПолученныйОбъект ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект               КАК ПолученныйОбъект,
	|	-1                                                              КАК Приоритет,
	|	ПрочитанныеДанныеСообщенийОбмена.ДатаОбъектаВИсточнике          КАК ДатаОбъектаВИсточнике,
	|	ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена                КАК УзелПланаОбмена,
	|	ПрочитанныеДанныеСообщенийОбмена.ДатаДобавления                 КАК ДатаДобавления,
	|	ОбъектыКЗагрузке.ДатаОбрабатываемойВерсии                       КАК ДатаОбрабатываемойВерсии,
	|	ПрочитанныеДанныеСообщенийОбмена.ПространствоИменURI            КАК ПространствоИменURI,
	|	ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата                  КАК ОбъектФормата,
	|	ОбъектыКЗагрузке.ПричинаДобавления                              КАК ПричинаДобавления,
	|	ОбъектыКЗагрузке.ПравилоКонвертации                             КАК ПравилоКонвертации,
	|	ОбъектыКЗагрузке.КлючОбрабатывающегоЗадания                     КАК КлючОбрабатывающегоЗадания
	|ИЗ
	|	РегистрСведений.ПрочитанныеДанныеСообщенийОбмена КАК ПрочитанныеДанныеСообщенийОбмена
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ПО ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект = ОбъектыКЗагрузке.ПолученныйОбъект
	|			И ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата = ОбъектыКЗагрузке.ОбъектФормата
	|			И ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена = ОбъектыКЗагрузке.УзелПланаОбмена
	|			И ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ГотовоКЗагрузке)
	|			И ОбъектыКЗагрузке.КлючОбрабатывающегоЗадания В (&ИдентификаторыОтсутствующихОбрабатывающихЗаданий)
	|			И ОбъектыКЗагрузке.ДатаУстановкиПричиныДобавления < (&ДатаПроверкиФоновыхЗаданийОбъектыКЗагрузке)
	|ГДЕ
	|	ПрочитанныеДанныеСообщенийОбмена.Приоритет > -2
	|
	|) КАК ВложенныйЗапрос
	|УПОРЯДОЧИТЬ ПО 
	|	ВложенныйЗапрос.Приоритет,
	|	ВложенныйЗапрос.ДатаОбъектаВИсточнике
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляОбработки.ПолученныйОбъект                                      КАК ПолученныйОбъект,
	|	ДанныеДляОбработки.Приоритет                                             КАК Приоритет,
	|	ДанныеДляОбработки.УзелПланаОбмена                                       КАК УзелПланаОбмена,
	|	ДанныеДляОбработки.ДатаДобавления                                        КАК ДатаДобавления,
	|	ДанныеДляОбработки.ДатаОбрабатываемойВерсии                              КАК ДатаОбрабатываемойВерсии,
	|	ДанныеДляОбработки.ПространствоИменURI                                   КАК ПространствоИменURI,
	|	ДанныеДляОбработки.ОбъектФормата                                         КАК ОбъектФормата,
	|	ДанныеДляОбработки.ПричинаДобавления                                     КАК ПричинаДобавления,
	|	ДанныеДляОбработки.ПравилоКонвертации                                    КАК ПравилоКонвертации,
	|	ПрочитанныеДанныеСообщенийОбмена.СодержимоеЗаписи                        КАК СодержимоеЗаписи,
	|	ДанныеДляОбработки.КлючОбрабатывающегоЗадания                            КАК КлючОбрабатывающегоЗадания
	|ИЗ
	|	ДанныеДляОбработки КАК ДанныеДляОбработки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрочитанныеДанныеСообщенийОбмена КАК ПрочитанныеДанныеСообщенийОбмена
	|		ПО ДанныеДляОбработки.ПолученныйОбъект = ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект
	|		И ДанныеДляОбработки.ОбъектФормата = ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата
	|
	|ИТОГИ ПО
	|	УзелПланаОбмена";
	
	Запрос.УстановитьПараметр("ИдентификаторыОтсутствующихОбрабатывающихЗаданий", ИдентификаторыОтсутствующихОбрабатывающихЗаданий);
	Запрос.УстановитьПараметр("ДатаПроверкиФоновыхЗаданийОбъектыКЗагрузке", (ТекущаяДатаСеанса() - 600));
	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции

Функция ИдентификаторыОтсутствующихОбрабатывающихЗаданий()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрочитанныеДанныеСообщенийОбмена.КлючОбрабатывающегоЗадания КАК КлючОбрабатывающегоЗадания
	|ИЗ
	|	РегистрСведений.ПрочитанныеДанныеСообщенийОбмена КАК ПрочитанныеДанныеСообщенийОбмена
	|ГДЕ 
	|	ПрочитанныеДанныеСообщенийОбмена.КлючОбрабатывающегоЗадания <> """"
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////////////////1
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъектыКЗагрузке.КлючОбрабатывающегоЗадания
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|ГДЕ 
	|	ОбъектыКЗагрузке.КлючОбрабатывающегоЗадания <> """"
	|";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ОбработанныеИдентификаторы = Новый Соответствие;
	ИдентификаторыБезЗаданий   = Новый Массив;
	 
	ВыборкаПрочитанныеДанные = РезультатЗапроса[0].Выбрать();
	
	Пока ВыборкаПрочитанныеДанные.Следующий() Цикл
		
		Если ЗаданиеНайденоПоИдентификатору(ВыборкаПрочитанныеДанные.КлючОбрабатывающегоЗадания) Тогда
			
			ОбработанныеИдентификаторы.Вставить(ВыборкаПрочитанныеДанные.КлючОбрабатывающегоЗадания);
			Продолжить;
			
		КонецЕсли;
		
		Если Не ЗаданиеНайденоПоКлючу(ВыборкаПрочитанныеДанные.КлючОбрабатывающегоЗадания) Тогда
			
			ИдентификаторыБезЗаданий.Добавить(ВыборкаПрочитанныеДанные.КлючОбрабатывающегоЗадания);
			
		КонецЕсли;
		
		ОбработанныеИдентификаторы.Вставить(ВыборкаПрочитанныеДанные.КлючОбрабатывающегоЗадания);
		
	КонецЦикла;
	
	ВыборкаОбъектыКЗагрузке = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаОбъектыКЗагрузке.Следующий() Цикл
		
		Если ОбработанныеИдентификаторы.Получить(ВыборкаОбъектыКЗагрузке.КлючОбрабатывающегоЗадания) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗаданиеНайденоПоКлючу(ВыборкаОбъектыКЗагрузке.КлючОбрабатывающегоЗадания) Тогда
			
			ИдентификаторыБезЗаданий.Добавить(ВыборкаОбъектыКЗагрузке.КлючОбрабатывающегоЗадания);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ИдентификаторыБезЗаданий;
	
КонецФункции

Функция ЗаданиеНайденоПоИдентификатору(ИдентификаторЗаданияСтрокой)
	
	Попытка
		УникальныйИдентификаторЗадания = Новый УникальныйИдентификатор(СтрЗаменить(ИдентификаторЗаданияСтрокой, "_", "-"));
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(УникальныйИдентификаторЗадания);
	
	Если ФоновоеЗадание = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ЗаданиеНайденоПоКлючу(Ключ)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ключ",      Ключ);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	
	ТекущиеФоновыеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	
	Возврат ТекущиеФоновыеЗадания.Количество() > 0;
	
КонецФункции

#КонецОбласти

#Область ПослеРучнойУстановкиСоответствия

Функция РезультатОбработкиОбъектовПослеУстановкиСоответствия(СопоставленныйОбъект, ОбъектФормата, УзелИнформационнойБазы, КлючФоновогоЗадания)
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("Успешно",               Истина);
	РезультатОбработки.Вставить("ТекстОшибки",           "");
	РезультатОбработки.Вставить("ИзмененныеЗаписи" ,     Новый Соответствие);
	РезультатОбработки.Вставить("НовыеПричины" ,         Новый Соответствие);
	РезультатОбработки.Вставить("ОповещатьОбИзменении" , Ложь);
	
	ТаблицаИдентификаторов = РегистрыСведений.ОбъектыБлокирующиеЗагрузку.НовыйТаблицаИдентификаторовКПроверке();
	СтрокаТаблицы = ТаблицаИдентификаторов.Добавить();
	СтрокаТаблицы.Идентификатор          = СопоставленныйОбъект;
	СтрокаТаблицы.ОбъектФормата          = ОбъектФормата;
	СтрокаТаблицы.УзелИнформационнойБазы = УзелИнформационнойБазы;
	
	ДанныеЗаписейКУдалению = 
		РегистрыСведений.ОбъектыБлокирующиеЗагрузку.ДанныеЗаписейКУдалениюПослеУстановкиСоответствий(ТаблицаИдентификаторов);
		
	Если ДанныеЗаписейКУдалению.Количество() = 0 Тогда
		Возврат РезультатОбработки;
	КонецЕсли;
	
	ОбъектыКЗагрузкеКПроверке = ДанныеЗаписейКУдалению.Скопировать();
	ОбъектыКЗагрузкеКПроверке.Свернуть("ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата, УзелПланаОбмена");
	
	РегистрыСведений.ОбъектыБлокирующиеЗагрузку.УдалитьЗаписиРегистраПоТаблице(ДанныеЗаписейКУдалению, Истина);
	
	РезультатОбработкиОбъектовКЗагрузке = РезультатОбработкиОбъектовОбъектовКЗагрузкеПослеУдаленияБлокирующих(ОбъектыКЗагрузкеКПроверке, КлючФоновогоЗадания);
	
	Если РезультатОбработкиОбъектовКЗагрузке.Успешно Тогда
		
		ОтразитьИзмененияЗаписейВИтогах(РезультатОбработкиОбъектовКЗагрузке.ИзмененныеЗаписи,
		                                РезультатОбработки.ИзмененныеЗаписи);
		
	Иначе
		
		РезультатОбработки.Успешно     = Ложь;
		РезультатОбработки.ТекстОшибки = РезультатОбработкиОбъектовКЗагрузке.ТекстОшибки;
		
	КонецЕсли;
	
	Возврат РезультатОбработки;
	
КонецФункции

Функция РезультатОбработкиОбъектовОбъектовКЗагрузкеПослеУдаленияБлокирующих(ОбъектыКЗагрузкеКПроверке, КлючФоновогоЗадания)
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("Успешно",           Истина);
	РезультатОбработки.Вставить("ТекстОшибки",       "");
	РезультатОбработки.Вставить("ИзмененныеЗаписи",  Новый Соответствие);
	
	ДанныеДляОбработки = РегистрыСведений.ОбъектыКЗагрузке.ДанныеОбъектовКИзменениюПоТаблицеДляПроверки(ОбъектыКЗагрузкеКПроверке);
	Если ДанныеДляОбработки = Неопределено Тогда
		Возврат РезультатОбработки;
	КонецЕсли;
	
	Для Каждого ДанныеОбъекта Из ДанныеДляОбработки Цикл
		
		ПричинаДобавления = РегистрыСведений.ОбъектыКЗагрузке.ПричинаДобавленияПоДействиямИНаличиюСопоставления(
			ДанныеОбъекта.Загружать,
			ДанныеОбъекта.КакЗагружать,
			ДанныеОбъекта.УстанавливатьСоответствия,
			ДанныеОбъекта.СсылкаНаОбъект);
		
		ДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеИзмененияЗаписиРегистра();
		ДанныеЗаписи.ПолученныйОбъект           = ДанныеОбъекта.ПолученныйОбъект;
		ДанныеЗаписи.ПравилоКонвертации         = ДанныеОбъекта.ПравилоКонвертации;
		ДанныеЗаписи.ОбъектФормата              = ДанныеОбъекта.ОбъектФормата;
		ДанныеЗаписи.УзелПланаОбмена            = ДанныеОбъекта.УзелПланаОбмена;
		ДанныеЗаписи.ПричинаДобавления          = ПричинаДобавления;
		ДанныеЗаписи.ПолноеПредставлениеОшибки  = "";
		ДанныеЗаписи.КраткоеПредставлениеОшибки = "";
		
		Если ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ГотовоКЗагрузке 
			Или ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ЗагрузкаОтклонена Тогда
			
			ДанныеЗаписи.КлючОбрабатывающегоЗадания = КлючФоновогоЗадания;
			
		КонецЕсли;
		
		РегистрыСведений.ОбъектыКЗагрузке.ИзменитьЗаписьРегистра(ДанныеЗаписи);
		
		ОтразитьОтработкуЗаписиВИзменениях(РезультатОбработки.ИзмененныеЗаписи, ПричинаДобавления)
		
	КонецЦикла;
	
	Возврат РезультатОбработки;
	
КонецФункции

Процедура ОтразитьОтработкуЗаписиВИзменениях(ИзмененныеЗаписи, ПричинаДобавления)
	
	ДанныеПоПричине = ИзмененныеЗаписи.Получить(ПричинаДобавления);
	
	Если ДанныеПоПричине = Неопределено Тогда
		ИзмененныеЗаписи.Вставить(ПричинаДобавления, 1);
	Иначе
		ИзмененныеЗаписи.Вставить(ПричинаДобавления, ДанныеПоПричине + 1);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтразитьИзмененияЗаписейВИтогах(ИзмененныеЗаписи, ИтоговыеИзменения)
	
	Для Каждого КлючИЗначение Из ИзмененныеЗаписи Цикл
		
		ДанныеПоПричине = ИтоговыеИзменения.Получить(КлючИЗначение.Ключ);
		
		Если ДанныеПоПричине = Неопределено Тогда
			ИтоговыеИзменения.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение );
		Иначе
			ИтоговыеИзменения.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение + ДанныеПоПричине.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПользовательскиеКомандыПоЗагрузке

Процедура ДополнитьНовыеПричины(ЧтоДополнить, ЧемДополнить)
	
	Для Каждого КлючИЗначение Из ЧемДополнить Цикл
		
		ЗначениеЧтоДополнить = ЧтоДополнить.Получить(КлючИЗначение.Ключ);
		
		Если ЗначениеЧтоДополнить = Неопределено Тогда
			
			ЧтоДополнить.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			
		Иначе
			
			ЧтоДополнить.Вставить(КлючИЗначение.Ключ, ЗначениеЧтоДополнить + КлючИЗначение.Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПреобразованныйРезультатКонвертацииИЗагрузкиДляВыводаПользователю(РезультатКонвертацииИЗагрузки, УзелПланаОбмена)
	
	ПреобразованныйРезультат = НовыйРезультатЗагрузкиДляВыводаПользователю();
	
	Для Каждого СтрокаТаблицы Из РезультатКонвертацииИЗагрузки Цикл
		
		Если КонвертацияОбъектноРезультатыСлужебный.ВозниклаОшибкаКонвертации(СтрокаТаблицы.ИсторияКонвертацииОбъекта) Тогда
			
			ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаКонвертации;
			
			ДанныеСтатусаЗагрузки = Новый Структура;
			ДанныеСтатусаЗагрузки.Вставить("ПолученныйОбъект",   СтрокаТаблицы.ПолученныйОбъект);
			ДанныеСтатусаЗагрузки.Вставить("ПравилоКонвертации", СтрокаТаблицы.ПравилоКонвертации);
			ДанныеСтатусаЗагрузки.Вставить("ОбъектФормата",      СтрокаТаблицы.ОбъектФормата);
			ДанныеСтатусаЗагрузки.Вставить("СтатусЗагрузки",     Неопределено);
			ДанныеСтатусаЗагрузки.Вставить("ПричинаДобавления",  ПричинаДобавления);
			
			ДобавитьНовуюПричинуЗагрузкиВРезультаты(ПреобразованныйРезультат.НовыеПричины,
			                                        ПричинаДобавления);
			
			Продолжить;
		
		КонецЕсли;
		
		Для Каждого КлючИЗначение Из СтрокаТаблицы.ИсторияПримененияПКО Цикл
			
			РезультатПримененияПКО = КлючИЗначение.Значение;
			
			Если РезультатПримененияПКО = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если РезультатПримененияПКО.ЕстьИнформированиеОтказаОтКонвертацииОбъекта Тогда
				
				ПреобразованныйРезультат.Ошибки.Добавить(КонвертацияОбъектноРезультатыСлужебный.ПредставлениеОшибкиПКО(РезультатПримененияПКО));
				ДобавитьНовуюПричинуЗагрузкиВРезультаты(ПреобразованныйРезультат.НовыеПричины,
				                                        "ОтказОтЗагрузкиПослеКонвертации");
				
				Продолжить;
				
			КонецЕсли;
			
			Если РезультатПримененияПКО.ДобавленоНовоеСоответствиеПИСО Тогда
				
				Если ТипЗнч(РезультатПримененияПКО) <> Тип("Структура") Тогда
					Продолжить;
				КонецЕсли;
				
				ДанныеСопоставления = Новый Структура;
				ДанныеСопоставления.Вставить("ПолученныйОбъект", СтрокаТаблицы.ПолученныйОбъект);
				ДанныеСопоставления.Вставить("ОбъектФормата",    СтрокаТаблицы.ОбъектФормата);
				ДанныеСопоставления.Вставить("ОбъектИБ",         РезультатПримененияПКО.ДанныеИБСсылка);
				ДанныеСопоставления.Вставить("УзелПланаОбмена",  УзелПланаОбмена);
				
				ПреобразованныйРезультат.УстановленныеСоответствия.Добавить(ДанныеСопоставления);
				
			КонецЕсли;
			
			ПричинаДобавления = КонвертацияОбъектноРезультатыСлужебный.ПричинаДобавленияОшибкиПКО(РезультатПримененияПКО);
			
			Если ПричинаДобавления = Неопределено Тогда
				ПричинаДобавления = "Загружен";
			КонецЕсли;
			
			СтатусЗагрузки = КонвертацияОбъектноРезультатыСлужебный.СтатусОшибкиПКО(РезультатПримененияПКО);
			
			ДанныеСтатусаЗагрузки = Новый Структура;
			ДанныеСтатусаЗагрузки.Вставить("ПолученныйОбъект",   СтрокаТаблицы.ПолученныйОбъект);
			ДанныеСтатусаЗагрузки.Вставить("ПравилоКонвертации", СтрокаТаблицы.ПравилоКонвертации);
			ДанныеСтатусаЗагрузки.Вставить("ОбъектФормата",      СтрокаТаблицы.ОбъектФормата);
			ДанныеСтатусаЗагрузки.Вставить("УзелПланаОбмена",    УзелПланаОбмена);
			ДанныеСтатусаЗагрузки.Вставить("СтатусЗагрузки",     СтатусЗагрузки);
			ДанныеСтатусаЗагрузки.Вставить("ПричинаДобавления",  ПричинаДобавления);
			
			ПреобразованныйРезультат.СтатусыЗагрузки.Добавить(ДанныеСтатусаЗагрузки);
			
			ДобавитьНовуюПричинуЗагрузкиВРезультаты(ПреобразованныйРезультат.НовыеПричины,
			                                        ПричинаДобавления);
		
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ПреобразованныйРезультат;
	
КонецФункции

Процедура ДобавитьНовуюПричинуЗагрузкиВРезультаты(НовыеПричины, НоваяПричинаДобавления)
	
	КоличествоПоПричине = НовыеПричины.Получить(НоваяПричинаДобавления);
	
	Если КоличествоПоПричине = Неопределено Тогда
		
		НовыеПричины.Вставить(НоваяПричинаДобавления, 1);
		
	Иначе
		
		НовыеПричины.Вставить(НоваяПричинаДобавления, КоличествоПоПричине + 1);
		
	КонецЕсли;
	
КонецПроцедуры

Функция НовыйРезультатЗагрузкиДляВыводаПользователю()
	
	РезультатЗагрузки = Новый Структура;
	РезультатЗагрузки.Вставить("УстановленныеСоответствия", Новый Массив);
	РезультатЗагрузки.Вставить("НовыеПричины",              Новый Соответствие);
	РезультатЗагрузки.Вставить("СтатусыЗагрузки",           Новый Массив);
	РезультатЗагрузки.Вставить("Ошибки",                    Новый Массив);
	
	Возврат РезультатЗагрузки;
	
КонецФункции

Функция УникальныйИдентификаторСтрокой(УникальныйИдентификатор)
	
	Возврат СтрЗаменить(Строка(УникальныйИдентификатор), "-", "_");
	
КонецФункции

#КонецОбласти

#Область ОтражениеУстановленногоСоответствия

Функция РезультатОтраженияРучногоСопоставления(
			ПолученныйОбъект,
			ПравилоКонвертации,
			ОбъектФормата,
			УзелИнформационнойБазы,
			СсылкаНаОбъект,
			ИдентификаторФоновогоЗадания = Неопределено) Экспорт
	
	РезультатОтражения = Новый Структура;
	РезультатОтражения.Вставить("Успешно", Ложь);
	РезультатОтражения.Вставить("ТекстОшибки", "");
	РезультатОтражения.Вставить("ИдентификаторФоновогоЗадания", ?(ИдентификаторФоновогоЗадания = Неопределено,
	                                                              НовыйИдентификаторФоновогоЗадания(),
	                                                              ИдентификаторФоновогоЗадания));
	
	НачатьТранзакцию();
	
	Попытка
		
		ДанныеЗаписиПИСО = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.НовыйДанныеЗаписи();
		
		ДанныеЗаписиПИСО.Идентификатор          = ПолученныйОбъект;
		ДанныеЗаписиПИСО.Ссылка                 = СсылкаНаОбъект;
		ДанныеЗаписиПИСО.УзелИнформационнойБазы = УзелИнформационнойБазы;
		ДанныеЗаписиПИСО.ОбъектФормата          = Строка(ОбъектФормата);
		
		РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ДобавитьЗапись(
			ДанныеЗаписиПИСО,
			Ложь, 
			РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ДополнительныеСвойстваНабораЗаписейНеОпределятьИзменениеБлокируемыеОбъекты());
		
		ДанныеЗаписиОбъектыКЗагрузке = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеИзмененияЗаписиРегистра();
		ДанныеЗаписиОбъектыКЗагрузке.ПолученныйОбъект   = ПолученныйОбъект;
		ДанныеЗаписиОбъектыКЗагрузке.ПравилоКонвертации = ПравилоКонвертации;
		ДанныеЗаписиОбъектыКЗагрузке.ОбъектФормата      = ОбъектФормата;
		ДанныеЗаписиОбъектыКЗагрузке.УзелПланаОбмена    = УзелИнформационнойБазы;
		ДанныеЗаписиОбъектыКЗагрузке.СсылкаНаОбъект     = СсылкаНаОбъект;
		
		РегистрыСведений.ОбъектыКЗагрузке.ИзменитьЗаписьРегистра(ДанныеЗаписиОбъектыКЗагрузке);
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстШаблона = НСтр("ru = 'При установке соответствия объекту %1 для приложения корреспондента %2 произошла ошибка'");
		РезультатОтражения.ТекстОшибки = СтрШаблон(ТекстШаблона, СсылкаНаОбъект, УзелИнформационнойБазы);
		
		Возврат РезультатОтражения;
		
	КонецПопытки;
	
	РезультатОтражения.Успешно = Истина;
	Возврат РезультатОтражения;
	
КонецФункции

#КонецОбласти

#Область ОтображаемыеРеквизиты

Процедура ЗаполнитьВыборРеквизитовОбъектаМетаданных(Форма, МетаданныеОбъекта)
	
	Форма.ОтображаемыеРеквизиты.ПолучитьЭлементы().Очистить();
	
	РезультатДобавленияРеквизитовОбъектаВФорму(Форма.ОтображаемыеРеквизиты, МетаданныеОбъекта, Форма.ИдентификаторОбъектаМетаданных);
	
КонецПроцедуры

Процедура ДобавитьОтображаемыеРеквизитыОбъекта(СтрокаДерева, МетаданныеОбъекта, КоличествоДобавлено, СохраненныеНастройки)

	ПропускаемыеИменаРеквизитов = Новый Массив;
	ПропускаемыеИменаРеквизитов.Добавить("ИмяПредопределенныхДанных");
	ПропускаемыеИменаРеквизитов.Добавить("Предопределенный");
	ПропускаемыеИменаРеквизитов.Добавить("Ссылка");
	
	ДанныеРеквизитов = Новый СписокЗначений;
	
	Для Каждого СтандартныйРеквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
		
		Если ПропускаемыеИменаРеквизитов.Найти(СтандартныйРеквизит.Имя) <> Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ДанныеРеквизитов.Добавить(СтандартныйРеквизит, ПредставлениеРеквизитаОбъектаМетаданных(СтандартныйРеквизит));
		
		КоличествоДобавлено = КоличествоДобавлено + 1;
		
	КонецЦикла;
	
	Для Каждого РеквизитОбъекта Из МетаданныеОбъекта.Реквизиты Цикл
		
		Если ПропускаемыеИменаРеквизитов.Найти(РеквизитОбъекта.Имя) <> Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ДанныеРеквизитов.Добавить(РеквизитОбъекта, ПредставлениеРеквизитаОбъектаМетаданных(РеквизитОбъекта));
		
	КонецЦикла;
	
	ДанныеРеквизитов.СортироватьПоПредставлению();
	
	Для Каждого ЭлементСписка Из ДанныеРеквизитов Цикл
		
		ЭлементСпискаПанельРеквизитов = СтрокаДерева.ПолучитьЭлементы().Добавить();
		ЭлементСпискаПанельРеквизитов.Выбран        = ЗначениеВыбранСУчетомСохраненныхНастроек(СохраненныеНастройки, СтрокаДерева.Имя, ЭлементСписка.Значение.Имя);
		ЭлементСпискаПанельРеквизитов.Представление = ПредставлениеРеквизитаОбъектаМетаданных(ЭлементСписка.Значение);
		ЭлементСпискаПанельРеквизитов.Имя           = ЭлементСписка.Значение.Имя;
		
		КоличествоДобавлено = КоличествоДобавлено + 1;
		
	КонецЦикла; 
	
	РаботаСРезультатамиОбменаКлиентСервер.ОпределитьЗначениеПереключателяДляРодительскойСтроки(СтрокаДерева, "Выбран");
	
КонецПроцедуры

Функция ЗначениеВыбранСУчетомСохраненныхНастроек(СохраненныеНастройки, ИмяРодителя, ИмяРеквизита)
	
	Если СохраненныеНастройки = Неопределено Тогда
		Возврат 1;
	КонецЕсли;
	
	ДанныеРодительскойСроки = СохраненныеНастройки.Получить(ИмяРодителя);
	
	Если ДанныеРодительскойСроки = Неопределено Тогда
		Возврат 1;
	КонецЕсли;
	
	Если ДанныеРодительскойСроки.Получить(ИмяРеквизита) <> Неопределено Тогда
		Возврат 1;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьОтображаемыеТабличныеЧастиОбъекта(ДеревоРеквизитов, МетаданныеОбъекта, КоличествоДобавлено, СохраненныеНастройки)
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(МетаданныеОбъекта, "ТабличныеЧасти") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеТабличныхЧастей = Новый СписокЗначений;
	
	Для Каждого МетаданныеТабличнойЧасти Из МетаданныеОбъекта.ТабличныеЧасти Цикл
		
		ДанныеТабличныхЧастей.Добавить(МетаданныеТабличнойЧасти, ПредставлениеРеквизитаОбъектаМетаданных(МетаданныеТабличнойЧасти));
		
	КонецЦикла;
	
	ДанныеТабличныхЧастей.СортироватьПоПредставлению();
	
	Для Каждого ДанныеТабличнойЧасти Из ДанныеТабличныхЧастей Цикл
		
		СтрокаТабличнойЧасти = ДеревоРеквизитов.ПолучитьЭлементы().Добавить();
		
		СтрокаТабличнойЧасти.Выбран        = 1;
		СтрокаТабличнойЧасти.Представление = ПредставлениеРеквизитаОбъектаМетаданных(ДанныеТабличнойЧасти.Значение);
		СтрокаТабличнойЧасти.Имя           = ДанныеТабличнойЧасти.Значение.Имя;
		
		КоличествоДобавлено = КоличествоДобавлено + 1;
		
		ДанныеРеквизитов = Новый СписокЗначений;
		
		Для Каждого РеквизитТабличнойЧасти Из ДанныеТабличнойЧасти.Значение.Реквизиты Цикл
		
			ДанныеРеквизитов.Добавить(РеквизитТабличнойЧасти, ПредставлениеРеквизитаОбъектаМетаданных(РеквизитТабличнойЧасти));
		
		КонецЦикла;
		
		ДанныеРеквизитов.СортироватьПоПредставлению();
		
		Для Каждого ДанныеРеквизитаТабличнойЧасти Из ДанныеРеквизитов Цикл
			
			СтрокаРеквизитТабличнойЧасти = СтрокаТабличнойЧасти.ПолучитьЭлементы().Добавить();
			
			СтрокаРеквизитТабличнойЧасти.Выбран        = ЗначениеВыбранСУчетомСохраненныхНастроек(СохраненныеНастройки, СтрокаТабличнойЧасти.Имя, ДанныеРеквизитаТабличнойЧасти.Значение.Имя);
			СтрокаРеквизитТабличнойЧасти.Представление = ПредставлениеРеквизитаОбъектаМетаданных(ДанныеРеквизитаТабличнойЧасти.Значение);
			СтрокаРеквизитТабличнойЧасти.Имя           = ДанныеРеквизитаТабличнойЧасти.Значение.Имя;
			
			КоличествоДобавлено = КоличествоДобавлено + 1;
			
		КонецЦикла;
		
		РаботаСРезультатамиОбменаКлиентСервер.ОпределитьЗначениеПереключателяДляРодительскойСтроки(СтрокаТабличнойЧасти, "Выбран");
		
	КонецЦикла;
	
КонецПроцедуры

Функция РезультатДобавленияРеквизитовОбъектаВФорму(ДеревоРеквизитов, МетаданныеОбъекта, ИдентификаторОбъектаМетаданных) 
	
	КоличествоДобавлено = 0;
	
	СохраненныеНастройки = СохраненныеНастройкиОтображаемыеРеквизитыФормыПроблемы();
	СохраненныеНастройкиОбъектаМетаданных = Неопределено;
	Если СохраненныеНастройки <> Неопределено Тогда
		СохраненныеНастройкиОбъектаМетаданных = СохраненныеНастройки.Получить(ИдентификаторОбъектаМетаданных);
	КонецЕсли;
	
	Если ОбщегоНазначения.ЭтоСправочник(МетаданныеОбъекта)
		Или ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта)
		Или ОбщегоНазначения.ЭтоПланВидовХарактеристик(МетаданныеОбъекта) Тогда
		
		СтрокаРеквизиты = ДеревоРеквизитов.ПолучитьЭлементы().Добавить();
		СтрокаРеквизиты.Представление  = НСтр("ru = 'Реквизиты шапки'");
		СтрокаРеквизиты.Имя            = "РеквизитыШапки";
		СтрокаРеквизиты.Выбран         = 1;
		
		КоличествоДобавлено = КоличествоДобавлено + 1;
		
		ДобавитьОтображаемыеРеквизитыОбъекта(СтрокаРеквизиты, МетаданныеОбъекта, КоличествоДобавлено, СохраненныеНастройкиОбъектаМетаданных);
		ДобавитьОтображаемыеТабличныеЧастиОбъекта(ДеревоРеквизитов, МетаданныеОбъекта, КоличествоДобавлено, СохраненныеНастройкиОбъектаМетаданных);
		
	ИначеЕсли ОбщегоНазначения.ЭтоРегистрСведений(МетаданныеОбъекта) Тогда
		
		ДобавитьОтображаемыеПоляРегистраСведений(ДеревоРеквизитов, МетаданныеОбъекта, КоличествоДобавлено, СохраненныеНастройкиОбъектаМетаданных)
		
	КонецЕсли;
	
	Возврат КоличествоДобавлено;
	
КонецФункции

Процедура ДобавитьОтображаемыеПоляРегистраСведений(ДеревоРеквизитов, МетаданныеОбъекта, КоличествоДобавлено, СохраненныеНастройкиОбъектаМетаданных)
	
	СтрокаИзмерения = ДеревоРеквизитов.ПолучитьЭлементы().Добавить();
	
	СтрокаИзмерения.Выбран        = 1;
	СтрокаИзмерения.Представление = НСтр("ru = 'Измерения'");
	СтрокаИзмерения.Имя           = "Измерения";
	
	КоличествоДобавлено = КоличествоДобавлено + 1;
	
	ДанныеРеквизитов = Новый СписокЗначений;
	
	Для Каждого СтандартныйРеквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
		
		Если СтандартныйРеквизит.Имя <> "Период"
			И СтандартныйРеквизит.Имя <> "Регистратор" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ДанныеРеквизитов.Добавить(СтандартныйРеквизит, ПредставлениеРеквизитаОбъектаМетаданных(СтандартныйРеквизит));
		
	КонецЦикла;
	
	Для Каждого ИзмерениеРегистра Из МетаданныеОбъекта.Измерения Цикл
		
		ДанныеРеквизитов.Добавить(ИзмерениеРегистра, ПредставлениеРеквизитаОбъектаМетаданных(ИзмерениеРегистра));
		
	КонецЦикла;
	
	ДобавитьРеквизитыОбъектаРодительскийУзел(ДанныеРеквизитов, СтрокаИзмерения, СохраненныеНастройкиОбъектаМетаданных, КоличествоДобавлено);
	
	Если МетаданныеОбъекта.Ресурсы.Количество() > 0 Тогда
		
		СтрокаРесурсы = ДеревоРеквизитов.ПолучитьЭлементы().Добавить();
	
		СтрокаРесурсы.Выбран        = 1;
		СтрокаРесурсы.Представление = НСтр("ru = 'Ресурсы'");
		СтрокаРесурсы.Имя           = "Ресурсы";
		
		КоличествоДобавлено = КоличествоДобавлено + 1;
		
		ДанныеРеквизитов = Новый СписокЗначений;
		
		Для Каждого РесурсРегистра Из МетаданныеОбъекта.Ресурсы Цикл
			
			ДанныеРеквизитов.Добавить(РесурсРегистра, ПредставлениеРеквизитаОбъектаМетаданных(РесурсРегистра));
			
		КонецЦикла;
		
		ДобавитьРеквизитыОбъектаРодительскийУзел(ДанныеРеквизитов, СтрокаРесурсы, СохраненныеНастройкиОбъектаМетаданных, КоличествоДобавлено);
		
	КонецЕсли;
	
	Если МетаданныеОбъекта.Реквизиты.Количество() > 0 Тогда
		
		СтрокаРеквизиты = ДеревоРеквизитов.ПолучитьЭлементы().Добавить();
	
		СтрокаРеквизиты.Выбран        = 1;
		СтрокаРеквизиты.Представление = НСтр("ru = 'Реквизиты'");
		СтрокаРеквизиты.Имя           = "Реквизиты";
		
		КоличествоДобавлено = КоличествоДобавлено + 1;
		
		ДанныеРеквизитов = Новый СписокЗначений;
		
		Для Каждого РеквизитРегистра Из МетаданныеОбъекта.Реквизиты Цикл
			
			ДанныеРеквизитов.Добавить(РеквизитРегистра, ПредставлениеРеквизитаОбъектаМетаданных(РеквизитРегистра));
			
		КонецЦикла;
		
		ДобавитьРеквизитыОбъектаРодительскийУзел(ДанныеРеквизитов, СтрокаРеквизиты, СохраненныеНастройкиОбъектаМетаданных, КоличествоДобавлено);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьРеквизитыОбъектаРодительскийУзел(ДанныеРеквизитов, СтрокаРодитель, СохраненныеНастройки, КоличествоДобавлено)
	
	ДанныеРеквизитов.СортироватьПоПредставлению();
		
	Для Каждого ДанныеРеквизита Из ДанныеРеквизитов Цикл
		
		СтрокаДанныеРеквизита = СтрокаРодитель.ПолучитьЭлементы().Добавить();
		
		СтрокаДанныеРеквизита.Выбран        = ЗначениеВыбранСУчетомСохраненныхНастроек(СохраненныеНастройки, СтрокаРодитель.Имя, ДанныеРеквизита.Значение.Имя);
		СтрокаДанныеРеквизита.Представление = ДанныеРеквизита.Представление;
		СтрокаДанныеРеквизита.Имя           = ДанныеРеквизита.Значение.Имя;
		
		КоличествоДобавлено = КоличествоДобавлено + 1;
		
	КонецЦикла;
	
	РаботаСРезультатамиОбменаКлиентСервер.ОпределитьЗначениеПереключателяДляРодительскойСтроки(СтрокаРодитель, "Выбран");
	
КонецПроцедуры

Функция ПредставлениеРеквизитаОбъектаМетаданных(ДанныеРеквизита)
	
	Возврат ?(ПустаяСтрока(ДанныеРеквизита.Синоним), ДанныеРеквизита.Имя, ДанныеРеквизита.Синоним);
	
КонецФункции

Функция СохраненныеНастройкиОтображаемыеРеквизитыФормыПроблемы() Экспорт
	
	Возврат ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПообъектныйОбмен", "ОтображаемыеРеквизитыФормыПроблемы", Неопределено);
	
КонецФункции

Функция ДанныеОтображаемыхРеквизитовДляСохранения(ОтображаемыеРеквизиты) Экспорт
	
	ДанныеОтображаемыхРеквизитовДляСохранения = Новый Соответствие;
	
	Для Каждого РодительскаяСтрока Из ОтображаемыеРеквизиты.ПолучитьЭлементы() Цикл
		
		ДанныеРодительскойСтроки = Новый Соответствие; 
		
		Для Каждого ПодчиненнаяСтрока Из РодительскаяСтрока.ПолучитьЭлементы() Цикл
			
			Если ПодчиненнаяСтрока.Выбран = 1 Тогда
				
				 ДанныеРодительскойСтроки.Вставить(ПодчиненнаяСтрока.Имя, Истина);
				
			КонецЕсли 
			
		КонецЦикла;
		
		ДанныеОтображаемыхРеквизитовДляСохранения.Вставить(РодительскаяСтрока.Имя, ДанныеРодительскойСтроки);
		
	КонецЦикла;
	
	Возврат ДанныеОтображаемыхРеквизитовДляСохранения;
	
КонецФункции

#КонецОбласти

#Область ИнициализацияСхемыКомпоновкиПоДоступнымПолям

Функция ТекстЗапросаСхемыКомпоновки(ПолноеИмяТипаМетаданных, ДоступныеПоля, ДляОбъектовИБ) 
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|ТаблицаДанных.*
	|	ИЗ
	|	&ИмяТаблицы КАК ТаблицаДанных";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяТаблицы", ПолноеИмяТипаМетаданных);
	
	ТекстВыбранныеПоля = "";
	
	Для Каждого ЭлементСписка Из ДоступныеПоля Цикл
		
		ТекстВыбранныеПоля = ТекстВыбранныеПоля + "
			|" + СтрШаблон("ТаблицаДанных.%1 КАК %1,", ЭлементСписка.Значение);
		
	КонецЦикла;
	
	Если Не ДляОбъектовИБ Тогда
		
		ТекстВыбранныеПоля = ТекстВыбранныеПоля + "
		|ЗНАЧЕНИЕ(Перечисление.ДействияПриУстановкеСоответствийОбъектам.ПустаяСсылка)  КАК ВыбранноеДействие";
		
	Иначе
		
		ТекстВыбранныеПоля = Лев(ТекстВыбранныеПоля, СтрДлина(ТекстВыбранныеПоля) - 1);
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаДанных.*", ТекстВыбранныеПоля);
	
	Возврат ТекстЗапроса;
	
КонецФункции 

Функция СхемаКомпоновкиДанных(ПолноеИмяТипаМетаданных, ДоступныеПоляПредставлений, ДляОбъектовИБ)
	
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "local";
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.ИсточникДанных = "ИсточникДанных1";
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	НаборДанных.Запрос = ТекстЗапросаСхемыКомпоновки(ПолноеИмяТипаМетаданных, ДоступныеПоляПредставлений, ДляОбъектовИБ);
	НаборДанных.Имя = "НаборДанных1"; 
	
	Возврат СхемаКомпоновкиДанных;
	
КонецФункции

#КонецОбласти

#Область ИспользованиеРегламентныхЗаданий

Функция РегламентноеЗаданиеИспользуется(ИмяРегламентногоЗадания)
	
	Возврат РегламентныеЗаданияСервер.ПараметрРегламентногоЗадания(
		Метаданные.РегламентныеЗадания[ИмяРегламентногоЗадания], "Использование", Ложь);
	
КонецФункции
	
Процедура ИспользоватьРегламентноеЗаданиеЕстьНеобходимо(ИмяРегламентногоЗадания, Использовать)
	
	ЗаданиеИспользуется = РегламентноеЗаданиеИспользуется(ИмяРегламентногоЗадания);
	
	Если ЗаданиеИспользуется <> Использовать Тогда
		
		РегламентныеЗаданияСервер.УстановитьПараметрыРегламентногоЗадания(
			Метаданные.РегламентныеЗадания[ИмяРегламентногоЗадания], Новый Структура("Использование", Использовать));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Функция СклонениеТипаМетаданных(МетаданныеОбъекта, Падеж)
	
	ИмяТипаМетаданных = РаботаСРезультатамиОбменаКлиентСервер.ИмяТипаМетаданныхПоПолномуИмени(МетаданныеОбъекта.ПолноеИмя());
	ПредставлениеТипаМетаданных = РаботаСРезультатамиОбменаКлиентСервер.ПредставлениеТипаМетаданных(ИмяТипаМетаданных);
	
	СклоненияСтроки = ПолучитьСклоненияСтроки(ПредставлениеТипаМетаданных,,"ПД=" + Падеж);
	
	Возврат СклоненияСтроки[0];
	
КонецФункции

Функция ТекстВопросаПриЗаписиСОшибкой(МетаданныеОбъекта, ПричинаДобавления)
	
	ШаблонВопроса = "";
	ТекстПриЗаписи = "";
	ТекстЗагрузить = "";
	
	Если ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи Тогда
		
		ШаблонВопроса = НСтр("ru = 'При записи %1 без проверки заполнения возникла ошибка. Загрузить %2 c ошибкой записи?'");
		
	ИначеЕсли ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи Тогда
		
		ШаблонВопроса = НСтр("ru = 'При записи %1 с проверкой заполнения возникла ошибка. Загрузить %2 c ошибкой записи?'");
		
	ИначеЕсли ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроведения Тогда
		
		Возврат НСтр("ru = 'При проведении документа возникла ошибка. Загрузить документ непроведенным?'");
		
	Иначе
		
		Возврат ШаблонВопроса;
		
	КонецЕсли;
	
	ТекстЗагрузить = НРег(СклонениеТипаМетаданных(МетаданныеОбъекта, "Именительный"));
	ТекстПриЗаписи = НРег(СклонениеТипаМетаданных(МетаданныеОбъекта, "Родительный")); 
	
	Возврат СтрШаблон(ШаблонВопроса, ТекстПриЗаписи, ТекстЗагрузить);
	
КонецФункции

#КонецОбласти

#КонецОбласти