///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается в форме добавления подписанта при заполнении реквизитов организации.
// 
// Параметры:
//  РеквизитыОрганизации - Структура:
//   * Организация - ОпределяемыйТип.Организация
//   * ИНН - Строка
//   * ОГРН - Строка
//   * ФизическиеЛица - Массив из см. ПриЗаполненииРеквизитовФизическогоЛица.РеквизитыФизическогоЛица - руководитель(и).
//  СтандартнаяОбработка - Булево - если Истина, реквизиты будут заполнены из подсистемы Организации.
//
Процедура ПриЗаполненииРеквизитовОрганизации(РеквизитыОрганизации, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Вызывается в форме добавления подписанта при заполнении реквизитов физического лица.
// 
// Параметры:
//  РеквизитыФизическогоЛица - Структура:
//   * ФизическоеЛицо - ОпределяемыйТип.ФизическоеЛицо
//   * Должность - Строка
//   * ИННФЛ - Строка
//   * Имя - Строка
//   * Отчество - Строка
//   * Фамилия - Строка
//   * Телефон - Строка
//
Процедура ПриЗаполненииРеквизитовФизическогоЛица(РеквизитыФизическогоЛица) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при удалении запроса на подписание отправленного в сервис документа.
// 
// Параметры:
//  ПараметрыПодписи - Структура:
//   * ИдентификаторДокумента - УникальныйИдентификатор - идентификатор, присвоенный документу при отправке в сервис.
//   * ПодписанныйОбъект - ЛюбаяСсылка - ссылка на объект подписания.
//   * Отправитель - СправочникСсылка.Пользователи - отправитель документа на подпись.
//   * Подписант - СправочникСсылка.ПодписантыСервисаМобильнойПодписи - кому был отправлен документ на подпись
//  УдалитьПодпись - Булево - продолжить удаление ожидаемой подписи стандартно.
//  СтандартнаяОбработка - Булево - если Ложь, не будет удалена уже полученная подпись объекта.
//
Процедура ПриУдаленииОжидаемойПодписиОбъекта(ПараметрыПодписи, УдалитьПодпись, СтандартнаяОбработка) Экспорт
		
КонецПроцедуры

#КонецОбласти
