///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПереданныеПараметры();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область ПоляПоиска

&НаКлиенте
Процедура ПоляПоискаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыОткрытия.Вставить("ПоляПредставления", ДоступныеПоляПоиска);
	ПараметрыОткрытия.Вставить("ЗаголовокФормы",    НСтр("ru = 'Реквизиты поиска'"));
	ПараметрыОткрытия.Вставить("ТекстПояснения",    НСтр("ru = 'Выберите реквизиты объекта, по которым будет осуществляться поиск.'"));
	
	ОповещениеОбИзмененииПолейПоиска = Новый ОписаниеОповещения("ПослеИзмененияПолейПоиска", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ВыборОтображаемыхПолейЗагружаемогоОбъекта", ПараметрыОткрытия, ЭтотОбъект,
	              ,,, ОповещениеОбИзмененииПолейПоиска, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляПоискаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ПустаяСтрока(Текст) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДополнитьДанныеВыбораПодборПоляПоиска(ДанныеВыбора, Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляПоискаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДополнитьДанныеВыбораПодборПоляПоиска(ДанныеВыбора, Текст);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПоляПоискаПриИзменении(Элемент)
	
	ВыполнитьОтметкиВДоступныхПоляхПоПолямПоиска(ПоляПоиска, ДоступныеПоляПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляПоискаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	ВыполнитьОтметкиВДоступныхПоляхПоПолямПоиска(ПоляПоиска, ДоступныеПоляПоиска);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаОтбора

&НаКлиенте
Процедура НастроитьОтборОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "НастроитьОтбор" Тогда
		
		ПараметрыОткрытия = Новый Структура;
		
		ПараметрыОткрытия.Вставить("ПолноеИмяТипаМетаданных",    ПолноеИмяОбъектаМетаданных);
		ПараметрыОткрытия.Вставить("ДоступныеПоля",              ДоступныеПоляПоиска);
		ПараметрыОткрытия.Вставить("СинонимТипаМетаданных",      ПредставлениеТипаМетаданных);
		ПараметрыОткрытия.Вставить("НастройкиКомпоновки",        НастройкиКомпоновкиДанныхОтбораОбъектовИБ);
		ПараметрыОткрытия.Вставить("ИсторияОтборов",             ИсторияОтбораОбъектовИБ);
		ПараметрыОткрытия.Вставить("ДляОбъектовИБ",              Истина);
		
		ОповещениеОбИзмененииОтбора = Новый ОписаниеОповещения("ПослеИзмененияОтбора", ЭтотОбъект);
		
		ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.НастройкаОтбора", ПараметрыОткрытия, ЭтотОбъект,
		              ,,, ОповещениеОбИзмененииОтбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьРежимПояснения(Команда)
	
	НеОтображатьПояснения = Не НеОтображатьПояснения;
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ДанныеВозврата());
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПолейПоиска(Команда)
	
	ОповещениеОВыбореРанееИспользовавшегосяВарианта = Новый ОписаниеОповещения("ПослеВыбораРанееИспользовавшегосяВариантаПолейПоиска", ЭтотОбъект );
	
	РанееИспользовавшиесяПоляПоиска = РанееИспользовавшиесяПоляПоиска();
	
	ПоказатьВыборИзМеню(ОповещениеОВыбореРанееИспользовавшегосяВарианта,
	                    РанееИспользовавшиесяПоляПоиска,
	                    Элементы.ИсторияПолейПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОтбора(Команда)
	
	ОповещениеОВыбореРанееИспользовавшегосяВарианта = Новый ОписаниеОповещения("ПослеИзмененияОтбора", ЭтотОбъект);
	
	РанееИспользовавшиесяВарианты = РаботаСРезультатамиОбменаКлиент.РанееИспользовавшиесяВариантыОтбора(ИсторияОтбораОбъектовИБ);
	
	ПоказатьВыборИзМеню(ОповещениеОВыбореРанееИспользовавшегосяВарианта,
	                    РанееИспользовавшиесяВарианты,
	                    Элементы.ИсторияОтбора);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьПереданныеПараметры()
	
	ПредставлениеТипаМетаданных         = Параметры.ПредставлениеТипаМетаданных;
	ПолноеИмяОбъектаМетаданных          = Параметры.ПолноеИмяОбъектаМетаданных;
	Элементы.ОбъектМетаданных.Заголовок = Параметры.ТекстДля;
	ДоступныеПоляПоиска                 = Параметры.ДоступныеПоляПоиска.Скопировать();
	ПоляПоиска                          = Параметры.ПоляПоиска.Скопировать();
	ИсторияПолейПоиска                  = Параметры.ИсторияПолейПоиска.Скопировать();
	ИсторияОтбораОбъектовИБ             = Параметры.ИсторияОтбораОбъектовИБ.Скопировать();
	
	Если ТипЗнч(Параметры.НастройкиКомпоновкиДанных) = Тип("НастройкиКомпоновкиДанных") Тогда
		
		НастройкиКомпоновкиДанныхОтбораОбъектовИБ = Параметры.НастройкиКомпоновкиДанных;
		АдресДанныхОтбора = ПоместитьВоВременноеХранилище(НастройкиКомпоновкиДанныхОтбораОбъектовИБ, Параметры.ИдентификаторФормыВладельца);
		ОтразитьИзменениеНастройкиКомпоновкиОтбора(НастройкиКомпоновкиДанныхОтбораОбъектовИБ);
		
	КонецЕсли;
	
	НормализоватьПоляПоиска(ПоляПоиска);
	ВыполнитьОтметкиВДоступныхПоляхПоПолямПоиска(ПоляПоиска, ДоступныеПоляПоиска);
	НормализоватьИсториюПолейПоиска();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностью(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Форма.НеОтображатьПояснения Тогда
		
		Элементы.ДекорацияПояснениеОтбора.Видимость                 = Ложь;
		Элементы.ДекорацияПояснениеРеквизитовПоиска.Видимость       = Ложь;
		Элементы.ДекорацияПояснениеОбластиПоискаИБ.Видимость        = Ложь;
		Элементы.ИзменитьРежимПояснения.Заголовок                   = НСтр("ru = 'Показать пояснения'");
		Элементы.ОбластьПоискаНеСопоставленных.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Элементы.ОбластьПоискаДляВсех.ОтображениеПодсказки          = ОтображениеПодсказки.Нет;
		
		
	Иначе
		
		Элементы.ДекорацияПояснениеОтбора.Видимость                 = Истина;
		Элементы.ДекорацияПояснениеРеквизитовПоиска.Видимость       = Истина;
		Элементы.ИзменитьРежимПояснения.Заголовок                   = НСтр("ru = 'Скрыть пояснения'");
		Элементы.ОбластьПоискаНеСопоставленных.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		Элементы.ОбластьПоискаДляВсех.ОтображениеПодсказки          = ОтображениеПодсказки.ОтображатьСнизу;
		Элементы.ДекорацияПояснениеОбластиПоискаИБ.Видимость        = Истина;
		
	КонецЕсли;
	
	Элементы.ИсторияОтбора.Видимость      = Форма.ИсторияОтбораОбъектовИБ.Количество() > 1;
	Элементы.ИсторияПолейПоиска.Видимость = Форма.ИсторияПолейПоиска.Количество() > 1;
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеВозврата()
	
	ДанныеВозврата = Новый Структура;
	
	ДанныеВозврата.Вставить("ОбластьПоиска",     ?(ОбластьПоиска = 0, "ИсключатьУжеСопоставленные", "НеИсключатьУжеСопоставленные"));
	ДанныеВозврата.Вставить("ПоляПоиска",        ПоляПоиска);
	ДанныеВозврата.Вставить("АдресДанныхОтбора", АдресДанныхОтбора);
	
	Возврат ДанныеВозврата;
	
КонецФункции

#Область ПоляПоиска

&НаКлиенте
Процедура ПослеИзмененияПолейПоиска(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("СписокЗначений") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПеренестиВыборИзДоступныхПолейВПоляПоиска(Результат);
	
КонецПроцедуры

&НаСервере
Процедура НормализоватьПоляПоиска(СписокПолейПоиска)
	
	ЭлементыСпискаКУдалению = Новый Массив;
	
	Для Каждого ЭлементСписка Из СписокПолейПоиска Цикл
		
		ЭлементДоступныхПолей = ДоступныеПоляПоиска.НайтиПоЗначению(ЭлементСписка.Значение);
		
		Если ЭлементДоступныхПолей = Неопределено Тогда
			
			ЭлементыСпискаКУдалению.Добавить(ЭлементСписка);
			
		Иначе
			
			ЭлементСписка.Представление = ЭлементДоступныхПолей.Представление;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ЭлементСпискаКУдалению Из ЭлементыСпискаКУдалению Цикл
		
		СписокПолейПоиска.Удалить(ЭлементСпискаКУдалению);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВыполнитьОтметкиВДоступныхПоляхПоПолямПоиска(ПоляПоиска, ДоступныеПоляПоиска)
	
	Для Каждого ЭлементСписка Из ДоступныеПоляПоиска Цикл
		
		ЭлементСписка.Пометка = ПоляПоиска.НайтиПоЗначению(ЭлементСписка.Значение) <> Неопределено;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НормализоватьИсториюПолейПоиска()

	Для Каждого ЭлементСписка Из ИсторияПолейПоиска Цикл
		
		НормализоватьПоляПоиска(ЭлементСписка.Значение);
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВыборИзДоступныхПолейВПоляПоиска(ВыбранныеПоляПоиска)
	
	ПоляПоиска.Очистить();
	
	Для Каждого ЭлементСписка Из ВыбранныеПоляПоиска Цикл
		
		Если ЭлементСписка.Пометка Тогда
			
			ПоляПоиска.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление, Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьДанныеВыбораПодборПоляПоиска(ДанныеВыбора, Текст)
	
	ДанныеВыбора = Новый СписокЗначений;

	Для Каждого ЭлементСписка Из ДоступныеПоляПоиска Цикл
		
		Если ЭлементСписка.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрНачинаетсяС(НРег(ЭлементСписка.Представление), СокрЛП(НРег(Текст)))  Тогда
			
			ДанныеВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДанныеВыбора.Количество() = 0 Тогда
		
		ДанныеВыбора = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораРанееИспользовавшегосяВариантаПолейПоиска(Результат, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(Результат) <> Тип("ЭлементСпискаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаИсторииПоиска = ИсторияПолейПоиска.НайтиПоИдентификатору(Результат.Значение);
	
	Если СтрокаИсторииПоиска = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоляПоиска = СтрокаИсторииПоиска.Значение.Скопировать();
	
КонецПроцедуры 

&НаКлиенте
Функция РанееИспользовавшиесяПоляПоиска()
	
	ИспользовавшиесяВарианты = Новый СписокЗначений;
	
	Для Каждого ИсторическиеДанные Из ИсторияПолейПоиска Цикл
		
		ПоляИсторическогоВарианта = Новый Массив;
		
		Для Каждого ЭлементСписка Из ИсторическиеДанные.Значение Цикл
			
			ПоляИсторическогоВарианта.Добавить(ЭлементСписка.Представление);
			
		КонецЦикла;
		
		ПредставлениеИсторическогоВарианта = СтрСоединить(ПоляИсторическогоВарианта, "; "); 
		
		ИспользовавшиесяВарианты.Добавить(ИсторическиеДанные.ПолучитьИдентификатор(), ПредставлениеИсторическогоВарианта,, БиблиотекаКартинок.История);
		
	КонецЦикла;
	
	Возврат ИспользовавшиесяВарианты;
	
КонецФункции

#КонецОбласти

#Область НастройкаОтбора

&НаКлиенте
Процедура ПослеИзмененияОтбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		ПослеИзмененияОтбораНаСервере(Результат);
		
	ИначеЕсли ТипЗнч(Результат) = Тип("ЭлементСпискаЗначений") Тогда
		
		ЭлементИстории = ИсторияОтбораОбъектовИБ.НайтиПоИдентификатору(Результат.Значение);
		Если ЭлементИстории <> Неопределено Тогда
			
			ПослеИзмененияОтбораНаСервере(ЭлементИстории.Значение);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеИзмененияОтбораНаСервере(Результат)
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		АдресДанныхОтбора = Результат;
		
		СхемаИНастройки = ПолучитьИзВременногоХранилища(Результат);
		
		НастройкиКомпоновкиДанныхОтбораОбъектовИБ = СхемаИНастройки.Настройки;
		
	Иначе
		
		НастройкиКомпоновкиДанныхОтбораОбъектовИБ = Результат;
		
	КонецЕсли;
	
	ОтразитьИзменениеНастройкиКомпоновкиОтбора(НастройкиКомпоновкиДанныхОтбораОбъектовИБ);
	
КонецПроцедуры

&НаСервере
Процедура ОтразитьИзменениеНастройкиКомпоновкиОтбора(НастройкиКомпоновки)
	
	ТекущееПредставлениеОтбора = Строка(НастройкиКомпоновки.Отбор); 
	
	Если ПустаяСтрока(ТекущееПредставлениеОтбора) Тогда 
		
		ТекстИзменитьОтбор = Новый ФорматированнаяСтрока(НСтр("ru = 'Настроить отбор объектов ИБ'"),, ЦветаСтиля.ГиперссылкаЦвет,, "НастроитьОтбор");
		
	Иначе
	
		ТекстИзменитьОтбор = Новый ФорматированнаяСтрока(СтрШаблон("%1: %2", НСтр("ru = 'Отбор объектов ИБ'"), ТекущееПредставлениеОтбора),
		                                     , ЦветаСтиля.ГиперссылкаЦвет,,"НастроитьОтбор");
		
	КонецЕсли;
	
	УправлениеДоступностью(ЭтотОбъект);
	
	Элементы.НастроитьОтбор.Заголовок = ТекстИзменитьОтбор;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти 
