///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьДинамическийСписок();
	Если ЗначениеЗаполнено(Параметры.ПеремещаемыеФайлы) Тогда
		АдресПеремещаемыхФайлов = ПоместитьВоВременноеХранилище(Параметры.ПеремещаемыеФайлы, УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;

	Родитель = Неопределено;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТипЗнч(ТекущиеДанные) = Тип("ДанныеФормыСтруктура") Тогда
		ТекущиеДанные.Свойство("Ссылка", Родитель);
	КонецЕсли;
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Родитель",       Родитель);
	ПараметрыФормы.Вставить("ВладелецФайла",  ВладелецФайлов);
	ПараметрыФормы.Вставить("ЭтоНоваяГруппа", Истина);
	ПараметрыФормы.Вставить("ИмяСправочникаХранилищаФайлов", ИмяСправочникаХранилищаФайлов);
	
	ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ГруппаФайлов", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЭтоАдресВременногоХранилища(АдресПеремещаемыхФайлов) Тогда		
		ПереместитьФайлыВГруппу(АдресПеремещаемыхФайлов, Значение);
		ОповеститьОбИзменении(ТипЗнч(Значение));
		ПараметрыОповещенияЗаписиФайла = РаботаСФайламиСлужебныйКлиент.ПараметрыОповещенияЗаписиФайла();
		
		ПеремещаемыеФайлы = ПолучитьИзВременногоХранилища(АдресПеремещаемыхФайлов);
		Оповестить("Запись_Файл", ПараметрыОповещенияЗаписиФайла, ПеремещаемыеФайлы);
	КонецЕсли;
	ОповеститьОВыборе(Значение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьДинамическийСписок()
	ВладелецФайлов = Параметры.ВладелецФайлов;
	ЗаголовокОшибки = НСтр("ru = 'Невозможно открыть список присоединенных файлов.'");
	ИмяСправочникаХранилищаФайлов = РаботаСФайламиСлужебный.ИмяСправочникаХраненияФайлов(ВладелецФайлов, "", ЗаголовокОшибки);
	ПолноеИмяСправочника = "Справочник." + ИмяСправочникаХранилищаФайлов;

	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ОсновнаяТаблица = ПолноеИмяСправочника;
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ТекстЗапроса = ТекстЗапросаСписка(ПолноеИмяСправочника);
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВладелецФайла", ВладелецФайлов);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтоГруппа", Истина);
	
	Список.Группировка.Элементы.Очистить();
	ЭлементГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ЭлементГруппировки.Использование = Истина;
	ЭлементГруппировки.Поле = Новый ПолеКомпоновкиДанных("ВладелецФайла");
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаСписка(ПолноеИмяСправочника)
	Результат =  "ВЫБРАТЬ
	|	Файлы.Ссылка КАК Ссылка,
	|	Файлы.Наименование КАК Наименование,
	|	Файлы.ЭтоГруппа КАК ЭтоГруппа,
	|	Файлы.ВладелецФайла КАК ВладелецФайла
	|ИЗ
	|	&ИмяСправочника КАК Файлы";

	Результат = СтрЗаменить(Результат, "&ИмяСправочника", ПолноеИмяСправочника);
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Процедура ПереместитьФайлыВГруппу(Знач АдресПеремещаемыхФайлов, Знач Группа)
	ПеремещаемыеФайлы = ПолучитьИзВременногоХранилища(АдресПеремещаемыхФайлов);
	ИмяТаблицы = ПеремещаемыеФайлы[0].Метаданные().ПолноеИмя();
	
	Блокировка = Новый БлокировкаДанных;
	Для Каждого ФайлСсылка Из ПеремещаемыеФайлы Цикл
		ЭлементБлокировки = Блокировка.Добавить(ИмяТаблицы);
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ФайлСсылка);
	КонецЦикла;
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка.Заблокировать();
		
		Для Каждого ФайлСсылка Из ПеремещаемыеФайлы Цикл
			
			ЗаблокироватьДанныеДляРедактирования(ФайлСсылка);
			
			ФайлОбъект = ФайлСсылка.ПолучитьОбъект();
			ФайлОбъект.Родитель = Группа;
			ФайлОбъект.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти