///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Подготавливаем компоненты обмена для работы в интерактивном режиме
//
// Параметры:
//
//   УзелОбмена - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//   НаправлениеОбмена - Строка - направление выполнения обмена: "Отправка" | "Получение".
//   РасширенноеПространствоИмен - Строка - расширенное пространство имен.
// 
// Возвращаемое значение:
//   см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//
Функция КомпонентыОбменаДляИнтерактивнойРаботы(УзелОбмена, НаправлениеОбмена, РасширенноеПространствоИмен = "") Экспорт
	
	Возврат КонвертацияОбъектноСлужебный.КомпонентыОбмена(УзелОбмена, НаправлениеОбмена, РасширенноеПространствоИмен);
	
КонецФункции

// Возвращает опцию плана обмена, указывающую на то, какой механизм поиска данных по ключевым свойствам применить.
//
// Параметры:
//   УзелКорреспондента - Строка - имя плана обмена, как оно задано в конфигураторе.
//
// Возвращаемое значение:
//   Число - количество дней, при которых определенная стратегия поиска считается актуальной.
//
Функция ИнтервалОбновленияСтратегииПоискаПоКлючамПланаОбменаXDTO(Знач УзелКорреспондента) Экспорт
	
	Возврат КонвертацияОбъектноРецепцияСервер.ИнтервалОбновленияСтратегииПоискаПоКлючамПланаОбменаXDTO(УзелКорреспондента);
	
КонецФункции

// Определяет, если ли хотя бы один узел обмена, использующий пообъектный обмен.
//
// Возвращаемое значение:
//    Булево - Истина, если такой план обмена есть. Ложь, если такие планы обмена отсутствуют.
//
Функция ЕстьУзлыИспользующиеПообъектныйОбмен() Экспорт
	
	Возврат РегистрыСведений.ОбщиеНастройкиУзловИнформационныхБаз.ЕстьУзлыИспользующиеПообъектныйОбмен();
	
КонецФункции

#КонецОбласти