///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПереданныеПараметры(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Ок(Команда)
	
	Закрыть(ДанныеВозврата(ВладелецФормы.УникальныйИдентификатор));
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОтборов(Команда)
	
	ОповещениеОВыбореРанееИспользовавшегосяВарианта = Новый ОписаниеОповещения("ПослеВыбораВариантаОтбора", ЭтотОбъект );
	
	ПредыдущиеВариантыОтбора = РаботаСРезультатамиОбменаКлиент.РанееИспользовавшиесяВариантыОтбора(ИсторияОтборов);
	
	ПоказатьВыборИзМеню(ОповещениеОВыбореРанееИспользовавшегосяВарианта,
	                    ПредыдущиеВариантыОтбора,
	                    Элементы.ИсторияОтборов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораВариантаОтбора(Результат, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(Результат) <> Тип("ЭлементСпискаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементСпискаИстории = ИсторияОтборов.Получить(Результат.Значение);
	
	Если ЭлементСпискаИстории = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(ЭлементСпискаИстории.Значение);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовокФормы()
	
	ТекстНастройкиОтбора = НСтр("ru = 'Настройки отбора'");
	
	ИмяТипаМетаданных = РаботаСРезультатамиОбменаКлиентСервер.ИмяТипаМетаданныхПоПолномуИмени(Параметры.ПолноеИмяТипаМетаданных);
	
	ТекстДля = РаботаСРезультатамиОбменаКлиентСервер.ТекстДляПоИмениОбъектаМетаданных(ИмяТипаМетаданных, Истина);
	
	Заголовок = СтрШаблон("%1 %2 ""%3""", ТекстНастройкиОтбора, ТекстДля, Параметры.СинонимТипаМетаданных);

КонецПроцедуры 

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроек(ПереданныеНастройкиКомпоновки)
	
	Если СниматьПометкиВОтборе Тогда
		РаботаСРезультатамиОбменаКлиентСервер.СнятьПометкиВОтборе(ПереданныеНастройкиКомпоновки);
	КонецЕсли;
	
	АдресСхемыКомпоновки = РаботаСРезультатамиОбмена.АдресСхемыКомпоновкиПоДоступнымПолямОбъекта(
		ПолноеИмяТипаМетаданных, ДоступныеПоля, УникальныйИдентификатор, ДляОбъектовИБ);
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновки));
	
	Если ПереданныеНастройкиКомпоновки <> Неопределено Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(ПереданныеНастройкиКомпоновки);
		КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДанныеВозврата(УникальныйИдентификатор)
	
	ДанныеВозврата = Новый Структура;
	ДанныеВозврата.Вставить("СхемаКомпоновки", ПолучитьИзВременногоХранилища(АдресСхемыКомпоновки));
	ДанныеВозврата.Вставить("Настройки",       КомпоновщикНастроек.ПолучитьНастройки());
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеВозврата, УникальныйИдентификатор);
	
КонецФункции 

&НаСервере
Процедура ОбработатьПереданныеПараметры(Отказ)
	
	Если ПустаяСтрока(Параметры.ПолноеИмяТипаМетаданных) Тогда
		ТекстСообщения = НСтр("ru = 'В форму не передана информация о типе объекта.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	ПолноеИмяТипаМетаданных       = Параметры.ПолноеИмяТипаМетаданных;
	ДляОбъектовИБ                 = Параметры.ДляОбъектовИБ;
	ПереданныеНастройкиКомпоновки = Параметры.НастройкиКомпоновки;
	СниматьПометкиВОтборе         = Параметры.СниматьПометкиВОтборе;
	
	Если ТипЗнч(Параметры.ДоступныеПоля) = Тип("СписокЗначений") Тогда
		
		ДоступныеПоля = Параметры.ДоступныеПоля.Скопировать();
		
	Иначе
		
		Для Каждого СтрокаТаблицы Из Параметры.ДоступныеПоля Цикл
			
			НоваяСтрока = ДоступныеПоля.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
		КонецЦикла
		
	КонецЕсли;
	
	ИсторияОтборов = Параметры.ИсторияОтборов;
	
	Если ИсторияОтборов.Количество() > 0 Тогда
		Элементы.ИсторияОтборов.Видимость = Истина;
	КонецЕсли;
	
	СформироватьЗаголовокФормы();
	
	ИнициализироватьКомпоновщикНастроек(ПереданныеНастройкиКомпоновки);
	
КонецПроцедуры 

#КонецОбласти


