///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПереданныеПараметры();

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ДанныеВозврата());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьПереданныеПараметры()
	
	ПоказыватьПояснениеПередЗагрузкойКакНовые = Параметры.ПоказыватьПояснениеПередЗагрузкойКакНовые;
	ПоказыватьИсториюУКнопок                  = Параметры.ПоказыватьИсториюУКнопок;
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеВозврата()

	ДанныеВозврата = Новый Структура;
	
	ДанныеВозврата.Вставить("ПоказыватьПояснениеПередЗагрузкойКакНовые", ПоказыватьПояснениеПередЗагрузкойКакНовые);
	ДанныеВозврата.Вставить("ПоказыватьИсториюУКнопок",                  ПоказыватьИсториюУКнопок);
	ДанныеВозврата.Вставить("ПоказыватьПодтверждениеИзменений",          ПоказыватьПодтверждениеИзменений);
	
	Возврат ДанныеВозврата;

КонецФункции

#КонецОбласти



