///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если Не Объект.Ссылка = ПредопределенноеЗначение("Справочник.СостоянияОригиналовПервичныхДокументов.ОригиналПолучен") 
		И Не Объект.Ссылка = ПредопределенноеЗначение("Справочник.СостоянияОригиналовПервичныхДокументов.ФормаНапечатана") Тогда
		Объект.РеквизитДопУпорядочивания = РассчитатьПорядокЭлемента();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция РассчитатьПорядокЭлемента()

	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	КОЛИЧЕСТВО(*) КАК Количество
	              |ИЗ
	              |	Справочник.СостоянияОригиналовПервичныхДокументов КАК СостоянияОригиналовПервичныхДокументов" ;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();

	ПорядокПоУмолчанию = Выборка.Количество - 1;

	Возврат ПорядокПоУмолчанию; 

КонецФункции

#КонецОбласти