///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// ТехнологияСервиса.ОбменСообщениями

// Текущая (используемая вызывающим кодом) версия интерфейса сообщений.
//
// Возвращаемое значение:
//   Строка - номер версии интерфейса
//
Функция Версия() Экспорт
	
	Возврат СообщенияОткрытаяАвторизацияПочтовогоСервисаОбработчикСообщения_1_0_0_1.Версия();
	
КонецФункции 

// Пространство имен текущей (используемой вызывающим кодом) версии интерфейса сообщений.
//
// Возвращаемое значение:
//   Строка - пространство имен интерфейса
//
Функция Пакет() Экспорт
	
	Возврат СообщенияОткрытаяАвторизацияПочтовогоСервисаОбработчикСообщения_1_0_0_1.Пакет();
	
КонецФункции 

// Название программного интерфейса сообщений.
//
// Возвращаемое значение:
//   Строка - название программного интерфейса сообщений
//
Функция ПрограммныйИнтерфейс() Экспорт
	
	Возврат СообщенияОткрытаяАвторизацияПочтовогоСервисаОбработчикСообщения_1_0_0_1.ПрограммныйИнтерфейс();
	
КонецФункции 

// Выполняет регистрацию обработчиков сообщений в качестве обработчиков каналов обмена сообщениями.
//
// Параметры:
//   МассивОбработчиков - Массив из ОбщийМодуль - коллекция модулей, содержащих обработчики
//
Процедура ОбработчикиКаналовСообщений(МассивОбработчиков) Экспорт
	
	МассивОбработчиков.Добавить(СообщенияОткрытаяАвторизацияПочтовогоСервисаОбработчикСообщения_1_0_0_1);
	
КонецПроцедуры

// Выполняет регистрацию обработчиков трансляции сообщений.
//
// Параметры:
//   МассивОбработчиков - Массив из ОбщийМодуль - коллекция модулей, содержащих обработчики
//
Процедура ОбработчикиТрансляцииСообщений(МассивОбработчиков) Экспорт
	
КонецПроцедуры

// Конец ТехнологияСервиса.ОбменСообщениями

#КонецОбласти

#КонецОбласти