///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПереданныеПараметры(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьОтображениеФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияВопросОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьВыбранныйОбъект" Тогда
		
		ПоказатьЗначение(, ВыбранныйОбъект);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьУзелПланаОбмена" Тогда
		
		ПоказатьЗначение(, УзелПланаОбмена);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияФормы

&НаСервере
Процедура ОбработатьПереданныеПараметры(Отказ)
	
	Если ТипЗнч(Параметры.УжеСопоставленныеИдентификаторы) <> Тип("Массив")
		Или Параметры.УжеСопоставленныеИдентификаторы.Количество() = 0 Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	ВыбранныйОбъект  = Параметры.ВыбранныйОбъект;
	ПолученныйОбъект = Параметры.ПолученныйОбъект;
	УзелПланаОбмена  = Параметры.УзелПланаОбмена;
	УжеСопоставленныеИдентификаторы.ЗагрузитьЗначения(Параметры.УжеСопоставленныеИдентификаторы);
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеВопросаПользователю

&НаСервере
Процедура СформироватьОтображениеФормы()
	
	ШаблонСообщения = НСтр("ru = 'Выбран %1 %2, но для него уже %3 приложения-корреспондента'");
	
	СтрокаВыбран                  = Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru = 'Выбран %1'"), ПредставлениеТипаОбъекта()),, ЦветаСтиля.ПоясняющийТекст);
	СтрокаВыбранныйОбъект         = Новый ФорматированнаяСтрока(Строка(ВыбранныйОбъект),, ЦветаСтиля.ГиперссылкаЦвет,, "ОткрытьВыбранныйОбъект");
	СтрокаУжеУстановлено          = Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru = 'но для него уже %1 (%2) приложения-корреспондента'"),
	                                                            СтрокаУстановленоСоответствие(), УстановленныеСоответствияСтрокой()),, ЦветаСтиля.ПоясняющийТекст);
	СтрокаПриложениеКорреспондент = Новый ФорматированнаяСтрока(Строка(УзелПланаОбмена),, ЦветаСтиля.ГиперссылкаЦвет,, "ОткрытьУзелПланаОбмена");
	СтрокаВопрос                  = Новый ФорматированнаяСтрока(НСтр("ru = 'Добавить для выбранного объекта еще одно соответствие?'"),,ЦветаСтиля.ПоясняющийТекст);
	
	Элементы.ДекорацияВопрос.Заголовок = Новый ФорматированнаяСтрока(СтрокаВыбран, " ", СтрокаВыбранныйОбъект, ", ",
	                                    СтрокаУжеУстановлено, " ", СтрокаПриложениеКорреспондент, ". ", СтрокаВопрос);
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеТипаОбъекта()
	
	МетаданныеОбъекта = ВыбранныйОбъект.Метаданные();
	
	Если ОбщегоНазначения.ЭтоСправочник(МетаданныеОбъекта) Тогда
		Возврат НСтр("ru = 'элемент справочника'");
	ИначеЕсли ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта) Тогда
		Возврат НСтр("ru = 'документ'");
	ИначеЕсли ОбщегоНазначения.ЭтоПланВидовХарактеристик(МетаданныеОбъекта) Тогда
		Возврат НСтр("ru = 'элемент плана вида характеристик'");
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СтрокаУстановленоСоответствие()
	
	Если УжеСопоставленныеИдентификаторы.Количество() > 1 Тогда
		
		Возврат НСтр("ru = 'установлены соответствия с объектами'");
		
	Иначе
		
		Возврат НСтр("ru = 'установлено соответствие с объектом'");
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция УстановленныеСоответствияСтрокой()
	
	Возврат СтрСоединить(УжеСопоставленныеИдентификаторы.ВыгрузитьЗначения(), ", ");
	
	
КонецФункции

#КонецОбласти

#КонецОбласти

