///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ОбработатьПереданныеПараметры(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьДанныеФормы();
	
	ЗаполнитьТаблицуОбъектовДляСопоставления();
	
	ЗаполнитьВыборРеквизитовДляПанели();
	
	УстановитьЗначенияПоУмолчанию();
	
	ЗагрузитьСохраненныеНастройкиФормы();
	
	НастроитьФормуПоЗаполненнымДанным();
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	УдалитьЛишниеНастройки(Настройки);
	
	НастройкиВсехОбъектов = СохраненныеНастройкиФормы();
	
	Если НастройкиВсехОбъектов = Неопределено Тогда
		
		НастройкиВсехОбъектов = Новый Соответствие;
		
	КонецЕсли;
	
	НастройкиОбъектаМетаданных = НастройкиВсехОбъектов.Получить(ИдентификаторОбъектаМетаданных);
	
	Если НастройкиОбъектаМетаданных = Неопределено Тогда
		
		НастройкиОбъектаМетаданных = Новый Соответствие;
		
	КонецЕсли;
	
	НастройкиОбъектаМетаданных.Вставить("ОтображаемыеРеквизитыПанели",                        ДанныеСпискаДляСохраненияВНастройках(ОтображаемыеРеквизитыПанели, Истина));
	НастройкиОбъектаМетаданных.Вставить("ПоляПредставления",                                  ДанныеСпискаДляСохраненияВНастройках(ОтображаемыеПоля, Истина));
	НастройкиОбъектаМетаданных.Вставить("ПоляПоиска",                                         ДанныеСпискаДляСохраненияВНастройках(ПоляПоиска, Ложь));
	НастройкиОбъектаМетаданных.Вставить("ИсторияОтображаемыхПолей",                           ДанныеСпискаДляСохраненияВНастройках(ИсторияОтображаемыхПолей, Ложь));
	НастройкиОбъектаМетаданных.Вставить("ИсторияОтборов",                                     ДанныеСпискаДляСохраненияВНастройках(ИсторияОтборов, Ложь));
	НастройкиОбъектаМетаданных.Вставить("ИсторияОтбораОбъектовИБ",                            ДанныеСпискаДляСохраненияВНастройках(ИсторияОтбораОбъектовИБ, Ложь));
	НастройкиОбъектаМетаданных.Вставить("ИсторияПолейПоиска",                                 ДанныеСпискаДляСохраненияВНастройках(ИсторияПолейПоиска, Ложь));
	НастройкиОбъектаМетаданных.Вставить("ИсторияПоискаСоответствий",                          ИсторияПоискаСоответствий);
	НастройкиОбъектаМетаданных.Вставить("НастройкиКомпоновкиДанныхОтбораЗагружаемыхОбъектов", НастройкиКомпоновкиДанныхОтбораЗагружаемыхОбъектов);
	НастройкиОбъектаМетаданных.Вставить("НастройкиКомпоновкиДанныхОтбораОбъектовИБ",          НастройкиКомпоновкиДанныхОтбораОбъектовИБ);
	
	НастройкиВсехОбъектов.Вставить(ИдентификаторОбъектаМетаданных, НастройкиОбъектаМетаданных);
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"Обработки.РаботаСРезультатамиОбмена.Форма.УстановкаСоответствий", 
		"НастройкиРаботыПоОбъектам", 
		НастройкиВсехОбъектов);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	УдалитьЛишниеНастройки(Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы
		Или ВыполняетсяЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	Если КоличествоИзменения > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		Отказ                = Истина;
		
		ТекстВопроса = НСтр("ru = 'Есть непримененные изменения. Все равно закрыть форму?'"); 
		ОповещениеПослеОтветаНаВопрос = Новый ОписаниеОповещения("ПослеОтветаНаВопросОЗакрытииФормы", ЭтотОбъект);
		
		ПоказатьВопрос(ОповещениеПослеОтветаНаВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеОтбораОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "СнятьОтбор" Тогда
		
		ПредставлениеОтбора = "";
		
		ОбновитьЗаголовкиФормыСИтогами(ЭтотОбъект);
		УстановитьОтборЗагружаемыеОбъекты(ЭтотОбъект, Ложь, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационнаяПанельОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ЗагрузитьКакНовые" Тогда
		
		Если НеПоказыватьЗагрузитьОставшиесяКакНовые Тогда
			
			ОтметитьЗагрузитьОставшиесяКакНовые();
			
		Иначе
			
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("ПолноеИмяТипаМетаданных", ПолноеИмяОбъектаМетаданных);
			ПараметрыОткрытия.Вставить("СинонимТипаМетаданных",   СинонимОбъектаМетаданных);
			
			ОповещениеЗакрытиеЗагрузитьКакНовые = Новый ОписаниеОповещения("ПослеЗакрытияЗагрузитьКакНовые", ЭтотОбъект);
			
			ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ЗагрузитьОставшиесяКакНовые", ПараметрыОткрытия, ЭтотОбъект,
			             ,,,ОповещениеЗакрытиеЗагрузитьКакНовые, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыДляУстановкиСоответствий

&НаКлиенте
Процедура ОбъектыДляУстановкиСоответствийПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ОбъектыДляУстановкиСоответствий.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Элементы.ОбъектыДляУстановкиСоответствийДействие.СписокВыбора;
	
	СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СоответствиеВИБ) Тогда
		
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.УстановитьСоответствиеИЗагрузить"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.УстановитьСоответствиеНоНеЗагружать"));
		
	Иначе
		
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.СоздатьНовый"));
		
	КонецЕсли;
	
	СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.НеЗагружать"));
	СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.ДействиеНеОпределено"));
	
	ИдентификаторАктивизированнойСтроки = ТекущиеДанные.ПолучитьИдентификатор();
	
	Если ИдентификаторАктивизированнойСтроки <> ИдентификаторТекущейСтрокиОбъектыДляУстановкиСоответствий Тогда
		ИдентификаторТекущейСтрокиОбъектыДляУстановкиСоответствий = ИдентификаторАктивизированнойСтроки;
	Иначе
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПослеАктивизацииСтрокиОбъектыДляУстановкеСоответствий", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыДляУстановкиСоответствийСоответствиеВИБНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ОбъектыДляУстановкиСоответствий.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
	ДополнительныеПараметры.Вставить("Действие",      "ВопросЕслиСоответствиеЕсть");
	
	ОповещениеПослеВыбораСопоставляемогоЭлемента = Новый ОписаниеОповещения("ПослеРучногоВыбораСоответствияИБ",
	                                                                        ЭтотОбъект, 
	                                                                        ДополнительныеПараметры);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму(ПолноеИмяОбъектаМетаданных + ".ФормаВыбора", ПараметрыОткрытия , ЭтотОбъект,,,,
	             ОповещениеПослеВыбораСопоставляемогоЭлемента, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыДляУстановкиСоответствийДействиеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОбъектыДляУстановкиСоответствий.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОпределитьИзменениеСтрокиСопоставленныеОбъекты(ТекущиеДанные);
	
	ОбновитьЗаголовкиФормыСИтогами(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыДляУстановкиСоответствийДействиеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыДляУстановкиСоответствийДействиеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Текст) 
		И ДанныеВыбора = Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыДляУстановкиСоответствийСоответствиеВИБПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОбъектыДляУстановкиСоответствий.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.СоответствиеВИБ) Тогда
		
		ТекущиеДанные.СоответствиеУстановлено = Ложь;
		
		Если ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.УстановитьСоответствиеИЗагрузить")
			Или ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.УстановитьСоответствиеНоНеЗагружать") Тогда
			
			ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.ДействиеНеОпределено");
			ОпределитьИзменениеСтрокиСопоставленныеОбъекты(ТекущиеДанные);
			
		КонецЕсли;
		
		ОбновитьЗаголовкиФормыСИтогами(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеквизитыОбъекта

&НаКлиенте
Процедура РеквизитыОбъектаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = РеквизитыОбъекта.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ЗначениеРеквизита) Тогда
		
		Если ТипЗнч(ТекущиеДанные.ЗначениеРеквизита) <> Тип("Строка") 
			И ТипЗнч(ТекущиеДанные.ЗначениеРеквизита) <> Тип("Число")
			И ТипЗнч(ТекущиеДанные.ЗначениеРеквизита) <> Тип("Булево") Тогда
			
			ПоказатьЗначение(, ТекущиеДанные.ЗначениеРеквизита);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтображаемыеРеквизитыПанели

&НаКлиенте
Процедура ОтображаемыеРеквизитыПанелиВыбранПриИзменении(Элемент)
	
	СформироватьЗаголовокОтображаемыеРеквизитыПанели(ЭтотОбъект);
	
	ОбновитьОтображениеОбъектаВПанели();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

#Область ПанельРеквизитов

&НаКлиенте
Процедура ОтображаемыеРеквизитыПанелиСнятьФлажки(Команда)
	
	ИзменитьФлажкиРеквизитыПанели(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображаемыеРеквизитыПанелиУстановитьФлажки(Команда)
	
	ИзменитьФлажкиРеквизитыПанели(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПанель(Команда)
	
	ПанельРеквизитовСкрыта = Истина;
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПанель(Команда)
	
	ПанельРеквизитовСкрыта = Ложь;
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ПорядокРаботы

&НаКлиенте
Процедура НастроитьОтображаемыеПоля(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыОткрытия.Вставить("ПоляПредставления", ОтображаемыеПоля);
	ПараметрыОткрытия.Вставить("История"          , ИсторияОтображаемыхПолей);
	
	Если Не НеПоказыватьИсториюУКнопок
		И ИсторияОтображаемыхПолей.Количество() > 1 Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПараметрыОткрытия", ПараметрыОткрытия);
		
		ОповещениеОВыбореРанееИспользовавшегосяВарианта = Новый ОписаниеОповещения("ПослеВыбораРанееИспользовавшегосяВариантаПредставления", 
		                                                                            ЭтотОбъект,
		                                                                            ДополнительныеПараметры);
		
		РанееИспользовавшиесяОтображаемыеПоля = РаботаСРезультатамиОбменаКлиентСервер.РанееИспользовавшиесяОтображаемыеПоля(ИсторияОтображаемыхПолей); 
		РанееИспользовавшиесяОтображаемыеПоля.Добавить(-1, НСтр("ru = 'Настроить другой вариант отображаемых полей...'"),, БиблиотекаКартинок.ЭлементИсторииВыбора);
		
		ПоказатьВыборИзМеню(ОповещениеОВыбореРанееИспользовавшегосяВарианта,
		                    РанееИспользовавшиесяОтображаемыеПоля,
		                    Элементы.НастроитьПоляПредставления);
		
	Иначе
		
		ОткрытьФормуНастройкиОтображаемыхПолей(ПараметрыОткрытия);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтбор(Команда)
	
	Если Не НеПоказыватьИсториюУКнопок
		И ИсторияОтборов.Количество() > 1 Тогда 
		
		ОповещениеОВыбореРанееИспользовавшегосяВарианта = Новый ОписаниеОповещения("ПослеИзмененияОтбора",
		                                                                            ЭтотОбъект);
		
		РанееИспользовавшиесяВарианты = РаботаСРезультатамиОбменаКлиент.РанееИспользовавшиесяВариантыОтбора(ИсторияОтборов);
		РанееИспользовавшиесяВарианты.Добавить(-1, НСтр("ru = 'Выбрать другой вариант отбора...'"),, БиблиотекаКартинок.ЭлементИсторииВыбора);
		
		ПоказатьВыборИзМеню(ОповещениеОВыбореРанееИспользовавшегосяВарианта,
		                    РанееИспользовавшиесяВарианты,
		                    Элементы.НастроитьПоляОтбора);
		
	Иначе
		
		ОткрытьФормуНастройкиОтбора();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИзменения(Команда)
	
	УстановитьОтборЗагружаемыеОбъекты(ЭтотОбъект, Ложь, Истина);
	
	ПредставлениеОтбора = НСтр("ru = 'Объекты с изменениями'"); 
	
	ОбновитьЗаголовкиФормыСИтогами(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСоответствия(Команда)
	
	Если Не НеПоказыватьИсториюУКнопок
		И ИсторияПоискаСоответствий.Количество() > 1 Тогда 
		
		ОповещениеОВыбореРанееИспользовавшегосяВарианта = Новый ОписаниеОповещения("ПослеИзмененияНастройкиПоискаСопоставления", ЭтотОбъект);
		
		РанееИспользовавшиесяВарианты = РанееИспользовавшиесяНастройкиПоискаСоответствий();
		РанееИспользовавшиесяВарианты.Добавить(-1, НСтр("ru = 'Выбрать другой вариант.....'"),, БиблиотекаКартинок.ЭлементИсторииВыбора);
		
		ПоказатьВыборИзМеню(ОповещениеОВыбореРанееИспользовавшегосяВарианта,
		                    РанееИспользовавшиесяВарианты,
		                    Элементы.УстановкаСоответствий);
		
	Иначе
		
		ОткрытьФормуУстановкиСоответствий();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИзменения(Команда)
	
	Если КоличествоИзменения = 0 Тогда
		
		ТекстПредупреждения = НСтр("ru = 'Нет объектов к загрузке, для которых можно применить изменения.'");
		ПоказатьПредупреждение(, ТекстПредупреждения, 10);
		
		Возврат;
		
	КонецЕсли;
	
	Если Не НеПоказыватьПодтверждениеИзменений Тогда
		
		ОткрытьФормуИнформацияПрименениеИзменений();
		
	Иначе
		
		ПрименитьИзмененияНаКлиенте();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеДействий

&НаКлиенте
Процедура НеЗагружать(Команда)
	
	УстановитьДействиеДляВыделенныхСтрок(ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.НеЗагружать"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСоответствиеДействиеНеопределено(Команда)
	
	УстановитьДействиеДляВыделенныхСтрок(ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.ДействиеНеОпределено"));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовый(Команда)
	
	УстановитьДействиеДляВыделенныхСтрок(ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.СоздатьНовый"));
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьИЗагрузить(Команда)
	
	УстановитьДействиеДляВыделенныхСтрок(ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.УстановитьСоответствиеИЗагрузить"));
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьНоНеЗагружать(Команда)
	
	УстановитьДействиеДляВыделенныхСтрок(ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.УстановитьСоответствиеНоНеЗагружать"));
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Настройки(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ПоказыватьПояснениеПередЗагрузкойКакНовые", Не НеПоказыватьЗагрузитьОставшиесяКакНовые);
	ПараметрыОткрытия.Вставить("ПоказыватьИсториюУКнопок",                  Не НеПоказыватьИсториюУКнопок);
	
	ОповещениеОбИзмененииНастроек = Новый ОписаниеОповещения("ПослеИзмененияНастроекФормы", ЭтотОбъект, );
	
	ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.НастройкиРаботыФормаУстановкиСоответствий", ПараметрыОткрытия, ЭтотОбъект,
	             ,,,ОповещениеОбИзмененииНастроек, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияДанныхФормы

&НаСервере
Процедура ИнициализироватьДанныеФормы()
	
	ИдентификаторТекущейСтрокиОбъектыДляУстановкиСоответствий = 1;
	
	ЦветПоясняющийТекст = ЦветаСтиля.ПоясняющийТекст;
	ЦветГиперссылки     = ЦветаСтиля.ГиперссылкаЦвет;
	
	ШрифтПолужирный     = ШрифтыСтиля.ЗаголовокПредставленияТипаОбъектаШрифт;
	
	Элементы.РеквизитыОбъектаНайтиВезде.Видимость    = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПереданныеПараметры(Отказ)
	
	Если Не ЗначениеЗаполнено(Параметры.ИдентификаторОбъектаМетаданных)
		Или Не ЗначениеЗаполнено(Параметры.УзелИнформационнойБазы) Тогда
			ТекстСообщения = НСтр("ru = 'В форму не передана информация о типе объектов или узле приложения корреспондента.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	ИдентификаторОбъектаМетаданных = Параметры.ИдентификаторОбъектаМетаданных;
	УзелИнформационнойБазы         = Параметры.УзелИнформационнойБазы;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОбъектовДляСопоставления()
	
	ОбъектыДляУстановкиСоответствий.Очистить();
	РеквизитыОбъекта.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыКЗагрузке.ПолученныйОбъект                           КАК ПолученныйОбъект,
	|	ОбъектыКЗагрузке.ДанныеСконвертированногоОбъекта            КАК ДанныеОбъекта,
	|	ОбъектыКЗагрузке.ПравилоКонвертации                         КАК ПравилоКонвертации,
	|	ОбъектыКЗагрузке.ОбъектФормата                              КАК ОбъектФормата
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|ГДЕ
	|	ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПоискСоответствия)
	|	И ОбъектыКЗагрузке.ОбъектМетаданных = &ОбъектМетаданных
	|	И ОбъектыКЗагрузке.УзелПланаОбмена = &УзелИнформационнойБазы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////1
	|ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.ПолноеИмя КАК ПолноеИмя,
	|	ИдентификаторыОбъектовМетаданных.Синоним   КАК Синоним
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.Ссылка = &ОбъектМетаданных"; 
	
	Запрос.УстановитьПараметр("ОбъектМетаданных", ИдентификаторОбъектаМетаданных);
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", УзелИнформационнойБазы);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДанныеОбъектаМетаданных = РезультатЗапроса[1].Выбрать();
	
	Если ВыборкаДанныеОбъектаМетаданных.Следующий() Тогда
		
		ПолноеИмяОбъектаМетаданных    = ВыборкаДанныеОбъектаМетаданных.ПолноеИмя;
		СинонимОбъектаМетаданных      = ВыборкаДанныеОбъектаМетаданных.Синоним;
		ОбъектовВБазеВсего            = РаботаСРезультатамиОбмена.КоличествоОбъектовТипаВИнформационнойБазе(ПолноеИмяОбъектаМетаданных);
		ОбъектовВБазеБезСопоставления = 
			РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.КоличествоОбъектовБезСоответствия(ПолноеИмяОбъектаМетаданных, 
			                                                                                                   УзелИнформационнойБазы)
		
	КонецЕсли;
	
	КоличествоОбъектов = 0;
	
	ВыборкаОбъектыДляУстановкиСоответствий = РезультатЗапроса[0].Выбрать();
	
	Пока ВыборкаОбъектыДляУстановкиСоответствий.Следующий() Цикл
		
		ПолученныеДанные = ДанныеОбъектаИзJSON(ВыборкаОбъектыДляУстановкиСоответствий.ДанныеОбъекта.Получить());
		
		Если ПолученныеДанные = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоОбъектов = КоличествоОбъектов + 1;
		
		НоваяСтрокаТаблицыОбъектов = ОбъектыДляУстановкиСоответствий.Добавить();
		
		НоваяСтрокаТаблицыОбъектов.Действие           = Перечисления.ДействияПриУстановкеСоответствийОбъектам.ДействиеНеОпределено;
		НоваяСтрокаТаблицыОбъектов.ПолученныйОбъект   = ВыборкаОбъектыДляУстановкиСоответствий.ПолученныйОбъект;
		НоваяСтрокаТаблицыОбъектов.ПравилоКонвертации = ВыборкаОбъектыДляУстановкиСоответствий.ПравилоКонвертации;
		НоваяСтрокаТаблицыОбъектов.ОбъектФормата      = ВыборкаОбъектыДляУстановкиСоответствий.ОбъектФормата;
		
		ДополнитьПоляПредставления(НоваяСтрокаТаблицыОбъектов, ПолученныеДанные, ОтображаемыеПоля, ВыборкаОбъектыДляУстановкиСоответствий);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьПоляПредставления(СтрокаОбъектКУстановкеСоответствий, ПолученныеДанные, ПоляПредставлений, Выборка)
	
	//@skip-check empty-except-statement
	Попытка
		
		СтрокаОбъектКУстановкеСоответствий.ДанныеЗагружаемогоОбъекта = ОбъектВСтруктуру(ПолученныеДанные);
		
		Для Каждого РеквизитМетаданных Из ПолученныеДанные.Метаданные().СтандартныеРеквизиты Цикл
			
			Если РеквизитМетаданных.Имя = "Ссылка" Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
				ЗначениеВПолученныхДанных = ПолученныеДанные[РеквизитМетаданных.Имя]; 
			Исключение
				
				Продолжить;
				
			КонецПопытки;
			
			Если РеквизитОбъектаМожетБытьДобавленКакПолеПредставления(ЗначениеВПолученныхДанных)
				И ПоляПредставлений.НайтиПоЗначению(РеквизитМетаданных.Имя) = Неопределено Тогда
				
				ПоляПредставлений.Добавить(
					РеквизитМетаданных.Имя, 
					?(ПустаяСтрока(РеквизитМетаданных.Синоним), РеквизитМетаданных.Имя, РеквизитМетаданных.Синоним));
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого РеквизитМетаданных Из ПолученныеДанные.Метаданные().Реквизиты Цикл
			
			Попытка
				
				ЗначениеВПолученныхДанных = ПолученныеДанные[РеквизитМетаданных.Имя];
				
			Исключение
				
				Продолжить;
				
			КонецПопытки;
			
			Если РеквизитОбъектаМожетБытьДобавленКакПолеПредставления(ЗначениеВПолученныхДанных)
				И ПоляПредставлений.НайтиПоЗначению(РеквизитМетаданных.Имя) = Неопределено Тогда
				
				ПоляПредставлений.Добавить(
					РеквизитМетаданных.Имя, 
					?(ПустаяСтрока(РеквизитМетаданных.Синоним), РеквизитМетаданных.Имя, РеквизитМетаданных.Синоним));
				
			КонецЕсли;
			
		КонецЦикла;
		
	Исключение
	
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция РеквизитОбъектаМожетБытьДобавленКакПолеПредставления(ЗначениеРеквизита)

	Если (ТипЗнч(ЗначениеРеквизита) = Тип("Строка")
			И Не ПустаяСтрока(ЗначениеРеквизита))
		Или ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ЗначениеРеквизита))
		Или (ТипЗнч(ЗначениеРеквизита) = Тип("Число"))  Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ОбъектВСтруктуру(ПолученныеДанные)

	ДанныеСтруктурой = Новый Структура;
	
	Для Каждого РеквизитМетаданных Из ПолученныеДанные.Метаданные().СтандартныеРеквизиты Цикл 
		
		ДанныеСтруктурой.Вставить(РеквизитМетаданных.Имя, ПолученныеДанные[РеквизитМетаданных.Имя]);
		
	КонецЦикла;
	
	Для Каждого РеквизитМетаданных Из ПолученныеДанные.Метаданные().Реквизиты Цикл
		
		ДанныеСтруктурой.Вставить(РеквизитМетаданных.Имя, ПолученныеДанные[РеквизитМетаданных.Имя]);
		
	КонецЦикла;
	
	Возврат ДанныеСтруктурой;
	
КонецФункции

&НаСервере
Функция ДанныеОбъектаИзJSON(ДанныеОбъектаТекстJSON)
	
	ПолученныеДанные = Неопределено;
	
	Если ДанныеОбъектаТекстJSON <> Неопределено Тогда
		
		ПотокВПамяти = Новый ПотокВПамяти;
		
		ЗаписьТекста = Новый ЗаписьТекста(ПотокВПамяти, "UTF8");
		
		ЗаписьТекста.Записать(ДанныеОбъектаТекстJSON);
		
		ЗаписьТекста.Закрыть();
		
		ПотокВПамяти.Перейти(0, ПозицияВПотоке.Начало);
		
		ЧтениеJSON = Новый ЧтениеJSON;
		
		ЧтениеJSON.ОткрытьПоток(ПотокВПамяти, "UTF8");
		
		ПолученныеДанные = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
		
		ЧтениеJSON.Закрыть();
		
	КонецЕсли;
	
	Возврат ПолученныеДанные;
	
КонецФункции

&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()

	Если Не ЕстьЛиХотьОдноВыбранноеЗначениеВСпискеЗначение(ОтображаемыеПоля) Тогда
		
		УстановитЗначениеПоУмолчаниюДляПолейПредставления(ОтображаемыеПоля);
		
	КонецЕсли;
	
	Если ПоляПоиска.Количество() = 0 Тогда
		
		Для Каждого ЭлементСписка Из ОтображаемыеПоля Цикл
			
			Если ЭлементСписка.Пометка Тогда
				
				ПоляПоиска.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление, ЭлементСписка.Пометка);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитЗначениеПоУмолчаниюДляПолейПредставления(ПоляПредставления)
	
	Если ПоляПредставления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъектаМетаданных); 
	
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЭтоСправочник(ОбъектМетаданных) Тогда
		
		Для Каждого ПолеВводаПоСтроке Из ОбъектМетаданных.ВводПоСтроке Цикл
			
			НайденноеДоступноеПоле = ПоляПредставления.НайтиПоЗначению(ПолеВводаПоСтроке.Имя);
			
			Если НайденноеДоступноеПоле <> Неопределено Тогда
				НайденноеДоступноеПоле.Пометка = Истина;
			КонецЕсли;
			
		КонецЦикла; 
		
		Если Не ЕстьЛиХотьОдноВыбранноеЗначениеВСпискеЗначение(ПоляПредставления) Тогда
			
			ПоляПредставления.Получить(0).Пометка = Истина;
			
		КонецЕсли;
		
	ИначеЕсли ОбщегоНазначения.ЭтоДокумент(ОбъектМетаданных) Тогда
		
		ПоляДокументаПоУмолчанию = Новый Массив;
		ПоляДокументаПоУмолчанию.Добавить("Номер");
		ПоляДокументаПоУмолчанию.Добавить("Дата");
		
		Для Каждого ПолеДокумента Из ПоляДокументаПоУмолчанию Цикл
			
			НайденноеДоступноеПоле = ПоляПредставления.НайтиПоЗначению(ПолеДокумента);
			
			Если НайденноеДоступноеПоле <> Неопределено Тогда
				НайденноеДоступноеПоле.Пометка = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ЕстьЛиХотьОдноВыбранноеЗначениеВСпискеЗначение(ПоляПредставления) Тогда
			
			ПоляПредставления.Получить(0).Пометка = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗаполненнымДанным()

	ОтразитьИзменениеСоставаОтображаемыхПолей(ЭтотОбъект);
	
	СформироватьЗаголовокОтображаемыеРеквизитыПанели(ЭтотОбъект);
	
	ОбновитьЗаголовкиФормыСИтогами(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЛишниеНастройки(Настройки)

	ИменаУдаляемыхНастроек = Новый Массив;
	ИменаУдаляемыхНастроек.Добавить("ОтображаемыеПоля");
	ИменаУдаляемыхНастроек.Добавить("ПоляПоиска");
	ИменаУдаляемыхНастроек.Добавить("ОтображаемыеРеквизитыПанели");
	ИменаУдаляемыхНастроек.Добавить("ИсторияОтображаемыхПолей");
	ИменаУдаляемыхНастроек.Добавить("ИсторияОтборов");
	ИменаУдаляемыхНастроек.Добавить("ИсторияОтбораОбъектовИБ");
	ИменаУдаляемыхНастроек.Добавить("ИсторияПолейПоиска");
	ИменаУдаляемыхНастроек.Добавить("ИсторияПоискаСоответствий");
	ИменаУдаляемыхНастроек.Добавить("НастройкиКомпоновкиДанныхОтбораЗагружаемыхОбъектов");
	ИменаУдаляемыхНастроек.Добавить("НастройкиКомпоновкиДанныхОтбораОбъектовИБ");
	
	Для Каждого ИмяУдаляемойНастройки Из ИменаУдаляемыхНастроек Цикл
		
		Если Настройки.Получить(ИмяУдаляемойНастройки) <> Неопределено Тогда
			Настройки.Удалить(ИмяУдаляемойНастройки);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ПанельРеквизитов

&НаСервере
Процедура ЗаполнитьВыборРеквизитовДляПанели()
	
	ОтображаемыеРеквизитыПанели.Очистить();
	
	ДобавитьОтображаемыеРеквизитыПоПолямПоиска();
	
	Если ОтображаемыеРеквизитыПанели.Количество() > 15 Тогда
		
		Элементы.ОтображаемыеРеквизитыПанели.ВысотаВСтрокахТаблицы = 15;
		
	Иначе
		
		Элементы.ОтображаемыеРеквизитыПанели.ВысотаВСтрокахТаблицы = ОтображаемыеРеквизитыПанели.Количество();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОтображаемыеРеквизитыПоПолямПоиска()
	
	ПропускаемыеИменаРеквизитов = Новый Массив;
	ПропускаемыеИменаРеквизитов.Добавить("ИмяПредопределенныхДанных");
	ПропускаемыеИменаРеквизитов.Добавить("Ссылка");
	
	УжеДобавленныеИменаРеквизитов = Новый Массив;
	
	Для Каждого СтрокаРеквизитДляПоиска Из ОтображаемыеПоля Цикл
	
		ЭлементСпискаПанельРеквизитов = ОтображаемыеРеквизитыПанели.Добавить();
		ЭлементСпискаПанельРеквизитов.Пометка        = Истина;
		ЭлементСпискаПанельРеквизитов.Представление  = СтрокаРеквизитДляПоиска.Представление;
		ЭлементСпискаПанельРеквизитов.Значение       = СтрокаРеквизитДляПоиска.Значение;
		
		УжеДобавленныеИменаРеквизитов.Добавить(ЭлементСпискаПанельРеквизитов.Значение);
	
	КонецЦикла;
	
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
	
	Для Каждого СтандартныйРеквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
		
		Если УжеДобавленныеИменаРеквизитов.Найти(СтандартныйРеквизит.Имя) <> Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если ПропускаемыеИменаРеквизитов.Найти(СтандартныйРеквизит.Имя) <> Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ЭлементСпискаПанельРеквизитов = ОтображаемыеРеквизитыПанели.Добавить();
		ЭлементСпискаПанельРеквизитов.Пометка         = Истина;
		ЭлементСпискаПанельРеквизитов.Представление   = ?(ПустаяСтрока(СтандартныйРеквизит.Синоним), СтандартныйРеквизит.Имя, СтандартныйРеквизит.Синоним);
		ЭлементСпискаПанельРеквизитов.Значение        = СтандартныйРеквизит.Имя ;
		
	КонецЦикла;
	
	Для Каждого РеквизитОбъекта Из МетаданныеОбъекта.Реквизиты Цикл
		
		Если УжеДобавленныеИменаРеквизитов.Найти(РеквизитОбъекта.Имя) <> Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если ПропускаемыеИменаРеквизитов.Найти(РеквизитОбъекта.Имя) <> Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ЭлементСпискаПанельРеквизитов = ОтображаемыеРеквизитыПанели.Добавить();
		ЭлементСпискаПанельРеквизитов.Пометка        = Истина;
		ЭлементСпискаПанельРеквизитов.Представление  = ?(ПустаяСтрока(РеквизитОбъекта.Синоним), РеквизитОбъекта.Имя, РеквизитОбъекта.Синоним);
		ЭлементСпискаПанельРеквизитов.Значение       = РеквизитОбъекта.Имя;
		
	КонецЦикла;
	
	ОтображаемыеРеквизитыПанели.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьЗаголовокОтображаемыеРеквизитыПанели(Форма)
	
	Элементы = Форма.Элементы;
	
	КоличествоВыбрано = 0;
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("Выбран", Истина);
	
	Для Каждого ЭлементСписка Из  Форма.ОтображаемыеРеквизитыПанели Цикл
		
		Если ЭлементСписка.Пометка Тогда
			КоличествоВыбрано = КоличествоВыбрано + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ГруппаВыборРеквизитовПанель.Заголовок = СтрШаблон(НСтр("ru = 'Реквизиты для отображения (%1 из %2)'"),
	                                                           КоличествоВыбрано,
	                                                           Форма.ОтображаемыеРеквизитыПанели.Количество());

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФлажкиРеквизитыПанели(УстанавливаемоеЗначение)
	
	Для Каждого СтрокаОтображаемыйРеквизит Из ОтображаемыеРеквизитыПанели Цикл
		
		СтрокаОтображаемыйРеквизит.Пометка = УстанавливаемоеЗначение;
		
	КонецЦикла;
	
	ОбновитьОтображениеОбъектаВПанели();
	
	СформироватьЗаголовокОтображаемыеРеквизитыПанели(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ТаблицаОбъектыДляУстановкиСоответствия

&НаКлиенте
Процедура ПослеАктивизацииСтрокиОбъектыДляУстановкеСоответствий()
	
	УправлениеВидимостьКомандДействий();
	
	ОбновитьОтображениеОбъектаВПанели();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьОтображениеОбъектаВПанели()
	
	РеквизитыОбъекта.Очистить();
	
	ТекущийВыбранныйОбъект = Элементы.ОбъектыДляУстановкиСоответствий.ТекущиеДанные;
	
	Если ТекущийВыбранныйОбъект = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТекущийВыбранныйОбъект.ДанныеЗагружаемогоОбъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из ОтображаемыеРеквизитыПанели Цикл
		
		Если Не ЭлементСписка.Пометка Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если Не ТекущийВыбранныйОбъект.ДанныеЗагружаемогоОбъекта.Свойство(ЭлементСписка.Значение) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = РеквизитыОбъекта.Добавить();
		
		НоваяСтрока.ИмяРеквизита      = ?(ПустаяСтрока(ЭлементСписка.Представление), ЭлементСписка.Значение, ЭлементСписка.Представление);
		НоваяСтрока.ЗначениеРеквизита = ТекущийВыбранныйОбъект.ДанныеЗагружаемогоОбъекта[ЭлементСписка.Значение];
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЕстьЛиХотьОдноВыбранноеЗначениеВСпискеЗначение(Значения)
	
	Для Каждого ЭлементСписка Из Значения Цикл
		
		Если ЭлементСписка.Пометка Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВыбранныеПоляДляОтображения(ДоступныеПоля)
	
	ВыбранныеПоля = Новый Массив;
	
	Для Каждого ЭлементСписка Из ДоступныеПоля Цикл
		
		Если ЭлементСписка.Пометка Тогда
			
			ДанныеВыбранногоПоля = Новый Структура;
			ДанныеВыбранногоПоля.Вставить("Идентификатор", ЭлементСписка.Значение);
			ДанныеВыбранногоПоля.Вставить("ЗаголовокПоля", ЭлементСписка.Представление);
			
			ВыбранныеПоля.Добавить(ДанныеВыбранногоПоля);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВыбранныеПоля;
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаСохранениеНастроек

&НаСервере
Процедура ЗагрузитьСохраненныеНастройкиФормы()

	НастройкиВсехОбъектов = СохраненныеНастройкиФормы();
	
	Если НастройкиВсехОбъектов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиДанногоОбъекта = НастройкиВсехОбъектов.Получить(ИдентификаторОбъектаМетаданных);
	
	Если НастройкиДанногоОбъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьНастройкиВСписокИзМассива(НастройкиДанногоОбъекта, "ОтображаемыеРеквизитыПанели", ОтображаемыеРеквизитыПанели);
	ЗагрузитьНастройкиВСписокИзМассива(НастройкиДанногоОбъекта, "ПоляПредставления",           ОтображаемыеПоля);
	
	ВосстановитьСохраненныеНастройкиСпискаЗначений(НастройкиДанногоОбъекта, "ПоляПоиска",               ПоляПоиска,               Ложь);
	ВосстановитьСохраненныеНастройкиСпискаЗначений(НастройкиДанногоОбъекта, "ИсторияОтображаемыхПолей", ИсторияОтображаемыхПолей, Ложь);
	ВосстановитьСохраненныеНастройкиСпискаЗначений(НастройкиДанногоОбъекта, "ИсторияПолейПоиска",       ИсторияПолейПоиска,       Ложь);
	ВосстановитьСохраненныеНастройкиСпискаЗначений(НастройкиДанногоОбъекта, "ИсторияОтборов",           ИсторияОтборов,           Истина);
	ВосстановитьСохраненныеНастройкиСпискаЗначений(НастройкиДанногоОбъекта, "ИсторияОтбораОбъектовИБ",  ИсторияОтбораОбъектовИБ,  Истина);
	
	ВосстановитьСохраненнуюНастройку(НастройкиДанногоОбъекта,
	                                 "НастройкиКомпоновкиДанныхОтбораЗагружаемыхОбъектов",
	                                 НастройкиКомпоновкиДанныхОтбораЗагружаемыхОбъектов);
	ВосстановитьСохраненнуюНастройку(НастройкиДанногоОбъекта,
	                                 "НастройкиКомпоновкиДанныхОтбораОбъектовИБ",
	                                 НастройкиКомпоновкиДанныхОтбораОбъектовИБ);
	ВосстановитьСохраненнуюНастройку(НастройкиДанногоОбъекта,
	                                 "ИсторияПоискаСоответствий", 
	                                 ИсторияПоискаСоответствий);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСохраненнуюНастройку(ВсеСохраненныеНастройки, ИмяНастройки, РеквизитФормы)
	
	СохраненнаяНастройка = ВсеСохраненныеНастройки.Получить(ИмяНастройки);
	Если СохраненнаяНастройка <> Неопределено Тогда
		
		РеквизитФормы = СохраненнаяНастройка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСохраненныеНастройкиСпискаЗначений(ВсеСохраненныеНастройки, ИмяНастройки, СписокФормы, ФормироватьПредставления)
	
	СохраненнаяНастройка = ВсеСохраненныеНастройки.Получить(ИмяНастройки);
	
	Если СохраненнаяНастройка = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СписокФормы.ЗагрузитьЗначения(СохраненнаяНастройка);
	
	Если ФормироватьПредставления Тогда
		
		Для Каждого ЭлементСписка Из СписокФормы Цикл 
			
			Если ТипЗнч(ЭлементСписка.Значение) = Тип("НастройкиКомпоновкиДанных") Тогда
				
				ЭлементСписка.Представление = Строка(ЭлементСПиска.Значение.Отбор);
				
				Если ПустаяСтрока(ЭлементСписка.Представление) Тогда
					
					ЭлементСписка.Представление = НСтр("ru = 'Без отбора'");
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиВСписокИзМассива(ВсеСохраненныеНастройки, ИмяНастройки, СписокФормы)

	СохраненныеНастройки = ВсеСохраненныеНастройки.Получить(ИмяНастройки);
	
	Если СохраненныеНастройки <> Неопределено Тогда
		
		Для Каждого ЭлементСписка Из СписокФормы Цикл
			
			ЭлементСписка.Пометка = (СохраненныеНастройки.Найти(ЭлементСписка.Значение) <> Неопределено);
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СохраненныеНастройкиФормы()
	
	Возврат ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"Обработки.РаботаСРезультатамиОбмена.Форма.УстановкаСоответствий", "НастройкиРаботыПоОбъектам");
	
КонецФункции

&НаСервере
Функция ДанныеСпискаДляСохраненияВНастройках(СписокКСохранению, ПроверятьПометку)
	
	Если СписокКСохранению.Количество() = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	СохраняемыеДанные = Новый Массив;
	
	Для Каждого ЭлементСписка Из СписокКСохранению Цикл
		
		Если Не ПроверятьПометку
			Или ЭлементСписка.Пометка Тогда
			
			СохраняемыеДанные.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ?(СохраняемыеДанные.Количество() > 0, СохраняемыеДанные, Неопределено);
	
КонецФункции

#КонецОбласти

#Область НастройкаПолейПредставления

&НаКлиентеНаСервереБезКонтекста
Процедура ОтразитьИзменениеСоставаОтображаемыхПолей(Форма)
	
	Элементы = Форма.Элементы;
	
	ВыбранныеПоляДляОтображения = ВыбранныеПоляДляОтображения(Форма.ОтображаемыеПоля);
	
	КоличествоВыбранныхПолей = ВыбранныеПоляДляОтображения.Количество();
	
	Для Инд = 1 По 5 Цикл
		
		ИмяРеквизита = "ОбъектыДляУстановкиСоответствийРеквизит" + Строка(Инд);
		
		Если Инд <= КоличествоВыбранныхПолей Тогда
		
			Элементы[ИмяРеквизита].Видимость = Истина; 
			Элементы[ИмяРеквизита].Заголовок = ВыбранныеПоляДляОтображения[Инд - 1].ЗаголовокПоля;
			
		Иначе
			
			Элементы[ИмяРеквизита].Видимость = Ложь;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Для Каждого СтрокаОбъекта Из Форма.ОбъектыДляУстановкиСоответствий Цикл
		
		ЗаполнитьПоляПредставленияПоВыбраннымПолям(СтрокаОбъекта, ВыбранныеПоляДляОтображения);
		
	КонецЦикла;
	
	ДобавитьДанныеОтображаемыхПолейВИсторию(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПоляПредставленияПоВыбраннымПолям(СтрокаТаблицыОбъектыДляУстановкиСоответствий, ВыбранныеПоляПредставлений)
	
	ИндексВМассиве = 0;
	
	Если СтрокаТаблицыОбъектыДляУстановкиСоответствий.ДанныеЗагружаемогоОбъекта = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого ВыбранноеПоле Из ВыбранныеПоляПредставлений Цикл
		
		Если ИндексВМассиве = 5 Тогда
			Прервать;
		КонецЕсли;
			
		СтрокаТаблицыОбъектыДляУстановкиСоответствий["ЗагружаемыйРеквизит" + Строка(ИндексВМассиве + 1)] 
			= СтрокаТаблицыОбъектыДляУстановкиСоответствий.ДанныеЗагружаемогоОбъекта[ВыбранноеПоле.Идентификатор];
			
		ИндексВМассиве = ИндексВМассиве + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиОтображаемыхПолей(ПараметрыОткрытия)
	
	ОповещениеОбИзмененииОтображаемыхПолей = Новый ОписаниеОповещения("ПослеИзмененияОтображаемыхПолей", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ВыборОтображаемыхПолейЗагружаемогоОбъекта", ПараметрыОткрытия, ЭтотОбъект,
	              ,,, ОповещениеОбИзмененииОтображаемыхПолей, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияОтображаемыхПолей(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("СписокЗначений") Тогда
		
		ОтображаемыеПоля = Результат.Скопировать();
		ОтразитьИзменениеСоставаОтображаемыхПолей(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьДанныеОтображаемыхПолейВИсторию(Форма)

	ВыбранныеОтображаемыеПоля = ВыбранныеПоляДляОтображения(Форма.ОтображаемыеПоля);
	
	ЗначенияВыбранныхПолейСтрокой = ЗначенияПолейСтрокой(ВыбранныеОтображаемыеПоля, "Идентификатор");
	
	УжеДобавленВИсторию = Ложь;
	
	Для Каждого СтрокаИстории Из Форма.ИсторияОтображаемыхПолей Цикл
		
		ЗначениеИсторииСтрокой = ЗначенияПолейСтрокой(СтрокаИстории.Значение, "Идентификатор");
		
		Если ЗначениеИсторииСтрокой = ЗначенияВыбранныхПолейСтрокой Тогда
			
			УжеДобавленВИсторию = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не УжеДобавленВИсторию Тогда
		
		Форма.ИсторияОтображаемыхПолей.Вставить(0,ВыбранныеОтображаемыеПоля);
		
		ПривестиИсториюВСоответствииСМаксимальнымРазмером(Форма.ИсторияОтображаемыхПолей);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗначенияПолейСтрокой(ВыбранныеПоля, ИмяПоля)

	ЗначенияПолей = Новый Массив;
	
	Для Каждого ДанныеПоля Из ВыбранныеПоля Цикл
		
		ЗначенияПолей.Добавить(ДанныеПоля[ИмяПоля]);
		
	КонецЦикла;
	
	Возврат СтрСоединить(ЗначенияПолей, ";");

КонецФункции

&НаКлиенте
Процедура ПослеВыбораРанееИспользовавшегосяВариантаПредставления(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("ЭлементСпискаЗначений") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Результат.Значение = - 1 Тогда
		
		ОткрытьФормуНастройкиОтображаемыхПолей(ДополнительныеПараметры.ПараметрыОткрытия);
		
	КонецЕсли;
	
	РаботаСРезультатамиОбменаКлиент.ОтразитьИзменениеОтображаемыхПолейПослеВыбораВариантаИзИстории(
		ОтображаемыеПоля, ИсторияОтображаемыхПолей, Результат.Значение);
	
	ОтразитьИзменениеСоставаОтображаемыхПолей(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПривестиИсториюВСоответствииСМаксимальнымРазмером(ИсторическиеДанные, МаксимальныйРазмер = 5)
	
	КоличествоИсторическихДанных = ИсторическиеДанные.Количество();
	
	Если КоличествоИсторическихДанных > МаксимальныйРазмер Тогда
		
		Для Инд = 1 По КоличествоИсторическихДанных - МаксимальныйРазмер Цикл
			
			ИсторическиеДанные.Удалить(КоличествоИсторическихДанных - Инд);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаОтбора

&НаКлиенте
Процедура ОткрытьФормуНастройкиОтбора()
	
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыОткрытия.Вставить("ПолноеИмяТипаМетаданных",  ПолноеИмяОбъектаМетаданных);
	ПараметрыОткрытия.Вставить("ДоступныеПоля",            ОтображаемыеПоля);
	ПараметрыОткрытия.Вставить("СинонимТипаМетаданных",    СинонимОбъектаМетаданных);
	ПараметрыОткрытия.Вставить("НастройкиКомпоновки",      НастройкиКомпоновкиДанныхОтбораЗагружаемыхОбъектов);
	ПараметрыОткрытия.Вставить("ИсторияОтборов",           ИсторияОтборов);
	ПараметрыОткрытия.Вставить("ДляОбъектовИБ",            Ложь);
	ПараметрыОткрытия.Вставить("СниматьПометкиВОтборе",    Ложь);
	
	ОповещениеОбИзмененииОтбора = Новый ОписаниеОповещения("ПослеИзмененияОтбора", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.НастройкаОтбора", ПараметрыОткрытия, ЭтотОбъект,
	              ,,, ОповещениеОбИзмененииОтбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияОтбора(Результат, ДополнительныеПараметры) Экспорт

	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		ИзменитьОтборНаСервере(Результат);
		
		ОбновитьЗаголовкиФормыСИтогами(ЭтотОбъект);
		
	ИначеЕсли ТипЗнч(Результат) = Тип("ЭлементСпискаЗначений") Тогда
		
		Если Результат.Значение = - 1 Тогда
			
			ОткрытьФормуНастройкиОтбора();
			
		Иначе
			
			ДанныеИсторииОтбора = ИсторияОтборов.Получить(Результат.Значение);
			
			ИзменитьОтборНаСервере(ДанныеИсторииОтбора.Значение);
			
			ОбновитьЗаголовкиФормыСИтогами(ЭтотОбъект);
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьОтборНаСервере(Результат)

	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		СхемаИНастройки = ПолучитьИзВременногоХранилища(Результат);
		
		ДобавитьВИсториюОтборов(СхемаИНастройки.Настройки, ИсторияОтборов);
		
		СхемаКомпоновкиОтбораЗагружаемыхОбъектов           = СхемаИНастройки.СхемаКомпоновки;
		НастройкиКомпоновкиДанныхОтбораЗагружаемыхОбъектов = СхемаИНастройки.Настройки;
		
	ИначеЕсли ТипЗнч(Результат) = Тип("НастройкиКомпоновкиДанных") Тогда
		
		СхемаКомпоновкиОтбораЗагружаемыхОбъектов           = СхемаКомпоновкиДанныхДляЗагружаемыхОбъектов();
		НастройкиКомпоновкиДанныхОтбораЗагружаемыхОбъектов = Результат;
		
	ИначеЕсли Результат = Неопределено Тогда
		
		СхемаКомпоновкиОтбораЗагружаемыхОбъектов           = СхемаКомпоновкиДанныхДляЗагружаемыхОбъектов();
		НастройкиКомпоновкиДанныхОтбораЗагружаемыхОбъектов = Неопределено;
		
	КонецЕсли;
	
	Если СхемаКомпоновкиОтбораЗагружаемыхОбъектов = Неопределено
		Или НастройкиКомпоновкиДанныхОтбораЗагружаемыхОбъектов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеКомпоновки = ТекстЗапросаИМакетКомпоновкиПоДаннымСКД(СхемаКомпоновкиОтбораЗагружаемыхОбъектов,
	                                                           НастройкиКомпоновкиДанныхОтбораЗагружаемыхОбъектов,
	                                                           ОтображаемыеПоля,
	                                                          "ЗагружаемыеОбъекты");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ДанныеКомпоновки.ТекстЗапроса;
	
	УстановитьПараметрыЗапроса(Запрос, ДанныеКомпоновки.МакетКомпоновки.ЗначенияПараметров);
	УстановитьТаблицуЗагружаемыхДанныхВЗапрос(Запрос);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТаблицыОбъектов = ОбъектыДляУстановкиСоответствий.НайтиПоИдентификатору(Выборка.ИдентификаторСтроки);
		
		Если СтрокаТаблицыОбъектов <> Неопределено Тогда
			
			СтрокаТаблицыОбъектов.СоответствуетОтбору = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПредставлениеОтбора = Строка(НастройкиКомпоновкиДанныхОтбораЗагружаемыхОбъектов.Отбор);
	
	УстановитьОтборЗагружаемыеОбъекты(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаСервере
Функция СхемаКомпоновкиДанныхДляЗагружаемыхОбъектов()
	
	АдресСхемыКомпоновки = 
			РаботаСРезультатамиОбмена.АдресСхемыКомпоновкиПоДоступнымПолямОбъекта(ПолноеИмяОбъектаМетаданных,
			                                                                      ОтображаемыеПоля,
			                                                                      УникальныйИдентификатор,
			                                                                      Ложь); 
			
	Возврат ПолучитьИзВременногоХранилища(АдресСхемыКомпоновки);
	
КонецФункции

&НаСервере
Процедура ДобавитьВИсториюОтборов(НастройкиКомпоновки, ИсторияОтборов)
	
	ПредставлениеНовогоОтбора = Строка(НастройкиКомпоновки.Отбор);
	
	Если ПустаяСтрока(ПредставлениеНовогоОтбора) Тогда
		ПредставлениеНовогоОтбора = НСтр("ru = 'Без отбора'");
	КонецЕсли;
	
	Для Каждого ДанныеНастройки Из ИсторияОтборов Цикл
		
		Если ДанныеНастройки.Представление = ПредставлениеНовогоОтбора Тогда
			
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ИсторияОтборов.Вставить(0, НастройкиКомпоновки, ПредставлениеНовогоОтбора);
	
	ПривестиИсториюВСоответствииСМаксимальнымРазмером(ИсторияОтборов)
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТаблицуЗагружаемыхДанныхВЗапрос(Запрос)
	
	ТаблицаЗагружаемыхДанных = ПустаяТаблицаПоПолямПредставления(); 
	ДобавитьКолонкиСопоставлениеДействиеКТаблицеЗагружаемыеДанные(ТаблицаЗагружаемыхДанных);
	
	Для Каждого СтрокаТаблицы Из ОбъектыДляУстановкиСоответствий Цикл
		
		НоваяСтрокаТаблицы = ТаблицаЗагружаемыхДанных.Добавить();
		
		НоваяСтрокаТаблицы.ИдентификаторСтроки = СтрокаТаблицы.ПолучитьИдентификатор();
		СтрокаТаблицы.СоответствуетОтбору      = Ложь;
		
		Для Каждого ЭлементСписка Из ОтображаемыеПоля Цикл
			
			НоваяСтрокаТаблицы[ЭлементСписка.Значение] = СтрокаТаблицы.ДанныеЗагружаемогоОбъекта[ЭлементСписка.Значение];
			
		КонецЦикла;
		
		НоваяСтрокаТаблицы.ВыбранноеДействие = СтрокаТаблицы.Действие;
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаЗагружаемыхДанных);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКолонкиСопоставлениеДействиеКТаблицеЗагружаемыеДанные(ТаблицаЗагружаемыхДанных)

	ТаблицаЗагружаемыхДанных.Колонки.Добавить("ВыбранноеДействие",
	                                          Новый ОписаниеТипов("ПеречислениеСсылка.ДействияПриУстановкеСоответствийОбъектам"));

КонецПроцедуры

&НаСервере
Функция ПустаяТаблицаПоПолямПредставления()
	
	ТаблицаЗагружаемыхДанных = Новый ТаблицаЗначений;
	
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
	
	Для Каждого ЭлементСписка Из ОтображаемыеПоля Цикл
		
		МетаданныеРеквизита = МетаданныеОбъекта.Реквизиты.Найти(ЭлементСписка.Значение);
		
		Если МетаданныеРеквизита = Неопределено Тогда
			
			Попытка
				
				МетаданныеРеквизита = МетаданныеОбъекта.СтандартныеРеквизиты[ЭлементСписка.Значение]; 
				
			Исключение
				
				Продолжить;
				
			КонецПопытки;
			
		КонецЕсли;
		
		Если МетаданныеРеквизита = Неопределено Тогда 
			
			Продолжить;
			
		КонецЕсли;
		
		ТаблицаЗагружаемыхДанных.Колонки.Добавить(ЭлементСписка.Значение, МетаданныеРеквизита.Тип);
		
	КонецЦикла;
	
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("ИдентификаторСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(10)); 
	
	Возврат ТаблицаЗагружаемыхДанных;

КонецФункции

&НаСервере
Процедура УстановитьПараметрыЗапроса(Запрос, ЗначенияПараметров)
	
	Для Каждого ДанныеПараметра Из ЗначенияПараметров Цикл
		
		Запрос.УстановитьПараметр(ДанныеПараметра.Имя, ДанныеПараметра.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборЗагружаемыеОбъекты(Форма, ПоОтбору = Ложь, ПоИзменениям = Ложь)
	
	Форма.УстановленОтборПоСоответствующимОтбору = ПоОтбору;
	Форма.УстановленОтборПоИзменениям            = ПоИзменениям;
	
	НастройкаОтбора = Новый Структура;
	
	Если ПоОтбору Тогда
		
		НастройкаОтбора.Вставить("СоответствуетОтбору", Истина);
		
	КонецЕсли;
	
	Если ПоИзменениям Тогда
		
		НастройкаОтбора.Вставить("ЕстьИзменения", Истина);
		
	КонецЕсли;
	
	Форма.Элементы.ОбъектыДляУстановкиСоответствий.ОтборСтрок = Новый ФиксированнаяСтруктура(НастройкаОтбора);
	
КонецПроцедуры

&НаСервере
Процедура ПреобразоватьТекстЗапросаОтборДляЗагружаемыхОбъектов(ТекстЗапросаОтбор)
	
	СтрокаКакТаблицаДанных =  "КАК ТаблицаДанных";
	СтрокаИЗ               =  "ИЗ
	                          |&ТаблицаДанных";
	
	ТекстЗапросаВременнаяТаблица = СтрЗаменить(ТекстЗапросаОтбор, ПолноеИмяОбъектаМетаданных, "&ТаблицаДанных");
	
	ТекстВыбратьДополнительныеКолонки = "ВЫБРАТЬ
	|	ТаблицаДанных.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаДанных.ВыбранноеДействие КАК ВыбранноеДействие,"; 
	
	ТекстЗапросаВременнаяТаблица = СтрЗаменить(ТекстЗапросаВременнаяТаблица, "ВЫБРАТЬ", ТекстВыбратьДополнительныеКолонки); 
	
	ПозицияКакТаблицаДанных      = СтрНайти(ТекстЗапросаВременнаяТаблица, СтрокаКакТаблицаДанных);
	ТекстЗапросаВременнаяТаблица = Лев(ТекстЗапросаВременнаяТаблица, ПозицияКакТаблицаДанных + СтрДлина(СтрокаКакТаблицаДанных)); 
	ТекстЗапросаДоИЗ             = Лев(ТекстЗапросаВременнаяТаблица, ПозицияКакТаблицаДанных - СтрДлина(СтрокаИЗ) - 3);
	ТекстЗапросаПослеНачинаяСИЗ  =  Прав(ТекстЗапросаВременнаяТаблица,
	                                     СтрДлина(ТекстЗапросаВременнаяТаблица) - ПозицияКакТаблицаДанных + СтрДлина(СтрокаИЗ) + 3);
	
	ТекстЗапросаВременнаяТаблица = ТекстЗапросаДоИЗ + "
		|ПОМЕСТИТЬ ТаблицаДанных
		|" 
		+ ТекстЗапросаПослеНачинаяСИЗ;
	
	ТекстЗапросаВыборка = СтрЗаменить(ТекстЗапросаОтбор, ПолноеИмяОбъектаМетаданных, "ТаблицаДанных");
	ТекстЗапросаВыборка = СтрЗаменить(ТекстЗапросаВыборка, "ВЫБРАТЬ", ТекстВыбратьДополнительныеКолонки);
	ТекстЗапросаВыборка = СтрЗаменить(ТекстЗапросаВыборка, 
	                                  "ЗНАЧЕНИЕ(Перечисление.ДействияПриУстановкеСоответствийОбъектам.ПустаяСсылка)",
	                                   "ТаблицаДанных.ВыбранноеДействие");
	
	ТекстЗапросаОтбор =  ТекстЗапросаВременнаяТаблица + ";
	|
	|///////////////////////////////////////////////////////////////
	|
	|" + ТекстЗапросаВыборка;

КонецПроцедуры

&НаСервере
Функция ТекстЗапросаИМакетКомпоновкиПоДаннымСКД(СхемаКомпоновки, НастройкиКомпоновки, ДоступныеПоля, ВариантПреобразованияЗапроса)
	
	Результат = Новый Структура;
	Результат.Вставить("ТекстЗапроса",    "");
	Результат.Вставить("МакетКомпоновки", Неопределено);
	
	Структура = НастройкиКомпоновки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	
	Для Каждого ЭлементСписка Из ДоступныеПоля Цикл
		
		ВыбранноеПоле = Структура.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок = ЭлементСписка.Представление;
		ВыбранноеПоле.Поле      = Новый ПолеКомпоновкиДанных(ЭлементСписка.Значение);
	
	КонецЦикла;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки));

	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновки);
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	Результат.МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, 
	                                                        КомпоновщикНастроек.ПолучитьНастройки(),,,
	                                                        Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	ТекстЗапросаОтбор = Результат.МакетКомпоновки.НаборыДанных.НаборДанных1.Запрос;
	
	Если ВариантПреобразованияЗапроса = "ЗагружаемыеОбъекты" Тогда
		ПреобразоватьТекстЗапросаОтборДляЗагружаемыхОбъектов(ТекстЗапросаОтбор);
	КонецЕсли;
	
	Результат.ТекстЗапроса = ТекстЗапросаОтбор;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область АвтоматическаяУстановкаСоответствий

&НаКлиенте
Процедура ОткрытьФормуУстановкиСоответствий()

	ПараметрыОткрытия = Новый Структура;
	
	ИмяТипаМетаданных = РаботаСРезультатамиОбменаКлиентСервер.ИмяТипаМетаданныхПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
	
	ПараметрыОткрытия.Вставить("ТекстДля",                           РаботаСРезультатамиОбменаКлиентСервер.ТекстДляПоИмениОбъектаМетаданных(ИмяТипаМетаданных));
	ПараметрыОткрытия.Вставить("ДоступныеПоляПоиска",                ОтображаемыеПоля);
	ПараметрыОткрытия.Вставить("ПоляПоиска",                         ПоляПоиска);
	ПараметрыОткрытия.Вставить("ИсторияПолейПоиска",                 ИсторияПолейПоиска);
	ПараметрыОткрытия.Вставить("ПредставлениеТипаМетаданных",        СинонимОбъектаМетаданных);
	ПараметрыОткрытия.Вставить("ПолноеИмяОбъектаМетаданных",         ПолноеИмяОбъектаМетаданных);
	ПараметрыОткрытия.Вставить("НастройкиКомпоновкиДанных",          НастройкиКомпоновкиДанныхОтбораОбъектовИБ);
	ПараметрыОткрытия.Вставить("ИсторияОтбораОбъектовИБ",            ИсторияОтбораОбъектовИБ);
	ПараметрыОткрытия.Вставить("ИдентификаторФормыВладельца",        УникальныйИдентификатор);
	
	ОповещениеОбИзмененииОтбора = Новый ОписаниеОповещения("ПослеИзмененияНастройкиПоискаСопоставления", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.АвтоматическаяУстановкаСоответствий", ПараметрыОткрытия, ЭтотОбъект,
	              ,,, ОповещениеОбИзмененииОтбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияНастройкиПоискаСопоставления(Результат, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ПоляПоиска = Результат.ПоляПоиска.Скопировать();
		Результат.Вставить("НастройкиКомпоновкиОтбораОбъектовИБ", Неопределено);
		
		РезультатВыполнения = РезультатВыполненияУстановкиСоответствийНаСервере(Результат);
		
	ИначеЕсли ТипЗнч(Результат) = Тип("ЭлементСпискаЗначений") Тогда
		
		Если Результат.Значение = -1 Тогда
			
			ОткрытьФормуУстановкиСоответствий();
			Возврат;
			
		КонецЕсли;
		
		ПоляПоиска = Результат.Значение.ПоляПоиска;
		
		Результат.Значение.Вставить("АдресДанныхОтбора", Неопределено);
		РезультатВыполнения = РезультатВыполненияУстановкиСоответствийНаСервере(Результат.Значение);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	КоличествоУстановлено = 0;
	
	Если РезультатВыполнения.Успешно Тогда
		
		Для Каждого КлючИЗначение Из РезультатВыполнения.НайденныеСоответствия Цикл
			
			СтрокаТаблицы = ОбъектыДляУстановкиСоответствий.НайтиПоИдентификатору(КлючИЗначение.Ключ);
			
			Если СтрокаТаблицы <> Неопределено Тогда
				
				СтрокаТаблицы.СоответствиеВИБ         = КлючИЗначение.Значение;
				СтрокаТаблицы.Действие                = ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.УстановитьСоответствиеИЗагрузить");
				СтрокаТаблицы.СоответствиеУстановлено = Истина;
				СтрокаТаблицы.ЕстьИзменения           = Истина;
				КоличествоУстановлено                 = КоличествоУстановлено + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатВыполнения.ТекстОшибки,,"ОбъектыДляУстановкиСоответствий");
		Возврат;
		
	КонецЕсли;
	
	ЗаголовокОповещения = НСтр("ru = 'Установка соответствий'");
	
	Если КоличествоУстановлено = 0 Тогда
		
		ТекстОповещения = НСтр("ru = 'Ни одно соответствие не установлено'");
		
	Иначе
		
		ОбновитьЗаголовкиФормыСИтогами(ЭтотОбъект);
		ИзменитьОтборНаСервере(Неопределено);
		
		ТекстОповещения = СтрШаблон(НСтр("ru = 'Установлено соответствие для загружаемых объектов - %1'"), КоличествоУстановлено);
		
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(ЗаголовокОповещения,, ТекстОповещения, БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

&НаСервере
Функция РезультатВыполненияУстановкиСоответствийНаСервере(НастройкиПоиска)
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("Успешно",               Истина);
	РезультатВыполнения.Вставить("ТекстОшибки",           "");
	РезультатВыполнения.Вставить("НайденныеСоответствия", Новый Соответствие);
	
	ТаблицаЗагружаемыхОбъектовКПоиску = ТаблицаЗагружаемыхОбъектовКПоиску(НастройкиПоиска.ПоляПоиска, НастройкиПоиска.ОбластьПоиска);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ЗагружаемыеДанные",      ТаблицаЗагружаемыхОбъектовКПоиску);
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", УзелИнформационнойБазы);
	
	ДополнитьЗапросУстановкиСоответствий(Запрос, НастройкиПоиска);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		РезультатВыполнения.НайденныеСоответствия.Вставить(Выборка.ИдентификаторСтроки, Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаСервере
Процедура ДополнитьЗапросУстановкиСоответствий(Запрос, НастройкиПоиска)
	
	ТекстЗапросаЗагружаемыеОбъекты = ТекстЗапросаВременнаяТаблицаЗагружаемыхОбъектов(НастройкиПоиска.ПоляПоиска);
	
	ТекстЗапросаПоискСоответствий = ТекстЗапросаПоискСоответствий(НастройкиПоиска,
	                                                              Запрос.Параметры);
	
	ТекстЗапроса = ТекстЗапросаЗагружаемыеОбъекты + ТекстЗапросаПоискСоответствий;
	
	Если НастройкиПоиска.ОбластьПоиска = "ИсключатьУжеСопоставленные" Тогда
		
		ТекстОтборУжеСопоставленныеОбъектыИБВЭтойФорме = Символы.ПС + " И НайденныеСоответствия.СсылкаНаОбъектИБ Не В (&УжеСопоставленныеВДаннойФорме)";
		
		ТекстЗапроса = ТекстЗапроса + ТекстОтборУжеСопоставленныеОбъектыИБВЭтойФорме;
		
		Запрос.УстановитьПараметр("УжеСопоставленныеВДаннойФорме", УжеСопоставленныеВДаннойФорме());
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
КонецПроцедуры

&НаСервере
Функция УжеСопоставленныеВДаннойФорме()
	
	УжеСопоставленные = Новый Массив;
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("СоответствиеУстановлено", Истина);
	
	НайденныеСтроки = ОбъектыДляУстановкиСоответствий.НайтиСтроки(ПараметрыПоиска);

	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		
		УжеСопоставленные.Добавить(НайденнаяСтрока.СоответствиеВИБ);
		
	КонецЦикла;
	
	Возврат УжеСопоставленные;
	
КонецФункции

&НаСервере
Функция ТаблицаЗагружаемыхОбъектовКПоиску(ПоляПоиска, ОбластьПоиска)
	
	ПараметрыПоиска = Новый Структура;
	
	Если УстановленОтборПоИзменениям Тогда
		
		ПараметрыПоиска.Вставить("ЕстьИзменения", Истина);
		
	КонецЕсли;
	
	Если УстановленОтборПоСоответствующимОтбору Тогда
		
		ПараметрыПоиска.Вставить("СоответствуетОтбору", Истина);
		
	КонецЕсли;
	
	Если ОбластьПоиска = "ИсключатьУжеСопоставленные" Тогда
		
		ПараметрыПоиска.Вставить("СоответствиеУстановлено", Ложь);
		
	КонецЕсли;
	
	Если ПараметрыПоиска.Количество() > 0 Тогда
		СтрокиПоОбластьПоиска = ОбъектыДляУстановкиСоответствий.НайтиСтроки(ПараметрыПоиска);
	Иначе
		СтрокиПоОбластьПоиска = ОбъектыДляУстановкиСоответствий;
	КонецЕсли;
	
	ТаблицаЗагружаемыхОбъектовКПоиску = ПустаяТаблицаЗагружаемыхОбъектовКПоиску(ПоляПоиска);
	
	Для Каждого СтрокаОбластьПоиска Из СтрокиПоОбластьПоиска Цикл
		
		НоваяСтрока = ТаблицаЗагружаемыхОбъектовКПоиску.Добавить();
		НоваяСтрока.ИдентификаторСтроки = СтрокаОбластьПоиска.ПолучитьИдентификатор();
		НоваяСтрока.ОбъектФормата       = СтрокаОбластьПоиска.ОбъектФормата;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОбластьПоиска.ДанныеЗагружаемогоОбъекта);
		
	КонецЦикла;
	
	Возврат ТаблицаЗагружаемыхОбъектовКПоиску;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаПоискСоответствий(НастройкиПоиска, ПараметрыЗапроса)
	
	Если ЭтоАдресВременногоХранилища(НастройкиПоиска.АдресДанныхОтбора) Тогда
		
		Возврат ТекстЗапросаПоискСоответствийСОтборомПоОбъектамИБ(НастройкиПоиска, ПараметрыЗапроса);
		
	ИначеЕсли НастройкиПоиска.НастройкиКомпоновкиОтбораОбъектовИБ <> Неопределено Тогда
		
		Возврат ТекстЗапросаПоискСоответствийСОтборомПоОбъектамИБ(НастройкиПоиска, ПараметрыЗапроса);
		
	Иначе
		
		ДобавитьВИсторияПоискаСоответствий(НастройкиПоиска.ПоляПоиска, Неопределено, НастройкиПоиска.ОбластьПоиска);
		Возврат ТекстЗапросаПоискСоответствийБезОтбораПоОбъектамИБ(ПоляПоиска, ""); 
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ДобавитьВИсторияПоискаСоответствий(ПоляПоиска, НастройкиКомпоновкиОтбораОбъектовИБ, ОбластьПоиска)
	
	НастройкаПоиска = Новый Структура;
	НастройкаПоиска.Вставить("ПоляПоиска",                          ПоляПоиска);
	НастройкаПоиска.Вставить("НастройкиКомпоновкиОтбораОбъектовИБ", ОтборНастроекКомпоновки(НастройкиКомпоновкиОтбораОбъектовИБ));
	НастройкаПоиска.Вставить("ОбластьПоиска",                       ОбластьПоиска);
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.CRC32);
	ХешированиеДанных.Добавить(ЗначениеВСтрокуВнутр(НастройкаПоиска)); 
	
	ХешТекущейНастройки = Строка(ХешированиеДанных.ХешСумма);
	
	Для Каждого ЭлементИстории Из ИсторияПоискаСоответствий Цикл
		
		Если ЭлементИстории.Представление = ХешТекущейНастройки Тогда
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	НастройкаПоиска.НастройкиКомпоновкиОтбораОбъектовИБ = НастройкиКомпоновкиОтбораОбъектовИБ;
	
	ИсторияПоискаСоответствий.Вставить(0, НастройкаПоиска, ХешТекущейНастройки); 
	ПривестиИсториюВСоответствииСМаксимальнымРазмером(ИсторияПоискаСоответствий);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОтборНастроекКомпоновки(НастройкиКомпоновкиОтбора)
	
	Если НастройкиКомпоновкиОтбора = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат НастройкиКомпоновкиОтбора.Отбор;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаПоискСоответствийСОтборомПоОбъектамИБ(НастройкиПоиска, ПараметрыЗапроса)
	
	ОбластьПоиска = НастройкиПоиска.ОбластьПоиска;
	
	Если ЭтоАдресВременногоХранилища(НастройкиПоиска.АдресДанныхОтбора) Тогда
		
		ДанныеОтбора = ПолучитьИзВременногоХранилища(НастройкиПоиска.АдресДанныхОтбора);
		
		Если ТипЗнч(ДанныеОтбора) = Тип("НастройкиКомпоновкиДанных") Тогда
			
			СхемаКомпоновки                            = СхемаКомпоновкиОтбораОбъектовИБ();
			НастройкиКомпоновкиДанныхОтбораОбъектовИБ  = ДанныеОтбора;
			
		Иначе
			
			СхемаКомпоновки                            = ДанныеОтбора.СхемаКомпоновки;
			НастройкиКомпоновкиДанныхОтбораОбъектовИБ  = ДанныеОтбора.Настройки;
			
		КонецЕсли;
		
	Иначе
		
		СхемаКомпоновки = СхемаКомпоновкиОтбораОбъектовИБ();
		НастройкиКомпоновкиДанныхОтбораОбъектовИБ = НастройкиПоиска.НастройкиКомпоновкиОтбораОбъектовИБ;
		
	КонецЕсли;
	
	ДобавитьВИсториюОтборов(НастройкиКомпоновкиДанныхОтбораОбъектовИБ, ИсторияОтбораОбъектовИБ);
	ДобавитьВИсторияПоискаСоответствий(ПоляПоиска, НастройкиКомпоновкиДанныхОтбораОбъектовИБ, ОбластьПоиска);
	
	ДанныеКомпоновки = ТекстЗапросаИМакетКомпоновкиПоДаннымСКД(СхемаКомпоновки, 
	                                                           НастройкиКомпоновкиДанныхОтбораОбъектовИБ,
	                                                           НастройкиПоиска.ПоляПоиска, 
	                                                           "ОбъектыИБ");
	
	ТекстЗапросаОтборКомпоновки = ДанныеКомпоновки.ТекстЗапроса;
	
	ПозицияОкончанияГде = СтрНайти(ТекстЗапросаОтборКомпоновки, "ГДЕ", НаправлениеПоиска.СКонца) + 3;
	
	ТекстТребуемыйОтбор = Прав(ТекстЗапросаОтборКомпоновки, СтрДлина(ТекстЗапросаОтборКомпоновки) - ПозицияОкончанияГде);
	ТекстТребуемыйОтбор = СтрЗаменить(ТекстТребуемыйОтбор, "ТаблицаДанных", "ТаблицаОбъектаИБ");
	
	ТекстЗапроса = ТекстЗапросаПоискСоответствийБезОтбораПоОбъектамИБ(НастройкиПоиска.ПоляПоиска, ТекстТребуемыйОтбор);
	
	Для Каждого ПараметрМакета Из ДанныеКомпоновки.МакетКомпоновки.ЗначенияПараметров Цикл
		
		ПараметрыЗапроса.Вставить(ПараметрМакета.Имя, ПараметрМакета.Значение);
		
	КонецЦикла;
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция СхемаКомпоновкиОтбораОбъектовИБ()
	
	АдресСхемыКомпоновки = РаботаСРезультатамиОбмена.АдресСхемыКомпоновкиПоДоступнымПолямОбъекта(
			ПолноеИмяОбъектаМетаданных, ОтображаемыеПоля, УникальныйИдентификатор, Истина);
			
	Возврат ПолучитьИзВременногоХранилища(АдресСхемыКомпоновки);
	
КонецФункции

&НаСервере
Функция ТекстЗапросаПоискСоответствийБезОтбораПоОбъектамИБ(ПоляПоиска, ТекстОтборПоОбъектамИБ)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗагружаемыеДанные.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЗагружаемыеДанные.ОбъектФормата       КАК ОбъектФормата,
	|	ТаблицаОбъектаИБ.Ссылка               КАК СсылкаНаОбъектИБ
	|ПОМЕСТИТЬ НайденныеСоответствия
	|ИЗ
	|	ЗагружаемыеДанные КАК ЗагружаемыеДанные
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИмяТаблицыОбъектаИБ КАК ТаблицаОбъектаИБ
	|		ПО ЗагружаемыеДанные.ИдентификаторСтроки = ТаблицаОбъектаИБ.Ссылка
	|ГДЕ &ТекстТребуемыйОтбор = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ 
	|	НайденныеСоответствия.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	НайденныеСоответствия.СсылкаНаОбъектИБ    КАК Ссылка
	|ИЗ
	|	НайденныеСоответствия КАК НайденныеСоответствия
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторыСинхронизируемыхОбъектов
	|		ПО НайденныеСоответствия.СсылкаНаОбъектИБ = ПубличныеИдентификаторыСинхронизируемыхОбъектов.Ссылка
	|		И ПубличныеИдентификаторыСинхронизируемыхОбъектов.УзелИнформационнойБазы = &УзелИнформационнойБазы
	|		И (ПубличныеИдентификаторыСинхронизируемыхОбъектов.ОбъектФормата = """" 
	|		ИЛИ ПубличныеИдентификаторыСинхронизируемыхОбъектов.ОбъектФормата = НайденныеСоответствия.ОбъектФормата)
	|ГДЕ
	|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Ссылка IS NULL";
	
	ТекстСоединение = "";
	ТребуетсяИ = Ложь;
	Для Каждого ЭлементСписка Из ПоляПоиска Цикл
		
		ТекстСоединение = ТекстСоединение
		                  +"	"
		                  + ?(ТребуетсяИ, "И ", "") 
		                  + СтрШаблон("ЗагружаемыеДанные.%1 = ТаблицаОбъектаИБ.%1" + Символы.ПС, ЭлементСписка.Значение);
		
		ТребуетсяИ = Истина;
		
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяТаблицыОбъектаИБ", ПолноеИмяОбъектаМетаданных);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ГДЕ &ТекстТребуемыйОтбор = ИСТИНА", ?(ПустаяСтрока(ТекстОтборПоОбъектамИБ), "", "ГДЕ" + " " + ТекстОтборПоОбъектамИБ));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗагружаемыеДанные.ИдентификаторСтроки = ТаблицаОбъектаИБ.Ссылка", ТекстСоединение); 
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаВременнаяТаблицаЗагружаемыхОбъектов(ПоляПоиска)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ 
	|	ЗагружаемыеДанные.*,
	|	ЗагружаемыеДанные.ИдентификаторСтроки,
	|	ЗагружаемыеДанные.ОбъектФормата
	|ПОМЕСТИТЬ ЗагружаемыеДанные
	|ИЗ
	|	&ЗагружаемыеДанные КАК ЗагружаемыеДанные
	|;
	|
	|///////////////////////////////////////////////////////";
	
	ТекстВыбранныеПоля = "";
	Для Каждого ЭлементСписка Из ПоляПоиска Цикл
		
		ТекстВыбранныеПоля = ТекстВыбранныеПоля + "
			|" + СтрШаблон("ЗагружаемыеДанные.%1 КАК %1,", ЭлементСписка.Значение);
		
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗагружаемыеДанные.*,", ТекстВыбранныеПоля);
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ПустаяТаблицаЗагружаемыхОбъектовКПоиску(ПоляПоиска)
	
	ТаблицаЗагружаемыхОбъектов = Новый ТаблицаЗначений;
	ТаблицаЗагружаемыхОбъектов.Колонки.Добавить("ИдентификаторСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(5));
	ТаблицаЗагружаемыхОбъектов.Колонки.Добавить("ОбъектФормата",       ОбщегоНазначения.ОписаниеТипаСтрока(100));
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
	
	Для Каждого ЭлементСписка Из ПоляПоиска Цикл
		
		ТипКолонки = ТипРеквизитаОбъекта(ОбъектМетаданных, ЭлементСписка.Значение);
		Если ТипКолонки = Неопределено Тогда
			 Продолжить;
		КонецЕсли;
		
		ТаблицаЗагружаемыхОбъектов.Колонки.Добавить(ЭлементСписка.Значение, ТипКолонки);
		
	КонецЦикла;
	
	Возврат ТаблицаЗагружаемыхОбъектов;
	
КонецФункции

&НаСервере
Функция ТипРеквизитаОбъекта(МетаданныеОбъекта, ИмяРеквизита)
	
	МетаданныеРеквизита = МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита);
	
	Если МетаданныеРеквизита = Неопределено Тогда
		
		Для Каждого ОписаниеСтандартногоРеквизита Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
			
			Если ОписаниеСтандартногоРеквизита.Имя = ИмяРеквизита Тогда
				
				МетаданныеРеквизита = ОписаниеСтандартногоРеквизита;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если МетаданныеРеквизита = Неопределено Тогда
		
		Возврат Неопределено; 
		
	Иначе
		
		Возврат МетаданныеРеквизита.Тип;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция РанееИспользовавшиесяНастройкиПоискаСоответствий()
	
	РанееИспользовавшиесяНастройки = Новый СписокЗначений;
	
	Для Каждого ЭлементСписка Из ИсторияПоискаСоответствий Цикл
		
		РанееИспользовавшиесяНастройки.Добавить(ЭлементСписка.Значение, ПредставлениеНастройкиИсторииПоискаСопоставлений(ЭлементСписка.Значение));
		
	КонецЦикла;
	
	Возврат РанееИспользовавшиесяНастройки;
	
КонецФункции

&НаКлиенте
Функция ПредставлениеНастройкиИсторииПоискаСопоставлений(ДанныеНастройки)
	
	ПредставлениеНастройки ="";
	
	ПоляИсторическогоВарианта = Новый Массив;
	
	Для Каждого ИсторическиеДанные Из ДанныеНастройки.ПоляПоиска  Цикл
		
		ПоляИсторическогоВарианта.Добавить(ИсторическиеДанные.Представление);
		
	КонецЦикла;
	
	ПредставлениеНастройки = СтрСоединить(ПоляИсторическогоВарианта, "; ");
	
	Если ДанныеНастройки.НастройкиКомпоновкиОтбораОбъектовИБ <> Неопределено Тогда
		
		ПредставлениеОтбораНастройки = Строка(ДанныеНастройки.НастройкиКомпоновкиОтбораОбъектовИБ.Отбор);
		
		Если Не ПустаяСтрока(ПредставлениеОтбораНастройки) Тогда
			
			ПредставлениеНастройки = СтрШаблон(НСтр("ru = 'Поиск: %1 , Отбор: %2'"), ПредставлениеНастройки, ПредставлениеОтбораНастройки);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПредставлениеНастройки;

КонецФункции

#КонецОбласти

#Область РучноеИзменениеСоответствияИБ

&НаКлиенте
Процедура ПослеРучногоВыбораСоответствияИБ(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные              = ДополнительныеПараметры.ТекущиеДанные;
	ИдентификаторТекущейСтроки = ТекущиеДанные.ПолучитьИдентификатор();
	
	РезультатПроверкиВыбранногоСоответствия = РезультатПроверкиВыбранногоСоответствия(Результат, ИдентификаторТекущейСтроки);
	
	Если ДополнительныеПараметры.Действие = "ВопросЕслиСоответствиеЕсть" Тогда
		
		Если РезультатПроверкиВыбранногоСоответствия.ИдентификаторСтрокиУстановленоСоответствиеЭтаФорма <> - 1 Тогда
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ВыбранныйОбъект",                         Результат);
			ДополнительныеПараметры.Вставить("ТекущиеДанные",                           ТекущиеДанные);
			ДополнительныеПараметры.Вставить("ИдентификаторСтрокиОчиститьСоответствие", РезультатПроверкиВыбранногоСоответствия.ИдентификаторСтрокиУстановленоСоответствиеЭтаФорма);
			
			ОповещениеПослеПодтвержденияИзмененияСоответствия = Новый ОписаниеОповещения("ПослеПодтвержденияИзмененияСоответствия", ЭтотОбъект, ДополнительныеПараметры); 
			
			ТекстВопроса = НСтр("ru = 'Данный объект уже установлен как соответствие загружаемому объекту в этой форме. Данное соответствие будет очищено. Продолжить?'");
			
			ПоказатьВопрос(ОповещениеПослеПодтвержденияИзмененияСоответствия, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
			Возврат; 
			
		ИначеЕсли РезультатПроверкиВыбранногоСоответствия.УжеСопоставленныеИдентификаторы.Количество() > 0 Тогда
			
			РаботаСРезультатамиОбменаКлиент.ОткрытьФормуСоответствиеУжеУстановлено(ЭтотОбъект,
			                                                                       Результат,
			                                                                       РезультатПроверкиВыбранногоСоответствия.УжеСопоставленныеИдентификаторы,
			                                                                       ДополнительныеПараметры.ТекущиеДанные,
			                                                                       УзелИнформационнойБазы,
			                                                                       ТекущиеДанные);
			
		Иначе
			
			ОтразитьУстановленноеСоответствие(Результат, ТекущиеДанные);
			
		КонецЕсли;
		
	ИначеЕсли ДополнительныеПараметры.Действие = "УстановитьСоответствие" Тогда
		
		ОтразитьУстановленноеСоответствие(Результат, ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьУстановленноеСоответствие(ВыбранныйОбъект, ТекущиеДанные)
	
	УстановитьСоответствиеВИБ(ТекущиеДанные, ВыбранныйОбъект);
	
	ОбновитьЗаголовкиФормыСИтогами(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияИзмененияСоответствия(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСоответствиеВИБ(ДополнительныеПараметры.ТекущиеДанные, Результат.ВыбранныйОбъект);
	
	СтрокаНужноОтменитьСоответствие = ОбъектыДляУстановкиСоответствий.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтрокиУстановленоСоответствиеЭтаФорма);
	
	Если СтрокаНужноОтменитьСоответствие <> Неопределено Тогда
		
		СтрокаНужноОтменитьСоответствие.СоответствиеВИБ         = Неопределено;
		СтрокаНужноОтменитьСоответствие.СоответствиеУстановлено = Ложь;
		СтрокаНужноОтменитьСоответствие.Действие                = ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.ДействиеНеОпределено");
		
	КонецЕсли;
	
	ОбновитьЗаголовкиФормыСИтогами(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСоответствиеВИБ(ТекущиеДанные, ВыбранныйОбъект)
	
	ТекущееДействие = ТекущиеДанные.Действие;
	
	ТекущиеДанные.СоответствиеВИБ         = ВыбранныйОбъект;
	ТекущиеДанные.СоответствиеУстановлено = Истина;
	
	Если ТекущееДействие = ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.СоздатьНовый")
		Или ТекущееДействие = ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.ДействиеНеОпределено") Тогда
		
		ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.УстановитьСоответствиеИЗагрузить"); 
		ОпределитьИзменениеСтрокиСопоставленныеОбъекты(ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция РезультатПроверкиВыбранногоСоответствия(ВыбранныйОбъект, ИдентификаторСтроки)
	
	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("УжеСопоставленныеИдентификаторы",                               Ложь);
	РезультатПроверки.Вставить("ИдентификаторСтрокиУстановленоСоответствиеЭтаФорма", - 1);
	
	ДанныеПроверкиПИСО = Новый Структура;
	ДанныеПроверкиПИСО.Вставить("УзелИнформационнойБазы", УзелИнформационнойБазы);
	ДанныеПроверкиПИСО.Вставить("Ссылка",                 ВыбранныйОбъект);
	
	РезультатПроверки.УжеСопоставленныеИдентификаторы =
		РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ПубличныеИдентификаторыПриложенияСоответствующиеСсылке(ДанныеПроверкиПИСО);

	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("СоответствиеВИБ", ВыбранныйОбъект);
	
	НайденныеСтроки = ОбъектыДляУстановкиСоответствий.НайтиСтроки(ПараметрыПоиска);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		РезультатПроверки.ИдентификаторСтрокиУстановленоСоответствиеЭтаФорма = НайденныеСтроки[0].ПолучитьИдентификатор();
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

#КонецОбласти

#Область УправлениеЭлементамиФормы

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностью(Форма)

	Элементы = Форма.Элементы;
	
	Если Форма.ПанельРеквизитовСкрыта Тогда
		
		Элементы.ПоказатьПанель.Видимость  = Истина;
		Элементы.СкрытьПанель.Видимость    = Ложь;
		Элементы.ГруппаРеквизиты.Видимость = Ложь;
		
	Иначе
		
		Элементы.ПоказатьПанель.Видимость   = Ложь;
		Элементы.СкрытьПанель.Видимость     = Истина;
		Элементы.ГруппаРеквизиты.Видимость  = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЗаголовкиФормыСИтогами(Форма)
	
	ПересчитатьИтогиФормы(Форма);
	
	Элементы = Форма.Элементы;
	
	Если Форма.КоличествоИзменения = 0 Тогда
		
		Элементы.ПроверитьИзменения.Заголовок = НСтр("ru = '4.Проверьте изменения'");
		Элементы.ПроверитьИзменения.Доступность = Ложь;
		
		Элементы.ПрименитьИзменения.Заголовок = НСтр("ru = '5.Примените изменения'");
		Элементы.ПрименитьИзменения.Доступность = Ложь;
		
	Иначе
		
		Элементы.ПроверитьИзменения.Заголовок   = СтрШаблон(НСтр("ru = '4.Проверьте изменения (%1)'"), Форма.КоличествоИзменения);
		Элементы.ПроверитьИзменения.Доступность = Истина;
		
		Элементы.ПрименитьИзменения.Заголовок = СтрШаблон(НСтр("ru = '5.Примените изменения (%1)'"), Форма.КоличествоИзменения);
		Элементы.ПрименитьИзменения.Доступность = Истина;
		
	КонецЕсли;
	
	СтрокаПредставлениеОтбора = "";
	СтрокаСнятьОтбор          = "";

	Если Не ПустаяСтрока(Форма.ПредставлениеОтбора) Тогда
		
		СтрокаПредставлениеОтбора = СтрШаблон(НСтр("ru = 'Отбор: ""%1""'"), Форма.ПредставлениеОтбора);
		СтрокаСнятьОтбор          = Новый ФорматированнаяСтрока(НСтр("ru = 'очистить отбор'"),, Форма.ЦветГиперссылки,, "СнятьОтбор");
		СтрокаПредставлениеОтбора = Новый ФорматированнаяСтрока(СтрокаПредставлениеОтбора, " ", СтрокаСнятьОтбор);
		
	Иначе
		
		СтрокаПредставлениеОтбора      = НСтр("ru = 'Отбор не установлен'");
		
	КонецЕсли;
	
	СтрокаПредставлениеОтбора = Новый ФорматированнаяСтрока(СтрокаПредставлениеОтбора,, Форма.ЦветПоясняющийТекст);
	
	Элементы.ПредставлениеОтбора.Заголовок = СтрокаПредставлениеОтбора;
	
	ЗаполнитьИнформационнуюПанель(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьИнформационнуюПанель(Форма)
	
	Элементы    = Форма.Элементы;
	ШрифтЖирный = Форма.ШрифтПолужирный;
	
	ТекстПредставлениеОбъекта = "";
	
	ИмяТипаМетаданных = РаботаСРезультатамиОбменаКлиентСервер.ИмяТипаМетаданныхПоПолномуИмени(Форма.ПолноеИмяОбъектаМетаданных);
	
	ТекстПредставлениеОбъекта = РаботаСРезультатамиОбменаКлиентСервер.ТекстДляПоИмениОбъектаМетаданных(ИмяТипаМетаданных);
	
	ТекстПредставлениеОбъекта = СтрШаблон("%1 ""%2""", ТекстПредставлениеОбъекта, Форма.СинонимОбъектаМетаданных);
	ТекстПредставлениеОбъекта = Новый ФорматированнаяСтрока(ТекстПредставлениеОбъекта, ШрифтЖирный, Форма.ЦветГиперссылки);
	
	ТекстОсталосьОбъектов = СтрШаблон(НСтр("ru = 'Объекты к загрузке без действия %1 из %2.'"), 
	                                  Форма.КоличествоОбъектов - Форма.КоличествоИзменения,
	                                  Форма.КоличествоОбъектов);
	ТекстОсталосьОбъектов = Новый ФорматированнаяСтрока(ТекстОсталосьОбъектов,ШрифтЖирный, Форма.ЦветПоясняющийТекст); 
	
	ТекстПредставлениеОбъекта = Новый ФорматированнаяСтрока(ТекстПредставлениеОбъекта, ". ", ТекстОсталосьОбъектов);
	
	ТекстОбъектыБезСоответствияВИБ = СтрШаблон(НСтр("ru = 'Объектов в ИБ без соответствия %1 из %2.'"), 
	                                          Форма.ОбъектовВБазеБезСопоставления, 
	                                          Форма.ОбъектовВБазеВсего);
	ТекстОбъектыБезСоответствияВИБ = Новый ФорматированнаяСтрока(ТекстОбъектыБезСоответствияВИБ,ШрифтЖирный, Форма.ЦветПоясняющийТекст);
	
	ТекстПредставлениеОбъекта = Новый ФорматированнаяСтрока(ТекстПредставлениеОбъекта, " ", ТекстОбъектыБезСоответствияВИБ);
	
	Если Форма.ОбъектовВБазеБезСопоставления = 0
		И Форма.КоличествоИзменения < Форма.КоличествоОбъектов Тогда
		
		ТекстЗагрузитьКакНовые = Новый ФорматированнаяСтрока(
			НСтр("ru = 'загрузить оставшиеся как новые'"),, Форма.ЦветГиперссылки,, "ЗагрузитьКакНовые");
		ТекстПредставлениеОбъекта = Новый ФорматированнаяСтрока(ТекстПредставлениеОбъекта, " ", ТекстЗагрузитьКакНовые);
		
	КонецЕсли;
	
	Элементы.ИнформационнаяПанель.Заголовок =  ТекстПредставлениеОбъекта;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
#Область ОбъектыКУстановкеСоответствияДействие
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыДляУстановкиСоответствийДействие.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОбъектыДляУстановкиСоответствий.Действие");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ДействияПриУстановкеСоответствийОбъектам.ДействиеНеОпределено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНедоступногоЭлемента); 
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыДляУстановкиСоответствийДействие.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОбъектыДляУстановкиСоответствий.Действие");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ДействияПриУстановкеСоответствийОбъектам.НеЗагружать;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Лосось);
	
#КонецОбласти

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьИтогиФормы(Форма)
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ЕстьИзменения", Истина);
	
	НайденныеСтроки = Форма.ОбъектыДляУстановкиСоответствий.НайтиСтроки(ПараметрыПоиска);
	
	Форма.КоличествоИзменения = НайденныеСтроки.Количество();
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеДействий

&НаКлиенте
Процедура УстановитьДействиеДляВыделенныхСтрок(Действие)

	ВыделенныеСтроки = Элементы.ОбъектыДляУстановкиСоответствий.ВыделенныеСтроки;
	
	КоличествоСтрокКИзменению = ВыделенныеСтроки.Количество();
	КоличествоСтрокИзменено   = 0;
	
	Для Каждого ИдентификаторВыделеннойСтроки Из ВыделенныеСтроки Цикл
		
		ДанныеСтроки = ОбъектыДляУстановкиСоответствий.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки); 
		
		Если ДанныеСтроки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИзменениеДействияВозможно(ДанныеСтроки, Действие) Тогда
			
			ДанныеСтроки.Действие   = Действие;
			КоличествоСтрокИзменено = КоличествоСтрокИзменено + 1;
			
			Если Действие = ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.ДействиеНеОпределено") 
				И ЗначениеЗаполнено(ДанныеСтроки.СоответствиеВИБ) Тогда
				
				ДанныеСтроки.СоответствиеВИБ         = Неопределено;
				ДанныеСтроки.СоответствиеУстановлено = Ложь;
				
			КонецЕсли;
			
			ОпределитьИзменениеСтрокиСопоставленныеОбъекты(ДанныеСтроки);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если КоличествоСтрокИзменено > 0 Тогда
		
		ТекстОповещения = СтрШаблон(НСтр("ru = 'Изменены действия - %1 из %2'"), 
		                            КоличествоСтрокИзменено, 
		                            КоличествоСтрокКИзменению);
		
		ОбновитьЗаголовкиФормыСИтогами(ЭтотОбъект);
		
	Иначе
		
		ТекстОповещения = НСтр("ru = 'Ни одно действие не изменено'");
		
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Изменение действий'") ,, ТекстОповещения, БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

&НаКлиенте
Функция ИзменениеДействияВозможно(ДанныеСтроки, НовоеДействие)
	
	Если ДанныеСтроки.Действие = НовоеДействие Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НовоеДействие = ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.УстановитьСоответствиеИЗагрузить")
		Или НовоеДействие = ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.УстановитьСоответствиеНоНеЗагружать") Тогда
		
		Возврат ЗначениеЗаполнено(ДанныеСтроки.СоответствиеВИБ);
		
	ИначеЕсли НовоеДействие = ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.СоздатьНовый")
		Или НовоеДействие = ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.НеЗагружать") Тогда
		
		Возврат Не ЗначениеЗаполнено(ДанныеСтроки.СоответствиеВИБ);
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОпределитьИзменениеСтрокиСопоставленныеОбъекты(ТекущиеДанные)
	
	Если ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.ДействиеНеОпределено") Тогда
		
		ТекущиеДанные.ЕстьИзменения = Ложь;
		
	Иначе
		
		ТекущиеДанные.ЕстьИзменения = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияЗагрузитьКакНовые(Результат, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Результат.ЗагрузитьОставшиесяКакНовые Тогда
		
		ОтметитьЗагрузитьОставшиесяКакНовые();
		
		Если Результат.НеПоказыватьБольше Тогда
			
			НеПоказыватьЗагрузитьОставшиесяКакНовые = Результат.НеПоказыватьБольше;
			
		КонецЕсли;
		
		Если Результат.ПрименитьИзменения Тогда
			
			ПрименитьИзменения(Неопределено)
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьЗагрузитьОставшиесяКакНовые()
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ЕстьИзменения", Ложь);
	
	НайденныеСтроки = ОбъектыДляУстановкиСоответствий.НайтиСтроки(ПараметрыПоиска);
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		
		НайденнаяСтрока.Действие      = ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.СоздатьНовый");
		НайденнаяСтрока.ЕстьИзменения = Истина;
		
	КонецЦикла;
	
	ОбновитьЗаголовкиФормыСИтогами(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьКомандДействий()
	
	ВыделенныеСтроки = Элементы.ОбъектыДляУстановкиСоответствий.ВыделенныеСтроки;
	
	ЕстьСопоставленныеСтроки   = Ложь;
	ЕстьНесопоставленныеСтроки = Ложь;
	
	ЕстьНеСоздатьНовый            = Ложь;
	ЕстьНеСопоставитьИЗагрузить   = Ложь;
	ЕстьНеСопоставитьИНеЗагружать = Ложь;
	ЕстьНеНеЗагружать             = Ложь;
	ЕстьНеУстановитьНеопределено  = Ложь;
	
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		
		ДанныеСтроки = ОбъектыДляУстановкиСоответствий.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		Если ДанныеСтроки = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеСтроки.СоответствиеВИБ) Тогда
			ЕстьСопоставленныеСтроки = Истина;
		Иначе
			ЕстьНесопоставленныеСтроки = Истина;
		КонецЕсли;
		
		Если ДанныеСтроки.Действие <> ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.СоздатьНовый") Тогда
			ЕстьНеСоздатьНовый = Истина;
		КонецЕсли;
		
		Если ДанныеСтроки.Действие <> ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.УстановитьСоответствиеИЗагрузить") Тогда
			ЕстьНеСопоставитьИЗагрузить = Истина;
		КонецЕсли;
		
		Если ДанныеСтроки.Действие <> ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.УстановитьСоответствиеНоНеЗагружать") Тогда
			ЕстьНеСопоставитьИНеЗагружать = Истина;
		КонецЕсли;
		
		Если ДанныеСтроки.Действие <> ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.НеЗагружать") Тогда
			ЕстьНеНеЗагружать = Истина;
		КонецЕсли;
		
		Если ДанныеСтроки.Действие <> ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.ДействиеНеОпределено") Тогда
			ЕстьНеУстановитьНеопределено = Истина;
		КонецЕсли;
		
		Если ЕстьСопоставленныеСтроки 
			И ЕстьНесопоставленныеСтроки Тогда
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.СоздатьНовый.Доступность                                               = ЕстьНесопоставленныеСтроки И ЕстьНеСоздатьНовый;
	Элементы.ОбъектыДляУстановкиСоответствийКонтекстноеМенюСоздатьНовый.Доступность = ЕстьНесопоставленныеСтроки И ЕстьНеСоздатьНовый;
	
	Элементы.СопоставитьИЗагрузить.Доступность                                               = ЕстьСопоставленныеСтроки И ЕстьНеСопоставитьИЗагрузить;
	Элементы.ОбъектыДляУстановкиСоответствийКонтекстноеМенюСопоставитьИЗагрузить.Доступность = ЕстьСопоставленныеСтроки И ЕстьНеСопоставитьИЗагрузить;
	
	Элементы.СопоставитьНоНеЗагружать.Доступность                                               = ЕстьСопоставленныеСтроки И ЕстьНеСопоставитьИНеЗагружать;
	Элементы.ОбъектыДляУстановкиСоответствийКонтекстноеМенюСопоставитьНоНеЗагружать.Доступность = ЕстьСопоставленныеСтроки И ЕстьНеСопоставитьИНеЗагружать;
	
	Элементы.НеЗагружать.Доступность                                               = (ЕстьСопоставленныеСтроки Или ЕстьНесопоставленныеСтроки) И ЕстьНеНеЗагружать;
	Элементы.ОбъектыДляУстановкиСоответствийКонтекстноеМенюНеЗагружать.Доступность = (ЕстьСопоставленныеСтроки Или ЕстьНесопоставленныеСтроки) И ЕстьНеНеЗагружать;
	
	Элементы.ОчиститьСоответствиеДействиеНеопределено.Доступность                                               = (ЕстьСопоставленныеСтроки Или ЕстьНесопоставленныеСтроки) И ЕстьНеУстановитьНеопределено;
	Элементы.ОбъектыДляУстановкиСоответствийКонтекстноеМенюОчиститьСоответствиеДействиеНеопределено.Доступность = (ЕстьСопоставленныеСтроки Или ЕстьНесопоставленныеСтроки) И ЕстьНеУстановитьНеопределено;
	
КонецПроцедуры

#КонецОбласти

#Область ПрименениеИзменений

&НаКлиенте
Процедура ОткрытьФормуИнформацияПрименениеИзменений()
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Изменения",                 СписокИзмененийДляИнформацииПриПрименении());
	ПараметрыОткрытия.Вставить("ПолноеИмяОбъектаМетаданных",ПолноеИмяОбъектаМетаданных);
	ПараметрыОткрытия.Вставить("СинонимТипаМетаданных",     СинонимОбъектаМетаданных);
	
	ОповещениеПодтвержденияПримененияИзменений = Новый ОписаниеОповещения("ПослеПодтвержденияПримененияИзменения", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ИнформацияПриПримененииИзменений", ПараметрыОткрытия, ЭтотОбъект,,,,
	             ОповещениеПодтвержденияПримененияИзменений, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияПримененияИзменения(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.НеПоказыватьБольше Тогда
		
		НеПоказыватьПодтверждениеИзменений = Истина;
		
	КонецЕсли;
	
	Если Результат.ПрименитьИзменения Тогда
		
		ПрименитьИзмененияНаКлиенте();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИзмененияНаКлиенте()
	
	ОчиститьСообщения();
	
	РезультатОпределенияДанныхДляПрименения = ДанныеДляПрименения();
	
	Если Не РезультатОпределенияДанныхДляПрименения.Успешно Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатОпределенияДанныхДляПрименения.ТекстОшибки);
		
	КонецЕсли;
	
	РезультатПримененияДействий = РезультатПримененияДействий(РезультатОпределенияДанныхДляПрименения.ДанныеДляПрименения);
	
	Если РезультатПримененияДействий.Ошибки.Количество() > 0 Тогда
		
		Для Каждого ДанныеОшибки Из РезультатПримененияДействий.Ошибки Цикл
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				ДанныеОшибки.ТекстОшибки,,
				"ОбъектыДляУстановкиСоответствий["+ ДанныеОшибки.ИдентификаторСтроки +"]." + ДанныеОшибки.ТипПроблемы);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаголовокОповещения = НСтр("ru = 'Применение действий'");
	
	Если РезультатПримененияДействий.ДействийПрименено > 0 Тогда
		
		ТекстОповещения = СтрШаблон(НСтр("ru = 'Применено действий %1 из %2.'"),
		                            РезультатПримененияДействий.ДействийПрименено,
		                            РезультатПримененияДействий.ДействийКПрименению);
		
		Если РезультатПримененияДействий.СоответствийКУстановке > 0 Тогда
			
			ТекстСоответствия = СтрШаблон(НСтр("ru = 'Установлено соответствий %1 из %2.'"),
			                            РезультатПримененияДействий.УстановленныеСоответствия.Количество(),
			                            РезультатПримененияДействий.СоответствийКУстановке);
			
			ТекстОповещения = ТекстОповещения + Символы.ПС + ТекстСоответствия;
			
		КонецЕсли;
		
		ОбновитьДанныеФормы();
		Оповестить("Запись_ПричинаДобавленияОбъектыКЗагрузке");
		
	Иначе
		
		ТекстОповещения = НСтр("ru = 'Ни одно действие не применено'");
		
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(ЗаголовокОповещения, , ТекстОповещения, БиблиотекаКартинок.Информация32);
	
	ОбработатьРезультатыУстановкиДействийФоновымЗаданием(РезультатПримененияДействий);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатыУстановкиДействийФоновымЗаданием(РезультатПримененияДействий) 
	
	Если РезультатПримененияДействий.ДействийПрименено = 0
		И РезультатПримененияДействий.УстановленныеСоответствия.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;

	ДлительнаяОперация = ДлительнаяОперацияОбработкиУстановкиДействий(
		УникальныйИдентификатор,
		РезультатПримененияДействий);
		
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ОбработатьУстановкуДействийФоновымЗаданиемЗавершение(ДлительнаяОперация, Неопределено);
		
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьУстановкуДействийФоновымЗаданиемЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатПримененияДействий(ДанныеДляПрименения)
	
	Возврат Обработки.РаботаСРезультатамиОбмена.РезультатПримененияДействийФормаУстановкаСоответствий(УзелИнформационнойБазы, ДанныеДляПрименения)
	
КонецФункции

&НаСервере
Функция ДлительнаяОперацияОбработкиУстановкиДействий(УникальныйИдентификатор, РезультатПримененияДействий)
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("УзелИнформационнойБазы",    УзелИнформационнойБазы);
	ПараметрыПроцедуры.Вставить("КлючФоновогоЗадания",       РезультатПримененияДействий.ИдентификаторФоновогоЗадания);
	ПараметрыПроцедуры.Вставить("УстановленныеСоответствия", РезультатПримененияДействий.УстановленныеСоответствия);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.КлючФоновогоЗадания         = РезультатПримененияДействий.ИдентификаторФоновогоЗадания;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обработка действий, установленных пользователем при поиске соответствий объектам'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("Обработки.РаботаСРезультатамиОбмена.ОбработатьПримененныеДействияФормаУстановкиСоответствий",
	                                                       ПараметрыПроцедуры, ПараметрыВыполнения);
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьУстановкуДействийФоновымЗаданиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда 
		ОбработатьЗавершениеОбработкиПримененныхДействий(Результат.АдресРезультата, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗавершениеОбработкиПримененныхДействий(АдресРезультата, ДополнительныеПараметры)
	
	Если ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		РезультатОбработки = ПолучитьИзВременногоХранилища(АдресРезультата)
	КонецЕсли;
	
	Если РезультатОбработки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСРезультатамиОбменаКлиент.ОбработатьРезультатыВыполненияГрупповойКомандыВСпискеПроблем(АдресРезультата);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ЗаполнитьТаблицуОбъектовДляСопоставления();
	
	НастроитьФормуПоЗаполненнымДанным();
	
	УправлениеДоступностью(ЭтотОбъект);
	
	ИзменитьОтборНаСервере(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеДляПрименения()
	
	РезультатПолучения = Новый Структура;
	РезультатПолучения.Вставить("Успешно",                Истина);
	РезультатПолучения.Вставить("ТекстОшибки",            "");
	РезультатПолучения.Вставить("ДанныеДляПрименения",    Новый Структура);
	
	ДанныеСопоставления = Новый Массив;
	ПрименяемыеДействия = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ОбъектыДляУстановкиСоответствий Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.СоответствиеВИБ) Тогда
			
			ДанныеОбъектаДляСопоставления = Новый Структура;
			ДанныеОбъектаДляСопоставления.Вставить("ПолученныйОбъект",    СтрокаТаблицы.ПолученныйОбъект);
			ДанныеОбъектаДляСопоставления.Вставить("ОбъектФормата",       СтрокаТаблицы.ОбъектФормата);
			ДанныеОбъектаДляСопоставления.Вставить("СоответствиеВИБ",     СтрокаТаблицы.СоответствиеВИБ);
			ДанныеОбъектаДляСопоставления.Вставить("ИдентификаторСтроки", СтрокаТаблицы.ПолучитьИдентификатор());
			
			ДанныеСопоставления.Добавить(ДанныеОбъектаДляСопоставления);
			
		КонецЕсли;
		
		Если СтрокаТаблицы.Действие <> ПредопределенноеЗначение("Перечисление.ДействияПриУстановкеСоответствийОбъектам.ДействиеНеОпределено") Тогда
			
			ДействиеПоЗагрузке = Новый Структура;
			ДействиеПоЗагрузке.Вставить("ПолученныйОбъект",    СтрокаТаблицы.ПолученныйОбъект);
			ДействиеПоЗагрузке.Вставить("ПравилоКонвертации",  СтрокаТаблицы.ПравилоКонвертации);
			ДействиеПоЗагрузке.Вставить("ОбъектФормата",       СтрокаТаблицы.ОбъектФормата);
			ДействиеПоЗагрузке.Вставить("Действие",            СтрокаТаблицы.Действие);
			ДействиеПоЗагрузке.Вставить("ИдентификаторСтроки", СтрокаТаблицы.ПолучитьИдентификатор());
			
			ПрименяемыеДействия.Добавить(ДействиеПоЗагрузке);
			
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатПолучения.ДанныеДляПрименения.Вставить("ДанныеСопоставления", ДанныеСопоставления);
	РезультатПолучения.ДанныеДляПрименения.Вставить("ПрименяемыеДействия", ПрименяемыеДействия);
	
	Возврат РезультатПолучения;
	
КонецФункции

&НаКлиенте
Функция СписокИзмененийДляИнформацииПриПрименении()
	
	Изменения = Новый Соответствие;
	
	Для Каждого СтрокаТаблицы Из ОбъектыДляУстановкиСоответствий Цикл
		
		ИнформацияПоДействию = Изменения.Получить(СтрокаТаблицы.Действие);
		
		Если ИнформацияПоДействию = Неопределено Тогда
			
			Изменения.Вставить(СтрокаТаблицы.Действие, 1);
			
		Иначе
			
			Изменения.Вставить(СтрокаТаблицы.Действие, ИнформацияПоДействию + 1);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Изменения;
	
КонецФункции

&НаКлиенте
Процедура ПослеОтветаНаВопросОЗакрытииФормы(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено 
		Или Результат = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ВыполняетсяЗакрытие = Истина;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиФормы

&НаКлиенте
Процедура ПослеИзмененияНастроекФормы(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	НеПоказыватьИсториюУКнопок              = Не Результат.ПоказыватьИсториюУКнопок;
	НеПоказыватьЗагрузитьОставшиесяКакНовые = Не Результат.ПоказыватьПояснениеПередЗагрузкойКакНовые;
	НеПоказыватьПодтверждениеИзменений      = Не Результат.ПоказыватьПодтверждениеИзменений;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

