///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Процедура пакетной записи сообщений в журнал регистрации.
// После записи переменная СобытияДляЖурналаРегистрации очищается.
//
// Для добавления сообщений на клиенте следует использовать процедуру
// ДобавитьСообщениеДляЖурналаРегистрации общего модуля ЖурналРегистрацииКлиент.
//
// Для немедленной записи очереди сообщений с клиента следует использовать процедуру
// ЗаписатьСобытияВЖурналРегистрации общего модуля ЖурналРегистрацииКлиент.
//
// Параметры:
//  СобытияДляЖурналаРегистрации - см. ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации
//
Процедура ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации) Экспорт
	
	ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);
	
КонецПроцедуры

#КонецОбласти
