///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Используется фоновым заданием по применению действий в форме установке соответствий.
// Параметры:
//  ДанныеДляОбработки  - Структура - содержит:
//  * УзелИнформационнойБазы    - ПланОбменаСсылкаИмяПланаОбмена - вид плана обмена, для которого выполняется установка соответствий
//  * ДанныеСопоставления       - Массив из Строка               - содержит идентификаторы объектов и устанавливаемые соответствия
//  * ПрименяемыеДействия       - Массив из Структура             - содержит идентификаторы объектов и применяемые действия.
//  АдресХранилища      - Строка - адрес временного хранилища, в которое будут помещены данные о результатах применения действий.
//
Процедура ОбработатьПримененныеДействияФормаУстановкиСоответствий(ДанныеДляОбработки, АдресХранилища) Экспорт
	
	РезультатОбработки = РезультатОбработкиПримененныхДействийФормаУстановкаСоответствий(ДанныеДляОбработки);
	
	ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);
	
КонецПроцедуры

// Возвращает результат формирования отчета "Данные объекта"
// 
// Параметры:
//  ДанныеПолученногоОбъекта - Структура - содержит:
//   * ПолученныйОбъект   - Строка   - идентификатор полученного объекта
//   * ПравилоКонвертации - Строка - правило конвертации объекта
//   * ОбъектФормата      - Строка - имя объекта формата в пространстве имен.
//   * УзелПланаОбмена    - ПланОбменаСсылкаИмяПланаОбмена - план обмена корреспондент, из которого был получен объект.
//  ВыбранныеРеквизиты - ДанныеФормыДерево - содержит выбранные для отображения реквизиты
// 
// Возвращаемое значение:
//  Структура - Результат формирования отчета данные объекта:
// * Успешно           - Булево            - признак успешного формирования отчета
// * ТабличныйДокумент - ТабличныйДокумент, Неопределено - сформированный отчет
// * ТекстОшибки        - Строка           - текст ошибки, если таковая возникла
//
Функция РезультатФормированияОтчетаДанныеОбъекта(ДанныеПолученногоОбъекта, ВыбранныеРеквизиты) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно",           Истина);
	Результат.Вставить("ТабличныйДокумент", Неопределено);
	Результат.Вставить("ТекстОшибки",       "");
	
	СформироватьОтчетДанныеОбъекта(ДанныеПолученногоОбъекта, ВыбранныеРеквизиты, Результат);
	
	Возврат Результат;
	
КонецФункции

// Возвращает результат формирования отчета "Сравнение полученного объекта с объектом в ИБ"
// 
// Параметры:
//  ДанныеПолученногоОбъекта - Структура - содержит:
//   * ПолученныйОбъект - Строка   - идентификатор полученного объекта
//   * ПравилоКонвертации - Строка - правило конвертации объекта
//   * ОбъектФормата      - Строка - имя объекта формата в пространстве имен.
//   * УзелПланаОбмена    - ПланОбменаСсылкаИмяПланаОбмена - план обмена корреспондент, из которого был получен объект.
//  ВыбранныеРеквизиты - ДанныеФормыДерево - содержит выбранные для отображения реквизиты,
//  ТолькоОтличия      - Булево - признак того, что в отчет должны выводиться только отличия
//  СоответствиеВИБ    - ДокументСсылка, СправочникСсылка, ПланВидовРасчетаСсылка - соответствие полученному объекту в ИБ
// 
// Возвращаемое значение:
//  Структура - Результат формирования отчета данные объекта:
// * Успешно           - Булево            - признак успешного формирования отчета
// * ТабличныйДокумент - ТабличныйДокумент, Неопределено - сформированный отчет
// * ТекстОшибки        - Строка           - текст ошибки, если таковая возникла
//
Функция РезультатФормированияОтчетаСравнениеОбъектов(ДанныеПолученногоОбъекта, ВыбранныеРеквизиты, ТолькоОтличия, СоответствиеВИБ = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно",           Истина);
	Результат.Вставить("ТабличныйДокумент", Неопределено);
	Результат.Вставить("ТекстОшибки",       "");
	
	СформироватьОтчетСравнениеОбъектов(ДанныеПолученногоОбъекта, ВыбранныеРеквизиты, ТолькоОтличия, Результат, СоответствиеВИБ);
	
	Возврат Результат;
	
КонецФункции

// Используется фоновым заданием по формированию отчет ожидает загрузку.
// Параметры:
//  ПараметрыФормирования  - Структура - содержит:
//  * ОбъектКПолучению    - Строка - идентификатор объекта, для которого получаются объекты, загрузку которых он ожидает.
//  * ПравилоКонвертации  - Строка               - правило конвертации объекта, для которого получаются данные
//  * УзелПланаОбмена     - ПланОбменаСсылкаИмяПланаОбмена -             - корреспондент, из которого получены данные.
//  АдресХранилища        - Строка - адрес временного хранилища, в которое будут помещены данные о формировании отчета
//
Процедура ВыполнитьФормированиеОтчетаОжидаетЗагрузку(ПараметрыФормирования, АдресХранилища) Экспорт
	
	РезультатФормирования = РезультатФормированияОтчетаОжидаетЗагрузку(ПараметрыФормирования.ДанныеПолученногоОбъекта, ПараметрыФормирования.ОтображатьЛегенду);
	
	ПоместитьВоВременноеХранилище(РезультатФормирования, АдресХранилища);
	
КонецПроцедуры

// Используется фоновым по получению возможных типов метаданных, в которые может быть конвертирован объект формата.
// Параметры:
//  ДанныеДляПолучения  - Структура - содержит:
//  * УзелИнформационнойБазы    - ПланОбменаСсылкаИмяПланаОбмена - вид плана обмена, для которого получаются данные
//  * ИмяОбъектаФормата         - Строка                          - 
//  АдресХранилища       - Строка - адрес временного хранилища, в которое будут возможные типы
//
Процедура ПолучитьВозможныеТипыОбъектаМетаданных(ДанныеДляПолучения, АдресХранилища) Экспорт
	
	ВозможныеТипыОбъектовМетаданных = ВозможныеТипыОбъектовМетаданныхПоИмениОбъектаФормата(ДанныеДляПолучения.УзелИнформационнойБазы,
	                                                                  ДанныеДляПолучения.ИмяОбъектаФормата);
	
	ПоместитьВоВременноеХранилище(ВозможныеТипыОбъектовМетаданных, АдресХранилища);
	
КонецПроцедуры

// Определяет возможные типы объектов метаданных по имени объекта формата.
// 
// Параметры:
//  УзелКорреспондента - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, из которого получены данные
//  ИмяОбъектаФормата  - Строка -
// 
// Возвращаемое значение:
//  Массив Из Тип - Возможные типы объектов метаданных по имени объекта формата
//
Функция ВозможныеТипыОбъектовМетаданныхПоИмениОбъектаФормата(УзелКорреспондента, ИмяОбъектаФормата) Экспорт
	
	КомпонентыОбмена = Новый Структура;
	КомпонентыОбмена.Вставить("УзелКорреспондента", УзелКорреспондента);
	
	Возврат КонвертацияОбъектноСлужебный.ВозможныеТипыМетаданныхПриКонвертацииОбъектаXDTO(КомпонентыОбмена, ИмяОбъектаФормата);
	
КонецФункции

Процедура ВыполнитьАнализДоступныхДляЗагрузкиДокументов(ДанныеДляОбработки, АдресХранилища) Экспорт
	
	РезультатАнализа = РезультатАнализаДоступныхДляЗагрузкиДокументов(ДанныеДляОбработки);
	
	ПоместитьВоВременноеХранилище(РезультатАнализа, АдресХранилища);
	
КонецПроцедуры

Процедура ОтменаПроведенияДокументовДляПоследующейЗагрузки(ДанныеДляОбработки, АдресХранилища) Экспорт
	
	РезультатОтмены = РезультатОтменыПроведенияДокументов(ДанныеДляОбработки);
	
	ПоместитьВоВременноеХранилище(РезультатОтмены, АдресХранилища);
	
КонецПроцедуры

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ВыполнитьФормированиеОтчетаОжидаетЗагрузку", Истина);
	Методы.Вставить("ПолучитьВозможныеТипыОбъектаМетаданных", Истина);
	Методы.Вставить("ОтменаПроведенияДокументовДляПоследующейЗагрузки", Истина);
	Методы.Вставить("ВыполнитьАнализДоступныхДляЗагрузкиДокументов", Истина);
	Методы.Вставить("ОбработатьПримененныеДействияФормаУстановкиСоответствий", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОтменаПроведенияДокументов

Функция РезультатОтменыПроведенияДокументов(ДанныеДляОбработки)
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("Успешно",              Истина);
	РезультатОбработки.Вставить("ТекстыОшибок",         Новый Массив);
	РезультатОбработки.Вставить("РезультатОтмены",      Неопределено);
	
	Для Каждого ДанныеДокумента Из ДанныеДляОбработки.ДокументыКОтменеПроведения Цикл
		
		Попытка
		
			ДокументОбъект = ДанныеДокумента.СсылкаНаОбъект.ПолучитьОбъект();
			
			Если ДокументОбъект.Проведен Тогда
				
				ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ДанныеДокумента.Проведен = Ложь;
				
			Иначе
				
				ДанныеДокумента.Проведен = Ложь;
				
			КонецЕсли;
		
		Исключение
			
			ДанныеДокумента.Проведен = Ложь;
			РезультатОбработки.ТекстыОшибок.Добавить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			Продолжить;
			
		КонецПопытки;
		
	КонецЦикла;
	
	РезультатОбработки.РезультатОтмены = ДанныеДляОбработки.ДокументыКОтменеПроведения;
	
	Возврат РезультатОбработки;
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаНеЗагруженныхДокументовСОшибкойПроведения

Функция РезультатАнализаДоступныхДляЗагрузкиДокументов(ДанныеДляОбработки)
	
	РезультатАнализа = Новый Структура;
	РезультатАнализа.Вставить("Успешно",              Истина);
	РезультатАнализа.Вставить("ТекстыОшибок",         Новый Массив);
	РезультатАнализа.Вставить("ДокументыКЗагрузке",   Неопределено);
	
	УзелИнформационнойБазы = ДанныеДляОбработки.УзелИнформационнойБазы;
	
	Если Не ЗначениеЗаполнено(УзелИнформационнойБазы) Тогда
		Возврат РезультатАнализа;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыКЗагрузке.ПолученныйОбъект                       КАК ПолученныйОбъект,
	|	ОбъектыКЗагрузке.ПравилоКонвертации                     КАК ПравилоКонвертации,
	|	ОбъектыКЗагрузке.ОбъектФормата                          КАК ОбъектФормата,
	|	ОбъектыКЗагрузке.СсылкаНаОбъект                         КАК СсылкаНаОбъект,
	|	ОбъектыКЗагрузке.ОбъектМетаданных                       КАК ОбъектМетаданных,
	|	ПрочитанныеДанныеСообщенийОбмена.ДатаОбъектаВИсточнике  КАК ДатаЗагружаемогоДокумента,
	|	ИдентификаторыОбъектовМетаданных.ПолноеИмя              КАК ПолноеИмя
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрочитанныеДанныеСообщенийОбмена КАК ПрочитанныеДанныеСообщенийОбмена
	|		ПО ОбъектыКЗагрузке.ПолученныйОбъект = ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект
	|			И ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена = ОбъектыКЗагрузке.УзелПланаОбмена
	|			И ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата   = ОбъектыКЗагрузке.ОбъектФормата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|		ПО ОбъектыКЗагрузке.ОбъектМетаданных = ИдентификаторыОбъектовМетаданных.Ссылка
	|ГДЕ
	|	ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроведения)
	|	И ОбъектыКЗагрузке.СтатусОбновленияОбъектаВИБ = ЗНАЧЕНИЕ(Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеОбновлен)
	|	И ОбъектыКЗагрузке.УзелПланаОбмена = &УзелИнформационнойБазы"; 
	
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", УзелИнформационнойБазы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат РезультатАнализа;
		
	КонецЕсли;
	
	ТаблицаДокументов = РезультатЗапроса.Выгрузить();
	ТаблицаДокументов.Колонки.Добавить("ДатаДокументаВБазе", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаДокументов.Колонки.Добавить("Проведен",           Новый ОписаниеТипов("Булево"));
	
	ТипыДокументовКЗагрузке = ТипыДокументовКЗагрузке(ТаблицаДокументов);
	
	Если ТипыДокументовКЗагрузке.Количество() = 0 Тогда
		Возврат РезультатАнализа;
	КонецЕсли;
	
	ОпределитьСтатусыПроведенияИДатыДокументов(ТипыДокументовКЗагрузке);
	ДополнитьТаблицуДокументовСтатусамиПроведенияИДатами(ТаблицаДокументов, ТипыДокументовКЗагрузке);
	
	РезультатАнализа.ДокументыКЗагрузке = ТаблицаДокументов;
	
	Возврат РезультатАнализа;
	
КонецФункции

Процедура ДополнитьТаблицуДокументовСтатусамиПроведенияИДатами(ТаблицаДокументов, ТипыДокументовКЗагрузке)
	
	Для Каждого ДанныеТипаДокумента Из ТипыДокументовКЗагрузке Цикл
		
		Для Каждого КлючИЗначение Из ДанныеТипаДокумента.Значение Цикл
			
			ТаблицаДокументов[КлючИЗначение.Значение.ИдентификаторСтроки].Проведен           = КлючИЗначение.Значение.Проведен;
			ТаблицаДокументов[КлючИЗначение.Значение.ИдентификаторСтроки].ДатаДокументаВБазе = КлючИЗначение.Значение.ДатаДокумента;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОпределитьСтатусыПроведенияИДатыДокументов(ТипыДокументовКЗагрузке)
	
	ШаблонЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка   КАК Ссылка,
	|	""&ПолноеИмяДокумента""   КАК ПолноеИмяДокумента,
	|	ТаблицаДокумента.Проведен КАК Проведен,
	|	ТаблицаДокумента.Дата     КАК Дата
	|ИЗ
	|	&ПолноеИмяДокумента КАК ТаблицаДокумента
	|ГДЕ ТаблицаДокумента.Ссылка В (&СсылкиНаДокументы)";
	
	Запрос = Новый Запрос;
	
	ТребуетсяОбъединить = Ложь;
	Инд = 1;
	
	Для Каждого ДанныеТипаДокумента Из ТипыДокументовКЗагрузке Цикл
		
		ТекстПодзапроса = "";
		
		Если ТребуетсяОбъединить Тогда
			
			ТекстПодзапроса = ТекстПодзапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
			
		КонецЕсли;
		
		ТекстПодзапроса  = ТекстПодзапроса + СтрЗаменить(ШаблонЗапроса, "&ПолноеИмяДокумента", ДанныеТипаДокумента.Ключ);
		УсловиеПоСсылкам = "СсылкиНаДокументы" + Строка(Инд);
		ТекстПодзапроса  = СтрЗаменить(ТекстПодзапроса, "&СсылкиНаДокументы", "&" + УсловиеПоСсылкам);
		
		ДокументыТипа = Новый Массив;
		Для Каждого КлючИЗначение Из ДанныеТипаДокумента.Значение Цикл
			
			ДокументыТипа.Добавить(КлючИЗначение.Ключ);
			
		КонецЦикла;
		
		Запрос.УстановитьПараметр(УсловиеПоСсылкам, ДокументыТипа);
		
		Запрос.Текст = Запрос.Текст + ТекстПодзапроса;
		
		ТребуетсяОбъединить = Истина;
		Инд = Инд + 1;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		ДанныеТипаДокумента = ТипыДокументовКЗагрузке.Получить(Выборка.ПолноеИмяДокумента);
		
		Если ДанныеТипаДокумента <> Неопределено Тогда
			
			ДанныеДокумента = ДанныеТипаДокумента.Получить(Выборка.Ссылка);
			
			Если ДанныеДокумента <> Неопределено Тогда
				ДанныеДокумента.Проведен      = Выборка.Проведен;
				ДанныеДокумента.ДатаДокумента = Выборка.Дата;
				ДанныеТипаДокумента.Вставить(Выборка.Ссылка, ДанныеДокумента);
			КонецЕсли;
			
			ТипыДокументовКЗагрузке.Вставить(Выборка.ПолноеИмяДокумента, ДанныеТипаДокумента);
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТипыДокументовКЗагрузке(ТаблицаДокументов)
	
	ТипыДокументов = Новый Соответствие;
	
	Для Каждого СтрокаТаблицыДокументов Из ТаблицаДокументов Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицыДокументов.ПолноеИмя) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеДокументовТипа = ТипыДокументов.Получить(СтрокаТаблицыДокументов.ПолноеИмя);
		Если ДанныеДокументовТипа = Неопределено Тогда
			
			ДанныеДокументовТипа = Новый Соответствие;
			
		КонецЕсли;
		
		ДанныеДокумента = Новый Структура;
		ДанныеДокумента.Вставить("ИдентификаторСтроки", ТаблицаДокументов.Индекс(СтрокаТаблицыДокументов));
		ДанныеДокумента.Вставить("Проведен",            Ложь);
		ДанныеДокумента.Вставить("ДатаДокумента",       Неопределено);
		
		ДанныеДокументовТипа.Вставить(СтрокаТаблицыДокументов.СсылкаНаОбъект, ДанныеДокумента);
		
		ТипыДокументов.Вставить(СтрокаТаблицыДокументов.ПолноеИмя, ДанныеДокументовТипа);
		
	КонецЦикла;
	
	Возврат ТипыДокументов;
	
КонецФункции

#КонецОбласти

#Область ОбработкаПримененныхДействий

Функция РезультатОбработкиПримененныхДействийФормаУстановкаСоответствий(ДанныеДляОбработки)
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("Успешно",              Истина);
	РезультатОбработки.Вставить("Ошибки",               Новый Массив);
	РезультатОбработки.Вставить("НовыеПричины",         Новый Соответствие);
	РезультатОбработки.Вставить("ОповещатьОбИзменении", Ложь);
	
	РаботаСРезультатамиОбмена.ОбработатьУстановкуСоответствияДляМассиваОбъектов(
		ДанныеДляОбработки.УстановленныеСоответствия, 
		ДанныеДляОбработки.КлючФоновогоЗадания,
		ДанныеДляОбработки.УзелИнформационнойБазы);
	
	РезультатУдаления = РаботаСРезультатамиОбмена.РезультатУдаленияЗаписейОтклоненныхПользователемОбъектов(ДанныеДляОбработки.КлючФоновогоЗадания);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РезультатОбработки.Ошибки, РезультатУдаления.Ошибки);
	Если РезультатУдаления.Успешно = Ложь Тогда
		РезультатОбработки.Успешно = Ложь;
		Возврат РезультатОбработки;
	КонецЕсли;
	
	ПараметрыПередачи = РаботаСРезультатамиОбмена.НовыйПараметрыПередачиОбъектовНаЗагрузку();
	
	ПараметрыПередачи.НеПроверятьОсвободившиесяОбъектыПриЗаписиВПИСО = Истина;
	ПараметрыПередачи.ПодтверждениеЗагрузкиВыполнено                 = Истина;
	
	РезультатЗагрузки = РаботаСРезультатамиОбмена.РезультатОбработкиПереданныхНаЗагрузкуОбъектов(ДанныеДляОбработки.УзелИнформационнойБазы,
	                                                                                             ДанныеДляОбработки.КлючФоновогоЗадания, 
	                                                                                             ПараметрыПередачи);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РезультатОбработки.Ошибки, РезультатЗагрузки.Ошибки);
	Если РезультатЗагрузки.Успешно = Ложь Тогда
		РезультатОбработки.Успешно = Ложь;
		Возврат РезультатОбработки;
	КонецЕсли;
	
	РезультатОбработки.НовыеПричины         = РезультатЗагрузки.НовыеПричины;
	РезультатОбработки.ОповещатьОбИзменении = РезультатЗагрузки.НовыеПричины.Количество() > 0;
	
	Возврат РезультатОбработки;
	
КонецФункции

#КонецОбласти

#Область ПрименениеИзмененийУстановкаСоответствий

// Применяет действия, определенные пользователем в форме поиска и установки соответствий.
// 
// Параметры:
//  УзелИнформационнойБазы - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, из которого получены данные
//  ДанныеДляПрименения - Структура - содержит:
//   * ДанныеСопоставления - Массив Из Структура -содержит:
//      ** ПолученныйОбъект    - Строка - идентификатор полученного объекта
//      ** СоответствиеВИБ     - Произвольный - установленное соответствие
//      ** ИдентификаторСтроки - Число - Идентификатор строки в таблице формы
//   * ПрименяемыеДействия - Массив Из Структура -содержит:
//      ** ПолученныйОбъект    - Строка - идентификатор полученного объекта
//      ** ПравилоКонвертации  - Строка - применяемое к полученному объекту правило конвертации
//      ** ОбъектФормата      - Строка - имя объекта формата в пространстве имен.
//      ** Действие            - ПеречислениеСсылка.ДействияПриУстановкеСоответствийОбъектам - выполняемое действие
//      ** ИдентификаторСтроки - Число - Идентификатор строки в таблице формы
// 
// Возвращаемое значение:
//  Структура - Результат применения действий форма установка соответствий:
// * Ошибки - Массив Из Строка   - содержит ошибки, если таковые возникли
// * ДействийПрименено - Число   - количество успешно выполненных действий 
// * ДействийКПрименению - Число - количество действий, которые требуется выполнить
// * СоответствийКУстановке - Число - количество соответствий которое требуется установить
// * УстановленныеСоответствия - Массив Из Строка - идентификаторы объектов, которым было установлено соответствие
// * ИдентификаторФоновогоЗадания - см. РаботаСРезультатамиОбмена.НовыйИдентификаторФоновогоЗадания 
//
Функция РезультатПримененияДействийФормаУстановкаСоответствий(УзелИнформационнойБазы, ДанныеДляПрименения) Экспорт
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("Ошибки" ,                      Новый Массив);
	РезультатВыполнения.Вставить("ДействийПрименено",            0);
	РезультатВыполнения.Вставить("ДействийКПрименению",          0);
	РезультатВыполнения.Вставить("СоответствийКУстановке",       0);
	РезультатВыполнения.Вставить("УстановленныеСоответствия",    Новый Массив);
	РезультатВыполнения.Вставить("ИдентификаторФоновогоЗадания", РаботаСРезультатамиОбмена.НовыйИдентификаторФоновогоЗадания());
	
	РезультатУстановкиСоответствий = РезультатУстановкиСоответствий(ДанныеДляПрименения.ДанныеСопоставления,
	                                                                УзелИнформационнойБазы);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РезультатВыполнения.Ошибки, РезультатУстановкиСоответствий.Ошибки);
	РезультатВыполнения.СоответствийКУстановке     = РезультатУстановкиСоответствий.СоответствийКУстановке;
	РезультатВыполнения.УстановленныеСоответствия  = РезультатУстановкиСоответствий.УстановленныеСоответствия;
	
	РезультатПримененияДействий = РезультатПримененияДействий(РезультатВыполнения.ИдентификаторФоновогоЗадания,
	                                                          ДанныеДляПрименения.ПрименяемыеДействия, 
	                                                          РезультатУстановкиСоответствий.Ошибки,
	                                                          УзелИнформационнойБазы);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РезультатВыполнения.Ошибки, РезультатПримененияДействий.Ошибки);
	РезультатВыполнения.ДействийПрименено   = РезультатПримененияДействий.ДействийПрименено;
	РезультатВыполнения.ДействийКПрименению = РезультатПримененияДействий.ДействийКПрименению;
	
	Возврат РезультатВыполнения;

КонецФункции 

Функция РезультатПримененияДействий(ИдентификаторФоновогоЗадания, ПрименяемыеДействия, ОшибкиУстановкиСоответствий, УзелИнформационнойБазы)
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("Ошибки",              Новый Массив);
	РезультатВыполнения.Вставить("ДействийКПрименению", ПрименяемыеДействия.Количество());
	РезультатВыполнения.Вставить("ДействийПрименено",   0);
	
	ИдентификаторыСтрокЕстьОшибки = Новый Массив;
	Для Каждого ДанныеОшибки Из ОшибкиУстановкиСоответствий Цикл
		
		ИдентификаторыСтрокЕстьОшибки.Добавить(ДанныеОшибки.ИдентификаторСтроки);
		
	КонецЦикла;
	
	Для Каждого ДанныеПрименяемогоДействия Из ПрименяемыеДействия Цикл
		
		Если ИдентификаторыСтрокЕстьОшибки.Найти(ДанныеПрименяемогоДействия.ИдентификаторСтроки) <> Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеИзмененияЗаписиРегистра();
		
		ДанныеЗаписи.ПолученныйОбъект           = ДанныеПрименяемогоДействия.ПолученныйОбъект;
		ДанныеЗаписи.ПравилоКонвертации         = ДанныеПрименяемогоДействия.ПравилоКонвертации;
		ДанныеЗаписи.ОбъектФормата              = ДанныеПрименяемогоДействия.ОбъектФормата;
		ДанныеЗаписи.УзелПланаОбмена            = УзелИнформационнойБазы;
		ДанныеЗаписи.КлючОбрабатывающегоЗадания = ИдентификаторФоновогоЗадания;
		
		Если ДанныеПрименяемогоДействия.Действие = Перечисления.ДействияПриУстановкеСоответствийОбъектам.НеЗагружать
			Или ДанныеПрименяемогоДействия.Действие = Перечисления.ДействияПриУстановкеСоответствийОбъектам.УстановитьСоответствиеНоНеЗагружать Тогда
			
			ДанныеЗаписи.ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ЗагрузкаОтклонена;
			
		ИначеЕсли ДанныеПрименяемогоДействия.Действие = Перечисления.ДействияПриУстановкеСоответствийОбъектам.СоздатьНовый
			Или ДанныеПрименяемогоДействия.Действие = Перечисления.ДействияПриУстановкеСоответствийОбъектам.УстановитьСоответствиеИЗагрузить Тогда
			
			ДанныеЗаписи.ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ГотовоКЗагрузке; 
			
		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
		
			РегистрыСведений.ОбъектыКЗагрузке.ИзменитьЗаписьРегистра(ДанныеЗаписи);
			РезультатВыполнения.ДействийПрименено = РезультатВыполнения.ДействийПрименено + 1;
			ЗафиксироватьТранзакцию();
		
		Исключение
		
			ОтменитьТранзакцию();
			
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось применить действие ""%1"" в строке ""%2"" по причине: %3'"),
			                        Строка(ДанныеПрименяемогоДействия.Действие),
			                        ДанныеПрименяемогоДействия.ИдентификаторСтроки, 
			                        ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ДанныеОшибки = НовыйДанныеОшибкиПримененияДействия();
			ДанныеОшибки.ТекстОшибки         = ТекстОшибки;
			ДанныеОшибки.ИдентификаторСтроки = ДанныеПрименяемогоДействия.ИдентификаторСтроки;
			ДанныеОшибки.ТипПроблемы         = "Действие";
			
			РезультатВыполнения.Ошибки.Добавить(ДанныеОшибки);
		
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция НовыйДанныеОшибкиПримененияДействия()
	
	ДанныеОшибки = Новый Структура;
	ДанныеОшибки.Вставить("ТекстОшибки",         "");
	ДанныеОшибки.Вставить("ИдентификаторСтроки", "");
	ДанныеОшибки.Вставить("ТипПроблемы",         "");
	
	Возврат ДанныеОшибки;
	
КонецФункции

Функция РезультатУстановкиСоответствий(ДанныеДляСопоставления, УзелИнформационнойБазы)

	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("Ошибки",                    Новый Массив);
	РезультатВыполнения.Вставить("СоответствийКУстановке",    ДанныеДляСопоставления.Количество());
	РезультатВыполнения.Вставить("УстановленныеСоответствия", Новый Массив);
	
	Для Каждого ДанныеОбъекта Из ДанныеДляСопоставления Цикл
		
		ДанныеЗаписиПИСО = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.НовыйДанныеЗаписи();
		ДанныеЗаписиПИСО.Идентификатор          = ДанныеОбъекта.ПолученныйОбъект;
		ДанныеЗаписиПИСО.Ссылка                 = ДанныеОбъекта.СоответствиеВИБ;
		ДанныеЗаписиПИСО.ОбъектФормата          = ДанныеОбъекта.ОбъектФормата;
		ДанныеЗаписиПИСО.УзелИнформационнойБазы = УзелИнформационнойБазы;
		
		НачатьТранзакцию();
		
		Попытка
			
			РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ДобавитьЗапись(
				ДанныеЗаписиПИСО,
				Ложь,
				РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ДополнительныеСвойстваНабораЗаписейНеОпределятьИзменениеБлокируемыеОбъекты());
				
			ДанныеУстановленногоСоответствия = Новый Структура;
			ДанныеУстановленногоСоответствия.Вставить("ПолученныйОбъект", ДанныеОбъекта.ПолученныйОбъект);
			ДанныеУстановленногоСоответствия.Вставить("ОбъектФормата",    ДанныеОбъекта.ОбъектФормата);
			РезультатВыполнения.УстановленныеСоответствия.Добавить(ДанныеУстановленногоСоответствия);
			
			ЗафиксироватьТранзакцию();
		
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось установить соответствие для ""%1"" в строке ""%2"" по причине: %3'"),
			                        Строка(ДанныеОбъекта.СоответствиеВИБ),
			                        ДанныеОбъекта.ИдентификаторСтроки, 
			                        ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ДанныеОшибки = НовыйДанныеОшибкиПримененияДействия();
			ДанныеОшибки.ТекстОшибки         = ТекстОшибки;
			ДанныеОшибки.ИдентификаторСтроки = ДанныеОбъекта.ИдентификаторСтроки;
			ДанныеОшибки.ТипПроблемы         = "СоответствиеВИБ";
			
			РезультатВыполнения.Ошибки.Добавить(ДанныеОшибки);
		
		КонецПопытки
		
	КонецЦикла;
	
	Возврат РезультатВыполнения;
	
КонецФункции

#КонецОбласти 

#Область ОтчетДанныеОбъекта

Процедура СформироватьОтчетДанныеОбъекта(ДанныеЗаписиОбъектыКЗагрузке, ВыбранныеРеквизиты, Результат)
	
	ТабличныйДокументОтчета = Новый ТабличныйДокумент;
	
	ДанныеПолученногоОбъекта = РегистрыСведений.ОбъектыКЗагрузке.ДанныеПолученногоОбъекта(ДанныеЗаписиОбъектыКЗагрузке);
	
	ПолученныйОбъект = РаботаСРезультатамиОбмена.ДанныеОбъектаИзJSON(ДанныеПолученногоОбъекта.ПолученныйОбъектJSON);
	
	БлокирующиеРеквизиты = БлокирующиеРеквизитыОбъекта(ПолученныйОбъект, ДанныеЗаписиОбъектыКЗагрузке);
	
	Если ПолученныйОбъект = Неопределено Тогда
		
		Результат.ТабличныйДокумент = ТабличныйДокументОтчета;
		Результат.Успешно           = Ложь;
		Результат.ТекстОшибки       = НСтр("ru = 'Данные полученного объекта отсутствуют или не были успешно конвертированы.'"); 
		Возврат;
		
	КонецЕсли;
	
	Макет = ПолучитьМакет("ДанныеПолученногоОбъекта");
	
	Для Каждого СтрокаГруппировка Из ВыбранныеРеквизиты.ПолучитьЭлементы() Цикл
		
		Если СтрокаГруппировка.Выбран = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаГруппировка.Имя = "РеквизитыШапки"
			Или СтрокаГруппировка.Имя = "Измерения"
			Или СтрокаГруппировка.Имя = "Ресурсы"
			Или СтрокаГруппировка.Имя = "Реквизиты" Тогда
			
			ВывестиОтчетДанныеОбъектаРеквизитыШапки(ТабличныйДокументОтчета, Макет, ПолученныйОбъект, БлокирующиеРеквизиты, СтрокаГруппировка, Результат);
			
		Иначе
			
			ВывестиОтчетДанныеОбъектаРеквизитыТабличнойЧасти(ТабличныйДокументОтчета, Макет, ПолученныйОбъект, СтрокаГруппировка, Результат);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.ТабличныйДокумент = ТабличныйДокументОтчета;
	
КонецПроцедуры

Функция БлокирующиеРеквизитыОбъекта(ПолученныйОбъект, ДанныеЗаписиОбъектыКЗагрузке)
	
	БлокирующиеРеквизиты = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению      КАК ОбъектКПолучению,
	|	ОбъектыБлокирующиеЗагрузку.ИмяРеквизита          КАК ИмяРеквизита,
	|	ОбъектыКЗагрузке.ДанныеСконвертированногоОбъекта КАК ДанныеСконвертированногоОбъекта
	|ИЗ
	|	РегистрСведений.ОбъектыБлокирующиеЗагрузку КАК ОбъектыБлокирующиеЗагрузку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ПО (ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению = ОбъектыКЗагрузке.ПолученныйОбъект
	|				И ОбъектыБлокирующиеЗагрузку.ОбъектФормата = ОбъектыКЗагрузке.ОбъектФормата
	|				И ОбъектыКЗагрузке.УзелПланаОбмена = &УзелПланаОбмена)
	|ГДЕ
	|	ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект = &ПолученныйОбъект
	|	И ОбъектыБлокирующиеЗагрузку.ПравилоКонвертации = &ПравилоКонвертации
	|	И ОбъектыБлокирующиеЗагрузку.ОбъектФормата = &ОбъектФормата
	|	И ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена = &УзелПланаОбмена";
	
	Запрос.УстановитьПараметр("ПолученныйОбъект",   ДанныеЗаписиОбъектыКЗагрузке.ПолученныйОбъект);
	Запрос.УстановитьПараметр("ПравилоКонвертации", ДанныеЗаписиОбъектыКЗагрузке.ПравилоКонвертации);
	Запрос.УстановитьПараметр("УзелПланаОбмена",    ДанныеЗаписиОбъектыКЗагрузке.УзелПланаОбмена);
	Запрос.УстановитьПараметр("ОбъектФормата",      ДанныеЗаписиОбъектыКЗагрузке.ОбъектФормата);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат БлокирующиеРеквизиты;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеРеквизита = Новый Структура;
		ДанныеРеквизита.Вставить("Идентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(150));
		ДанныеРеквизита.Вставить("Представление", ОбщегоНазначения.ОписаниеТипаСтрока(500));
		
		ДанныеРеквизита.Идентификатор = Выборка.ОбъектКПолучению;
		
		Если ТипЗнч(Выборка.ДанныеСконвертированногоОбъекта) = Тип("ХранилищеЗначения") Тогда
			
			БлокирующийОбъект = РаботаСРезультатамиОбмена.ДанныеОбъектаИзJSON(Выборка.ДанныеСконвертированногоОбъекта.Получить());
			
			ДанныеРеквизита.Представление = Строка(БлокирующийОбъект);
			
		КонецЕсли;
		
		БлокирующиеРеквизиты.Вставить(Выборка.ИмяРеквизита, ДанныеРеквизита);
		
	КонецЦикла;
	
	Возврат БлокирующиеРеквизиты;
	
КонецФункции

Процедура ВывестиОтчетДанныеОбъектаРеквизитыШапки(ТабличныйДокументОтчета, Макет, ПолученныйОбъект, БлокирующиеРеквизиты, СтрокаГруппировка, Результат)
	
	МетаданныеПолученногоОбъекта = ПолученныйОбъект.Метаданные();
	ЭтоРегистрСведений           = ОбщегоНазначения.ЭтоРегистрСведений(МетаданныеПолученногоОбъекта);
	
	ВывестиЗаголовокГруппыОтчета(ТабличныйДокументОтчета, Макет, СтрокаГруппировка, ЭтоРегистрСведений);

	Для Каждого СтрокаРеквизит Из СтрокаГруппировка.ПолучитьЭлементы() Цикл
		
		Если СтрокаРеквизит.Выбран = 1 Тогда
			
			ОбластьСтрокаРеквизит = Макет.ПолучитьОбласть("СтрокаРеквизит");
			
			ОбластьСтрокаРеквизит.Параметры.ИмяРеквизита      = СтрокаРеквизит.Представление;
			
			МетаданныеПолученногоОбъекта = ПолученныйОбъект.Метаданные();
			
			Если ЭтоРегистрСведений Тогда
				
				Если ПолученныйОбъект.Количество() > 0 Тогда
					
					ОбластьСтрокаРеквизит.Параметры.ЗначениеРеквизита = ПолученныйОбъект[0][СтрокаРеквизит.Имя]; 
					
				КонецЕсли;
				
			Иначе
				
				ДанныеБлокирующегоРеквизита = БлокирующиеРеквизиты.Получить(СтрокаРеквизит.Имя);
				Если ДанныеБлокирующегоРеквизита = Неопределено Тогда
					ЗначениеРеквизита = ПолученныйОбъект[СтрокаРеквизит.Имя];
				Иначе
					ЗначениеРеквизита = ДанныеБлокирующегоРеквизита.Представление;
				КонецЕсли;
				
				ОбластьСтрокаРеквизит.Параметры.ЗначениеРеквизита = ЗначениеРеквизита; 
				
			КонецЕсли;
			
			ТабличныйДокументОтчета.Вывести(ОбластьСтрокаРеквизит);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиЗаголовокГруппыОтчета(ТабличныйДокументОтчета, Макет, СтрокаГруппировка, ЭтоРегистрСведений)
	
	ОбластьШапкаТабличнаяЧасть = Макет.ПолучитьОбласть("ШапкаРеквизитыОбъекта");
	
	Если ЭтоРегистрСведений Тогда
		
		ОбластьШапкаТабличнаяЧасть.Параметры.Заголовок = СтрокаГруппировка.Представление;
		
	Иначе
		
		ОбластьШапкаТабличнаяЧасть.Параметры.Заголовок = НСтр("ru = 'Реквизиты полученного объекта'");
		
	КонецЕсли;
	
	ТабличныйДокументОтчета.Вывести(ОбластьШапкаТабличнаяЧасть);
	
КонецПроцедуры

Процедура ВывестиЗаголовокТабличнойЧастиОтчета(ТабличныйДокументОтчета, Макет, ПредставлениеГруппы)
	
	ОбластьШапкаТабличнаяЧасть = Макет.ПолучитьОбласть("ШапкаТабличнаяЧасть");
	ОбластьШапкаТабличнаяЧасть.Параметры.ИмяТабличнойЧасти = ПредставлениеГруппы;
	
	ТабличныйДокументОтчета.Вывести(ОбластьШапкаТабличнаяЧасть);
	
КонецПроцедуры

Процедура ВывестиОтчетДанныеОбъектаРеквизитыТабличнойЧасти(ТабличныйДокументОтчета, Макет, ПолученныйОбъект, СтрокаГруппировка, Результат)
	
	ВывестиЗаголовокТабличнойЧастиОтчета(ТабличныйДокументОтчета, Макет, СтрокаГруппировка.Представление);
	
	Если ПолученныйОбъект[СтрокаГруппировка.Имя].Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВывестиОбластьБезПараметров("ОтступТабличнаяЧасть", Макет, ТабличныйДокументОтчета);
	
	Для Каждого СтрокаРеквизит Из СтрокаГруппировка.ПолучитьЭлементы() Цикл
		
		Если СтрокаРеквизит.Выбран = 1 Тогда
			
			ОбластьЯчейкаШапки = Макет.ПолучитьОбласть("ЯчейкаШапкиТабличнойЧасти");
			ОбластьЯчейкаШапки.Параметры.ИмяРеквизита = СтрокаРеквизит.Представление;
			ТабличныйДокументОтчета.Присоединить(ОбластьЯчейкаШапки);
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Если ПолученныйОбъект[СтрокаГруппировка.Имя].Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	
	Для Каждого СтрокаТабличнойЧасти Из ПолученныйОбъект[СтрокаГруппировка.Имя] Цикл
		
		ВывестиОбластьБезПараметров("ОтступТабличнаяЧасть", Макет, ТабличныйДокументОтчета);
		
		Для Каждого СтрокаРеквизит Из СтрокаГруппировка.ПолучитьЭлементы() Цикл
			
			Если СтрокаРеквизит.Выбран = 1 Тогда 
				
				ОбластьЯчейкаСтрокиТабличнойЧасти = Макет.ПолучитьОбласть("ЯчейкаСтрокиТабличнойЧасти");
				ОбластьЯчейкаСтрокиТабличнойЧасти.Параметры.ЗначениеРеквизита = СтрокаТабличнойЧасти[СтрокаРеквизит.Имя];
				ТабличныйДокументОтчета.Присоединить(ОбластьЯчейкаСтрокиТабличнойЧасти);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ВывестиОбластьБезПараметров(ИмяОбласти,Макет,ТабличныйДокументОтчета)
	
	Область = Макет.ПолучитьОбласть(ИмяОбласти);
	ТабличныйДокументОтчета.Вывести(Область);
	
КонецПроцедуры

#КонецОбласти

#Область ОтчетСравнениеОбъектов

Процедура СформироватьОтчетСравнениеОбъектов(ДанныеЗаписиОбъектыКЗагрузке, ВыбранныеРеквизиты, ТолькоОтличия, Результат, СоответствиеВИБ) 
	
	ТабличныйДокументОтчета = Новый ТабличныйДокумент;
	
	ДанныеПолученногоОбъекта = РегистрыСведений.ОбъектыКЗагрузке.ДанныеПолученногоОбъекта(ДанныеЗаписиОбъектыКЗагрузке);
	
	ПолученныйОбъект = РаботаСРезультатамиОбмена.ДанныеОбъектаИзJSON(ДанныеПолученногоОбъекта.ПолученныйОбъектJSON);
	
	БлокирующиеРеквизиты = БлокирующиеРеквизитыОбъекта(ПолученныйОбъект, ДанныеЗаписиОбъектыКЗагрузке);
	
	Если ПолученныйОбъект = Неопределено Тогда
		
		Результат.ТабличныйДокумент = ТабличныйДокументОтчета;
		Результат.Успешно           = Ложь;
		Результат.ТекстОшибки       = НСтр("ru = 'Данные полученного объекта отсутствуют или не были успешно конвертированы.'"); 
		Возврат;
		
	КонецЕсли;
	
	Если СоответствиеВИБ = Неопределено Тогда
		СоответствиеВИБ  = ДанныеПолученногоОбъекта.СоответствиеВИБ; 
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СоответствиеВИБ) Тогда
		Результат.Успешно = Ложь;
		Результат.ТекстОшибки = НСтр("ru = 'Для полученного объект не установлено соответствие с объектом в ИБ'");
		Возврат;
	КонецЕсли;
	
	Макет = ПолучитьМакет("СравнениеОбъектов");
	
	Для Каждого СтрокаГруппировка Из ВыбранныеРеквизиты.ПолучитьЭлементы() Цикл
		
		Если СтрокаГруппировка.Выбран = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаГруппировка.Имя =  "РеквизитыШапки" Тогда
			
			ПараметрыФормирования = Новый Структура;
			ПараметрыФормирования.Вставить("ПолученныйОбъект",     ПолученныйОбъект);
			ПараметрыФормирования.Вставить("БлокирующиеРеквизиты", БлокирующиеРеквизиты);
			ПараметрыФормирования.Вставить("СоответствиеВИБ",      СоответствиеВИБ);
			ПараметрыФормирования.Вставить("ТолькоОтличия",        ТолькоОтличия);
			
			ВывестиОтчетСравнениеОбъектовРеквизитыШапки(ТабличныйДокументОтчета, Макет, ПараметрыФормирования, СтрокаГруппировка, Результат);
			
		Иначе
			
			ВывестиОтчетСравнениеОбъектовРеквизитыТабличнойЧасти(ТабличныйДокументОтчета, Макет, ПолученныйОбъект, СоответствиеВИБ, СтрокаГруппировка, Результат);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.ТабличныйДокумент = ТабличныйДокументОтчета;
	
КонецПроцедуры

Процедура ВывестиОтчетСравнениеОбъектовРеквизитыТабличнойЧасти(ТабличныйДокументОтчета, Макет, ПолученныйОбъект, СоответствиеВИБ, СтрокаГруппировка, Результат)
	
	ОбластьШапкаТабличнаяЧасть = Макет.ПолучитьОбласть("ШапкаТабличнаяЧасть ");
	ОбластьШапкаТабличнаяЧасть.Параметры.ИмяТабличнойЧасти = СтрокаГруппировка.Представление;
	
	ТабличныйДокументОтчета.Вывести(ОбластьШапкаТабличнаяЧасть);
	
	КоличествоСтрокПолученныйОбъект = ПолученныйОбъект[СтрокаГруппировка.Имя].Количество();
	КоличествоСтрокОбъектИБ         = СоответствиеВИБ[СтрокаГруппировка.Имя].Количество(); 
	
	Если КоличествоСтрокПолученныйОбъект = 0 
		И КоличествоСтрокОбъектИБ = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ВывестиОбластьБезПараметров("ОтступШапкаТабличнаяЧасть", Макет, ТабличныйДокументОтчета);
	
	Для Каждого СтрокаРеквизит Из СтрокаГруппировка.ПолучитьЭлементы() Цикл
		
		Если СтрокаРеквизит.Выбран = 1 Тогда 
			
			ОбластьЯчейкаШапки = Макет.ПолучитьОбласть("ЯчейкаШапкиТабличнойЧасти");
			ОбластьЯчейкаШапки.Параметры.ИмяРеквизита = СтрокаРеквизит.Представление;
			ТабличныйДокументОтчета.Присоединить(ОбластьЯчейкаШапки);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокВОтчетеПоТабличнойЧасти = Макс(КоличествоСтрокПолученныйОбъект, КоличествоСтрокОбъектИБ);
	
	Для Инд = 1 По СтрокВОтчетеПоТабличнойЧасти  Цикл
		
		ВывестиОбластьБезПараметров("ОтступСтрокаТабличнойЧасти", Макет, ТабличныйДокументОтчета);
		
		Для Каждого СтрокаРеквизит Из СтрокаГруппировка.ПолучитьЭлементы() Цикл
			
			Если СтрокаРеквизит.Выбран = 1 Тогда 
				
				ЗначениеРеквизитаПолучено = ?(КоличествоСтрокПолученныйОбъект < Инд, Null, ПолученныйОбъект[СтрокаГруппировка.Имя][Инд - 1][СтрокаРеквизит.Имя]);
				ЗначениеРеквизитаОбъектИБ = ?(КоличествоСтрокОбъектИБ < Инд, Null,  СоответствиеВИБ[СтрокаГруппировка.Имя][Инд - 1][СтрокаРеквизит.Имя]);
				
				ЗначенияОтличаются = ЗначениеРеквизитаПолучено <>  ЗначениеРеквизитаОбъектИБ;
				
				ОбластьЯчейкаСтрокиТабличнойЧасти = Макет.ПолучитьОбласть("ЯчейкаТабличнойЧастиПолучено");
				ОбластьЯчейкаСтрокиТабличнойЧасти.Параметры.ЗначениеРеквизитаПолучено = ЗначениеРеквизитаПолучено;
				Если ЗначенияОтличаются Тогда
					ОбластьЯчейки          = ОбластьЯчейкаСтрокиТабличнойЧасти.Области.ЯчейкаТабличнойЧастиПолучено;
					ОбластьЯчейки.ЦветФона = WebЦвета.Розовый;
				КонецЕсли;
				ТабличныйДокументОтчета.Присоединить(ОбластьЯчейкаСтрокиТабличнойЧасти);
				
				ОбластьЯчейкаСтрокиТабличнойЧасти = Макет.ПолучитьОбласть("ЯчейкаТабличнойЧастиОбъектИБ");
				ОбластьЯчейкаСтрокиТабличнойЧасти.Параметры.ЗначениеРеквизитаОбъектИБ = ЗначениеРеквизитаОбъектИБ;
				ТабличныйДокументОтчета.Присоединить(ОбластьЯчейкаСтрокиТабличнойЧасти);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого СтрокаТабличнойЧасти Из ПолученныйОбъект[СтрокаГруппировка.Имя] Цикл
		
		Для Каждого СтрокаРеквизит Из СтрокаГруппировка.ПолучитьЭлементы() Цикл
			
			Если СтрокаРеквизит.Выбран = 1 Тогда
				
				ОбластьЯчейкаСтрокиТабличнойЧасти = Макет.ПолучитьОбласть("ЯчейкаСтрокиТабличнойЧасти");
				ОбластьЯчейкаСтрокиТабличнойЧасти.Параметры.ЗначениеРеквизита = СтрокаТабличнойЧасти[СтрокаРеквизит.Имя];
				ТабличныйДокументОтчета.Присоединить(ОбластьЯчейкаСтрокиТабличнойЧасти);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиОтчетСравнениеОбъектовРеквизитыШапки(ТабличныйДокументОтчета, Макет, ПараметрыФормирования, СтрокаГруппировка, Результат)
	
	ВывестиОбластьБезПараметров("ШапкаРеквизитыОбъекта", Макет, ТабличныйДокументОтчета);
	
	Для Каждого СтрокаРеквизит Из СтрокаГруппировка.ПолучитьЭлементы() Цикл
		
		Если СтрокаРеквизит.Выбран = 1 Тогда
			
			ДанныеБлокирующегоРеквизита = ПараметрыФормирования.БлокирующиеРеквизиты.Получить(СтрокаРеквизит.Имя);
			Если ДанныеБлокирующегоРеквизита = Неопределено Тогда
				ЗначениеПолучено = ПараметрыФормирования.ПолученныйОбъект[СтрокаРеквизит.Имя];
			Иначе
				ЗначениеПолучено = ДанныеБлокирующегоРеквизита.Представление;
			КонецЕсли;
			
			ЗначениеИБ       = ПараметрыФормирования.СоответствиеВИБ[СтрокаРеквизит.Имя];
			
			Если ПараметрыФормирования.ТолькоОтличия 
				И ЗначениеПолучено = ЗначениеИБ Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ОбластьСтрокаРеквизит = Макет.ПолучитьОбласть("СтрокаРеквизит");
			
			ОбластьСтрокаРеквизит.Параметры.ИмяРеквизита     = СтрокаРеквизит.Представление;
			ОбластьСтрокаРеквизит.Параметры.ЗначениеПолучено = ЗначениеПолучено;
			ОбластьСтрокаРеквизит.Параметры.ЗначениеИБ       = ЗначениеИБ;
			
			Если ПараметрыФормирования.ПолученныйОбъект[СтрокаРеквизит.Имя] <> ПараметрыФормирования.СоответствиеВИБ[СтрокаРеквизит.Имя] Тогда
				
				ОбластьЯчейкаРеквизитыШапкиПолучено = ОбластьСтрокаРеквизит.Области.ЯчейкаРеквизитыШапкиПолучено;
				ОбластьЯчейкаРеквизитыШапкиПолучено.ЦветФона = WebЦвета.Розовый;
				
			КонецЕсли;
				
			ТабличныйДокументОтчета.Вывести(ОбластьСтрокаРеквизит);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОтчетОжидаютЗагрузку

// Возвращает результат формирования отчета "Ожидает загрузку объектов"
// 
// Параметры:
//  ДанныеПолученногоОбъекта - Структура - содержит:
//   * ПолученныйОбъект   - Строка   - идентификатор полученного объекта
//   * ПравилоКонвертации - Строка - правило конвертации объекта
//   * ОбъектФормата      - Строка - имя объекта формата в пространстве имен
//   * УзелПланаОбмена - ПланОбменаСсылкаИмяПланаОбмена - узел корреспондента из которого получены данные
//  ОтображатьЛегенду  - Булево - признак необходимости вывода в отчет поясняющей легенды
// 
// Возвращаемое значение:
//  Структура - Результат формирования отчета данные объекта:
// * Успешно           - Булево            - признак успешного формирования отчета
// * ТабличныйДокумент - ТабличныйДокумент, Неопределено - сформированный отчет
// * ТекстОшибки        - Строка           - текст ошибки, если таковая возникла
// 
Функция РезультатФормированияОтчетаОжидаетЗагрузку(ДанныеПолученногоОбъекта, ОтображатьЛегенду)
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно",           Истина);
	Результат.Вставить("ТабличныйДокумент", Неопределено);
	Результат.Вставить("ТекстОшибки",       "");
	
	СформироватьОтчетОжидаютЗагрузку(ДанныеПолученногоОбъекта, Результат, ОтображатьЛегенду);
	
	Возврат Результат;
	
КонецФункции

Процедура СформироватьОтчетОжидаютЗагрузку(ДанныеПолученногоОбъекта, Результат, ОтображатьЛегенду)
	
	ТабличныйДокументОтчета = Новый ТабличныйДокумент;
	
	ДанныеОжидаемыхОбъектов = ДанныеВсехОжидаемыхОбъектов(ДанныеПолученногоОбъекта);
	
	Макет = ПолучитьМакет("ОбъектыКПолучению");
	
	ВывестиНеХватаетВЭтомОбъекте(ТабличныйДокументОтчета, ДанныеОжидаемыхОбъектов, Макет, ОтображатьЛегенду);
	
	Если ДанныеОжидаемыхОбъектов.НеХватаетВЭтомОбъекте <> Неопределено
		И ДанныеОжидаемыхОбъектов.ФактическиБлокируют <> Неопределено Тогда
		
		Если Не ОбщегоНазначения.КоллекцииИдентичны(ДанныеОжидаемыхОбъектов.НеХватаетВЭтомОбъекте.Скопировать(, "ОбъектКПолучению, ПравилоКонвертации"),
			                                        ДанныеОжидаемыхОбъектов.ФактическиБлокируют.Скопировать(, "ОбъектКПолучению, ПравилоКонвертации")) Тогда
			
			ВывестиФактическиБлокируют(ТабличныйДокументОтчета, ДанныеОжидаемыхОбъектов, Макет, ОтображатьЛегенду);
			
			ВывестиПрочиеОбъекты(ТабличныйДокументОтчета, ДанныеОжидаемыхОбъектов, Макет, ОтображатьЛегенду);
			
		КонецЕсли;
	
	КонецЕсли;
	
	Результат.ТабличныйДокумент = ТабличныйДокументОтчета;
	
КонецПроцедуры

Процедура ВывестиПрочиеОбъекты(ТабличныйДокументОтчета, ДанныеОжидаемыхОбъектов, Макет, ОтображатьЛегенду)
	
	Если ДанныеОжидаемыхОбъектов.ПрочиеТребуютПолучения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбластьШапкаГруппыОбъектов = Макет.ПолучитьОбласть("ШапкаГруппыОбъектов");
	ОбластьШапкаГруппыОбъектов.Параметры.ТекстЗаголовка = НСтр("ru = 'Прочие объекты, которые требуются для получения:'");
	ТабличныйДокументОтчета.Вывести(ОбластьШапкаГруппыОбъектов);

	ТабличныйДокументОтчета.НачатьГруппуСтрок("ПрочиеОбъекты");
	
	Если ОтображатьЛегенду Тогда
		
		ТекстЛегенды = НСтр("ru = 'Прочие объекты, которые есть в цепочках объектов, требующих получения, которые не являются ни объектами содержащимися в данном объекте, ни объектами, которые фактически блокируют загрузку.'");
		ВывестиЛегенду(ТабличныйДокументОтчета, Макет, ТекстЛегенды);
		
	КонецЕсли;
	
	ВывестиОбластьБезПараметров("ШапкаТаблицаОбъектов", Макет, ТабличныйДокументОтчета);
	
	Для Каждого СтрокаОбъект Из ДанныеОжидаемыхОбъектов.ПрочиеТребуютПолучения Цикл
		
		ДанныеОжидаемогоОбъекта = Новый Структура;
		ДанныеОжидаемогоОбъекта.Вставить("ПолученныйОбъект",   СтрокаОбъект.ОбъектКПолучению);
		ДанныеОжидаемогоОбъекта.Вставить("ПричинаДобавления",  СтрокаОбъект.ПричинаДобавления);
		ДанныеОжидаемогоОбъекта.Вставить("ПравилоКонвертации", СтрокаОбъект.ПравилоКонвертации);
		ДанныеОжидаемогоОбъекта.Вставить("ОбъектФормата",      СтрокаОбъект.ОбъектФормата);
		ДанныеОжидаемогоОбъекта.Вставить("ПричинаДобавления",  СтрокаОбъект.ПричинаФормаПроблемы);
		
		ОбластьСтрокаРеквизит = Макет.ПолучитьОбласть("СтрокаОбъекты");
		
		ПредставлениеОбъекта = РаботаСРезультатамиОбмена.ПредставлениеИзДанныхСконвертированногоОбъекта(СтрокаОбъект.ДанныеСконвертированногоОбъекта);
		
		ОбластьСтрокаРеквизит.Параметры.ТипОбъекта              = СтрокаОбъект.ОбъектМетаданных;
		ОбластьСтрокаРеквизит.Параметры.Идентификатор           = ?(ПредставлениеОбъекта = Неопределено, СтрокаОбъект.ОбъектКПолучению, ПредставлениеОбъекта);
		ОбластьСтрокаРеквизит.Параметры.Проблема                = СтрокаОбъект.ПричинаДобавления;
		ОбластьСтрокаРеквизит.Параметры.ДатаВозникновения       = СтрокаОбъект.ДатаВозникновения;
		ОбластьСтрокаРеквизит.Параметры.ДанныеОжидаемогоОбъекта = ДанныеОжидаемогоОбъекта;
		
		ТабличныйДокументОтчета.Вывести(ОбластьСтрокаРеквизит);
		
	КонецЦикла;
	
	ТабличныйДокументОтчета.ЗакончитьГруппуСтрок();
	
КонецПроцедуры

Процедура ВывестиФактическиБлокируют(ТабличныйДокументОтчета, ДанныеОжидаемыхОбъектов, Макет, ОтображатьЛегенду)
	
	Если ДанныеОжидаемыхОбъектов.ФактическиБлокируют.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбластьШапкаГруппыОбъектов = Макет.ПолучитьОбласть("ШапкаГруппыОбъектов");
	ОбластьШапкаГруппыОбъектов.Параметры.ТекстЗаголовка = НСтр("ru = 'Объекты, которые фактически блокируют получение:'");
	ТабличныйДокументОтчета.Вывести(ОбластьШапкаГруппыОбъектов);
	
	ТабличныйДокументОтчета.НачатьГруппуСтрок("ФактическиБлокируют");
	
	Если ОтображатьЛегенду Тогда
		
		ТекстЛегенды = НСтр("ru = 'Объекты, которых недостает для загрузки могут в свою очередь тоже ожидать загрузку других объектов, а те нуждаться в других объектах. В данной группе выведены объекты, которые находятся на самом нижнем уровне таких цепочек. Рекомендуется в первую очередь решить проблемы с загрузкой данных объектов'");
		ВывестиЛегенду(ТабличныйДокументОтчета, Макет, ТекстЛегенды);
		
	КонецЕсли;
	
	ВывестиОбластьБезПараметров("ШапкаТаблицаОбъектов", Макет, ТабличныйДокументОтчета);
	
	Для Каждого СтрокаОбъект Из ДанныеОжидаемыхОбъектов.ФактическиБлокируют Цикл
		
		ДанныеОжидаемогоОбъекта = Новый Структура;
		ДанныеОжидаемогоОбъекта.Вставить("ПолученныйОбъект",   СтрокаОбъект.ОбъектКПолучению);
		ДанныеОжидаемогоОбъекта.Вставить("ПричинаДобавления",  СтрокаОбъект.ПричинаДобавления);
		ДанныеОжидаемогоОбъекта.Вставить("ПравилоКонвертации", СтрокаОбъект.ПравилоКонвертации);
		ДанныеОжидаемогоОбъекта.Вставить("ОбъектФормата",      СтрокаОбъект.ОбъектФормата);
		ДанныеОжидаемогоОбъекта.Вставить("ПричинаДляОткрытия", СтрокаОбъект.ПричинаФормаПроблемы);
		
		ОбластьСтрокаРеквизит = Макет.ПолучитьОбласть("СтрокаОбъекты"); 
		
		ПредставлениеОбъекта = РаботаСРезультатамиОбмена.ПредставлениеИзДанныхСконвертированногоОбъекта(СтрокаОбъект.ДанныеСконвертированногоОбъекта);
		
		ОбластьСтрокаРеквизит.Параметры.ТипОбъекта              = СтрокаОбъект.ОбъектМетаданных;
		ОбластьСтрокаРеквизит.Параметры.Идентификатор           = ?(ПредставлениеОбъекта = Неопределено, СтрокаОбъект.ОбъектКПолучению, ПредставлениеОбъекта);
		ОбластьСтрокаРеквизит.Параметры.Проблема                = СтрокаОбъект.ПричинаДобавления;
		ОбластьСтрокаРеквизит.Параметры.ДатаВозникновения       = СтрокаОбъект.ДатаВозникновения;
		ОбластьСтрокаРеквизит.Параметры.ДанныеОжидаемогоОбъекта = ДанныеОжидаемогоОбъекта;
		
		ТабличныйДокументОтчета.Вывести(ОбластьСтрокаРеквизит);
		
	КонецЦикла;
	
	ТабличныйДокументОтчета.ЗакончитьГруппуСтрок();
	
КонецПроцедуры

Процедура ВывестиЛегенду(ТабличныйДокументОтчета, Макет, ТекстЛегенды)
	
	ОбластьЛегенда = Макет.ПолучитьОбласть("Легенда");
	ОбластьЛегенда.Параметры.ТекстЛегенды = ТекстЛегенды;
	
	ТабличныйДокументОтчета.Вывести(ОбластьЛегенда);
	
КонецПроцедуры

Процедура ВывестиНеХватаетВЭтомОбъекте(ТабличныйДокументОтчета, ДанныеОжидаемыхОбъектов, Макет, ОтображатьЛегенду)
	
	ОбластьШапкаГруппыОбъектов = Макет.ПолучитьОбласть("ШапкаГруппыОбъектов");
	ОбластьШапкаГруппыОбъектов.Параметры.ТекстЗаголовка = НСтр("ru = 'Неполученные объекты, содержащиеся в этом объекте:'");
	
	ТабличныйДокументОтчета.Вывести(ОбластьШапкаГруппыОбъектов);
	
	ТабличныйДокументОтчета.НачатьГруппуСтрок("ФактическиБлокируют");
	
	Если ОтображатьЛегенду Тогда
		
		ТекстЛегенды = НСтр("ru = 'Объекты, которые содержатся в полученных данных, но отсутствуют в приложении. Возможно загрузить полученные данные и заполнить отсутствующую информацию вручную'");
		ВывестиЛегенду(ТабличныйДокументОтчета, Макет, ТекстЛегенды);
		
	КонецЕсли;
	
	Если ДанныеОжидаемыхОбъектов.НеХватаетВЭтомОбъекте = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВывестиОбластьБезПараметров("ШапкаТаблицаОбъектов", Макет, ТабличныйДокументОтчета);
	
	Для Каждого СтрокаОбъект Из ДанныеОжидаемыхОбъектов.НеХватаетВЭтомОбъекте Цикл
		
		ДанныеОжидаемогоОбъекта = Новый Структура;
		ДанныеОжидаемогоОбъекта.Вставить("ПолученныйОбъект",   СтрокаОбъект.ОбъектКПолучению);
		ДанныеОжидаемогоОбъекта.Вставить("ПричинаДобавления",  СтрокаОбъект.ПричинаДобавления);
		ДанныеОжидаемогоОбъекта.Вставить("ПравилоКонвертации", СтрокаОбъект.ПравилоКонвертации);
		ДанныеОжидаемогоОбъекта.Вставить("ОбъектФормата",      СтрокаОбъект.ОбъектФормата);
		ДанныеОжидаемогоОбъекта.Вставить("ПричинаДляОткрытия", СтрокаОбъект.ПричинаФормаПроблемы);
		
		ОбластьСтрокаРеквизит = Макет.ПолучитьОбласть("СтрокаОбъекты");
		
		ПредставлениеОбъекта = РаботаСРезультатамиОбмена.ПредставлениеИзДанныхСконвертированногоОбъекта(СтрокаОбъект.ДанныеСконвертированногоОбъекта);
		
		ОбластьСтрокаРеквизит.Параметры.ТипОбъекта              = СтрокаОбъект.ОбъектМетаданных;
		ОбластьСтрокаРеквизит.Параметры.Идентификатор           = ?(ПредставлениеОбъекта = Неопределено, СтрокаОбъект.ОбъектКПолучению, ПредставлениеОбъекта);
		ОбластьСтрокаРеквизит.Параметры.Проблема                = СтрокаОбъект.ПричинаДобавления;
		ОбластьСтрокаРеквизит.Параметры.ДатаВозникновения       = СтрокаОбъект.ДатаВозникновения;
		ОбластьСтрокаРеквизит.Параметры.ДанныеОжидаемогоОбъекта = ДанныеОжидаемогоОбъекта;
		
		ТабличныйДокументОтчета.Вывести(ОбластьСтрокаРеквизит);
		
	КонецЦикла;
	
	ТабличныйДокументОтчета.ЗакончитьГруппуСтрок();
	
КонецПроцедуры

Функция ДанныеВсехОжидаемыхОбъектов(ДанныеПолученногоОбъекта)
	
	Результат = Новый Структура;
	Результат.Вставить("НеХватаетВЭтомОбъекте",  Новый Массив);
	Результат.Вставить("ФактическиБлокируют",    Неопределено);
	Результат.Вставить("ПрочиеТребуютПолучения", Неопределено);
	
	ОбъектыКПолучениюОжидаемых = Новый Массив;
	ОбъектыКПолучениюОжидаемых.Добавить(ДанныеПолученногоОбъекта);
	
	Результат.НеХватаетВЭтомОбъекте = ДанныеОжидаемыхОбъектовДляМассиваОбъектов(ОбъектыКПолучениюОжидаемых);
	
	Если Результат.НеХватаетВЭтомОбъекте <> Неопределено Тогда
	
		ДанныеБлокирующихОбъектов = ДанныеБлокирующихОбъектов(Результат.НеХватаетВЭтомОбъекте);
		
		Результат.ФактическиБлокируют    = ДанныеБлокирующихОбъектов.ФактическиБлокируют;
		Результат.ПрочиеТребуютПолучения = ДанныеБлокирующихОбъектов.ПрочиеОбъекты;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеБлокирующихОбъектов(ДанныеКАнализу)
	
	ДанныеДляВозврата = Новый Структура;
	ДанныеДляВозврата.Вставить("ФактическиБлокируют", НовыйТаблицаДанныхОбъектыКПолучению());
	ДанныеДляВозврата.Вставить("ПрочиеОбъекты",       НовыйТаблицаДанныхОбъектыКПолучению());
	
	Если ДанныеКАнализу = Неопределено Тогда
		Возврат ДанныеДляВозврата;
	КонецЕсли;
	
	ДанныеДляАнализа = ДанныеКАнализу.Скопировать();
	
	Итерация = 1;
	
	Пока Истина Цикл
		
		ДанныеДляСледующегоАнализа = НовыйТаблицаДанныхОбъектыКПолучению();
		
		Для Каждого СтрокаТаблицы Из ДанныеДляАнализа Цикл
			
			Если СтрокаТаблицы.ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетЗагрузкуДругихОбъектов Тогда
				
				Если СтрокаТаблицы.ОбъектКПолучению = СтрокаТаблицы.ПолученныйОбъектОжидающийОбъект Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = ДанныеДляСледующегоАнализа.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы); 
				
				Если Итерация > 1 Тогда
					
					ДобавитьСтрокуТаблицуБлокируемыеОбъекты(ДанныеДляВозврата.ПрочиеОбъекты, СтрокаТаблицы);
					
				КонецЕсли;
				
			Иначе
				
				ДобавитьСтрокуТаблицуБлокируемыеОбъекты(ДанныеДляВозврата.ФактическиБлокируют, СтрокаТаблицы);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Итерация = Итерация + 1;
		
		Если ДанныеДляСледующегоАнализа.Количество() = 0 Тогда
			
			Прервать;
			
		Иначе
			
			ДанныеДляАнализа = ДанныеОжидаемыхОбъектовДляМассиваОбъектов(ДанныеДляСледующегоАнализа);
			
			Если ДанныеДляАнализа = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат  ДанныеДляВозврата;
	
КонецФункции

Процедура ДобавитьСтрокуТаблицуБлокируемыеОбъекты(ТаблицаОбъектов, ДобавляемаяСтрока)
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ОбъектКПолучению",   ДобавляемаяСтрока.ОбъектКПолучению);
	ПараметрыПоиска.Вставить("ПравилоКонвертации", ДобавляемаяСтрока.ПравилоКонвертации);
	
	НайденныеСтроки = ТаблицаОбъектов.НайтиСтроки(ПараметрыПоиска);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		НоваяСтрока = ТаблицаОбъектов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДобавляемаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

Функция НовыйТаблицаДанныхОбъектыКПолучению()
	 
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("ОбъектКПолучению",                 ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаДанных.Колонки.Добавить("ПолученныйОбъект",                 ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаДанных.Колонки.Добавить("ПравилоКонвертации",               ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаДанных.Колонки.Добавить("ОбъектФормата",                    ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаДанных.Колонки.Добавить("УзелПланаОбмена",                  РаботаСРезультатамиОбмена.ОписаниеТипаПланыОбменаБСП());
	ТаблицаДанных.Колонки.Добавить("ОбъектМетаданных",                 Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыОбъектовМетаданных"));
	ТаблицаДанных.Колонки.Добавить("ПричинаДобавления",                Новый ОписаниеТипов("ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке"));
	ТаблицаДанных.Колонки.Добавить("ДатаВозникновения",                ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаДанных.Колонки.Добавить("ДанныеСконвертированногоОбъекта",  Новый ОписаниеТипов("ХранилищеЗначения"));
	ТаблицаДанных.Колонки.Добавить("ПричинаФормаПроблемы");
	
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ДанныеОжидаемыхОбъектовДляМассиваОбъектов(ОбъектыКПолучениюОжидаемых)
	
	Если ОбъектыКПолучениюОжидаемых.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаОжидающиеОбъекты = НовыйТаблицаОбъектовКПолучениюОжидаемых();
	
	Для Каждого ДанныеОжидающегоОбъекта Из ОбъектыКПолучениюОжидаемых Цикл
		
		НоваяСтрока = ТаблицаОжидающиеОбъекты.Добавить();
		НоваяСтрока.ОбъектКПолучению   = ДанныеОжидающегоОбъекта.ОбъектКПолучению;
		НоваяСтрока.ПравилоКонвертации = ДанныеОжидающегоОбъекта.ПравилоКонвертации;
		НоваяСтрока.ОбъектФормата      = ДанныеОжидающегоОбъекта.ОбъектФормата;
		НоваяСтрока.УзелПланаОбмена    = ДанныеОжидающегоОбъекта.УзелПланаОбмена;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОжидающиеОбъекты.ОбъектКПолучению   КАК ОбъектКПолучению,
	|	ОжидающиеОбъекты.ПравилоКонвертации КАК ПравилоКонвертации,
	|	ОжидающиеОбъекты.ОбъектФормата      КАК ОбъектФормата,
	|	ОжидающиеОбъекты.УзелПланаОбмена    КАК УзелПланаОбмена
	|ПОМЕСТИТЬ ОжидающиеОбъекты
	|ИЗ
	|	&ТаблицаОжидающиеОбъекты КАК ОжидающиеОбъекты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект               КАК ПолученныйОбъектОжидающийОбъект,
	|	ОбъектыБлокирующиеЗагрузку.ПравилоКонвертации             КАК ПравилоКонвертацииОжидающийОбъект,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению               КАК ОбъектКПолучению,
	|	ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена                КАК УзелПланаОбмена,
	|	ОбъектыКЗагрузке.ПравилоКонвертации                       КАК ПравилоКонвертации,
	|	ОбъектыКЗагрузке.ОбъектФормата                            КАК ОбъектФормата,
	|	ОбъектыКЗагрузке.ОбъектМетаданных                         КАК ОбъектМетаданных,
	|	ОбъектыКЗагрузке.ПричинаДобавления                        КАК ПричинаДобавления,
	|	ОбъектыКЗагрузке.ДанныеСконвертированногоОбъекта          КАК ДанныеСконвертированногоОбъекта,
	|	ОбъектыКЗагрузке.ДатаУстановкиПричиныДобавления           КАК ДатаВозникновения,
	|	ВЫБОР
	|		КОГДА ОбъектыКЗагрузке.ПричинаДобавления В (ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроведения), ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи), ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи))
	|			ТОГДА ОбъектыКЗагрузке.СтатусОбновленияОбъектаВИБ
	|		ИНАЧЕ ОбъектыКЗагрузке.ПричинаДобавления
	|	КОНЕЦ КАК ПричинаФормаПроблемы
	|ИЗ
	|	ОжидающиеОбъекты КАК ОжидающиеОбъекты
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыБлокирующиеЗагрузку КАК ОбъектыБлокирующиеЗагрузку
	|		ПО ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект  = ОжидающиеОбъекты.ОбъектКПолучению
	|			И ОбъектыБлокирующиеЗагрузку.ПравилоКонвертации = ОжидающиеОбъекты.ПравилоКонвертации
	|			И ОбъектыБлокирующиеЗагрузку.ОбъектФормата      = ОжидающиеОбъекты.ОбъектФормата
	|			И ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена    = ОжидающиеОбъекты.УзелПланаОбмена
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ПО ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению = ОбъектыКЗагрузке.ПолученныйОбъект
	|			И ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена   = ОбъектыКЗагрузке.УзелПланаОбмена
	|ГДЕ
	|	ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект <> ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению";
	
	Запрос.УстановитьПараметр("ТаблицаОжидающиеОбъекты", ТаблицаОжидающиеОбъекты);
	
	Результат = Запрос.Выполнить(); 
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Результат.Выгрузить();
	
КонецФункции

Функция НовыйТаблицаОбъектовКПолучениюОжидаемых()
	
	ОбъектыКПолучениюОжидаемых = Новый ТаблицаЗначений;
	ОбъектыКПолучениюОжидаемых.Колонки.Добавить("ОбъектКПолучению",   ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ОбъектыКПолучениюОжидаемых.Колонки.Добавить("ПравилоКонвертации", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ОбъектыКПолучениюОжидаемых.Колонки.Добавить("ОбъектФормата",      ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ОбъектыКПолучениюОжидаемых.Колонки.Добавить("УзелПланаОбмена",    РаботаСРезультатамиОбмена.ОписаниеТипаПланыОбменаБСП());
	
	Возврат ОбъектыКПолучениюОжидаемых;
	
КонецФункции

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры, "ИмяФормы") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Параметры.ИмяФормы = "ФормаПроблемы" Тогда
			
			ДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеЗаписиРегистра();
			ДанныеЗаписи.ПолученныйОбъект   = Параметры.ДанныеЗаписиОбъектКЗагрузке.ПолученныйОбъект;
			ДанныеЗаписи.ПравилоКонвертации = Параметры.ДанныеЗаписиОбъектКЗагрузке.ПравилоКонвертации;
			ДанныеЗаписи.ОбъектФормата      = Параметры.ДанныеЗаписиОбъектКЗагрузке.ОбъектФормата;
			ДанныеЗаписи.УзелПланаОбмена    = Параметры.ДанныеЗаписиОбъектКЗагрузке.УзелПланаОбмена;
			
			ДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.ДанныеЗаписиРегистра(ДанныеЗаписи);
			
			Если Не ЗначениеЗаполнено(ДанныеЗаписи.ПричинаДобавления) Тогда
				
				ВызватьИсключение НСтр("ru = 'Не удалось открыть форму проблемы по переданным параметрам.'");
				
			ИначеЕсли ДанныеЗаписи.ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаКонвертации Тогда
				
				ВыбраннаяФорма = "ФормаПроблемыОшибкаКонвертации";
				
			ИначеЕсли ДанныеЗаписи.ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПодтверждение Тогда
				
				ВыбраннаяФорма = "ФормаПроблемыПодтверждениеЗагрузки";
				
			ИначеЕсли ДанныеЗаписи.ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПоискСоответствия Тогда
				
				ВыбраннаяФорма = "ФормаПроблемыКУстановкеСоответствия";
				
			ИначеЕсли ДанныеЗаписи.ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетЗагрузкуДругихОбъектов Тогда
				
				ВыбраннаяФорма = "ФормаПроблемыОжидаетЗагрузкуДругих";
				
			ИначеЕсли ДанныеЗаписи.ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетсяПолучениеЭтогоОбъекта Тогда
				
				ВыбраннаяФорма = "ФормаПроблемыОжидаетсяПолучениеЭтогоОбъекта";
				
			ИначеЕсли ДанныеЗаписи.ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи
				Или ДанныеЗаписи.ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи
				Или ДанныеЗаписи.ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроведения Тогда
				
				Если ДанныеЗаписи.СтатусОбновленияОбъектаВИБ = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженОбновлен
					Или ДанныеЗаписи.СтатусОбновленияОбъектаВИБ = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженСозданНовый Тогда
					
					ВыбраннаяФорма = "ФормаПроблемыЗагруженныеСПроблемамиПриЗаписи";
					
				ИначеЕсли ДанныеЗаписи.СтатусОбновленияОбъектаВИБ = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеОбновлен
					Или ДанныеЗаписи.СтатусОбновленияОбъектаВИБ = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеСоздан Тогда
					
					ВыбраннаяФорма = "ФормаПроблемыНезагруженныеСПроблемамиПриЗаписи";
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			ВыбраннаяФорма = Параметры.ИмяФормы;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли



