///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Возвращает общие настройки авторизации интернет-сервиса.
//
// Параметры:
//   ИмяИнтернетСервиса - Строка - имя почтового сервиса
//   ВладелецДанных - Строка - домен владельца данных
//
// Возвращаемое значение:
//   Структура - общие настройки авторизации интернет-сервиса
//     * Ссылка - СправочникСсылка.ОбщиеНастройкиАвторизацииИнтернетСервисов
//     * ИмяИнтернетСервиса - Строка
//     * ВладелецДанных - Строка
//     * АдресАвторизации - Строка
//     * АдресРегистрацииУстройства - Строка
//     * АдресПолученияКлюча - Строка
//     * АдресПеренаправления - Строка
//     * АдресПеренаправленияВебКлиент - Строка
//     * ЗапрашиваемыеРазрешения - Строка
//     * ИспользоватьКлючПроверкиПодлинностиPKCE - Булево
//     * ИдентификаторПриложения - Строка
//     * ИспользоватьПарольПриложения - Булево
//     * ПарольПриложения - Строка
//     * ДополнительныеПараметрыАвторизации - Строка
//     * ДополнительныеПараметрыПолученияТокена - Строка
//     * ПояснениеПоАдресуПеренаправления - Строка
//     * ПояснениеПоИдентификаторуПриложения - Строка
//     * ПояснениеПоПаролюПриложения - Строка
//     * ДополнительноеПояснение - Строка
//     * ПсевдонимАдресаПеренаправления - Строка
//     * ПсевдонимИдентификатораПриложения - Строка
//     * ПсевдонимПароляПриложения - Строка
//     * АдресПеренаправленияПоУмолчанию - Строка
//     * ПодсказкаВводаПароля - Строка
//     * ИспользоватьБраузерОперационнойСистемы - Булево
//
Функция НастройкиАвторизацииИнтернетСервиса(ИмяИнтернетСервиса, ВладелецДанных) Экспорт
	
	НастройкиАвторизации = НовыеНастройкиАвторизации();
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОбщиеНастройкиАвторизацииИнтернетСервисов.Ссылка КАК Ссылка,
	|	ОбщиеНастройкиАвторизацииИнтернетСервисов.АдресАвторизации КАК АдресАвторизации,
	|	ОбщиеНастройкиАвторизацииИнтернетСервисов.АдресПолученияКлюча КАК АдресПолученияКлюча,
	|	ОбщиеНастройкиАвторизацииИнтернетСервисов.АдресРегистрацииУстройства КАК АдресРегистрацииУстройства,
	|	ОбщиеНастройкиАвторизацииИнтернетСервисов.АдресПеренаправления КАК АдресПеренаправления,
	|	ОбщиеНастройкиАвторизацииИнтернетСервисов.АдресПеренаправленияВебКлиент КАК АдресПеренаправленияВебКлиент,
	|	ОбщиеНастройкиАвторизацииИнтернетСервисов.ИспользоватьКлючПроверкиПодлинностиPKCE КАК ИспользоватьКлючПроверкиПодлинностиPKCE,
	|	ОбщиеНастройкиАвторизацииИнтернетСервисов.ИдентификаторПриложения КАК ИдентификаторПриложения,
	|	ОбщиеНастройкиАвторизацииИнтернетСервисов.ЗапрашиваемыеРазрешения КАК ЗапрашиваемыеРазрешения,
	|	ОбщиеНастройкиАвторизацииИнтернетСервисов.ИспользоватьПарольПриложения КАК ИспользоватьПарольПриложения,
	|	ОбщиеНастройкиАвторизацииИнтернетСервисов.ДополнительныеПараметрыАвторизации КАК ДополнительныеПараметрыАвторизации,
	|	ОбщиеНастройкиАвторизацииИнтернетСервисов.ДополнительныеПараметрыПолученияТокена КАК ДополнительныеПараметрыПолученияТокена,
	|	ОбщиеНастройкиАвторизацииИнтернетСервисов.ИмяИнтернетСервиса КАК ИмяИнтернетСервиса,
	|	ОбщиеНастройкиАвторизацииИнтернетСервисов.ВладелецДанных КАК ВладелецДанных
	|ИЗ
	|	Справочник.ОбщиеНастройкиАвторизацииИнтернетСервисов КАК ОбщиеНастройкиАвторизацииИнтернетСервисов
	|ГДЕ
	|	ОбщиеНастройкиАвторизацииИнтернетСервисов.ВладелецДанных = &ВладелецДанных
	|	И ОбщиеНастройкиАвторизацииИнтернетСервисов.ИмяИнтернетСервиса = &ИмяИнтернетСервиса
	|	И НЕ ОбщиеНастройкиАвторизацииИнтернетСервисов.ПометкаУдаления";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ВладелецДанных", ВладелецДанных);
	Запрос.УстановитьПараметр("ИмяИнтернетСервиса", ИмяИнтернетСервиса);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(НастройкиАвторизации, ВыборкаДетальныеЗаписи);
		
		НастройкиАвторизации.ПарольПриложения = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
			ВыборкаДетальныеЗаписи.Ссылка, "ПарольПриложения", Истина);
		
	КонецЕсли;
	
	ИнтеграцияПодсистемБСП.ПриПолученииОбщихНастроекАвторизацииИнтернетСервиса(
		ИмяИнтернетСервиса, ВладелецДанных, НастройкиАвторизации);
	
	Возврат НастройкиАвторизации;
	
КонецФункции

// Возвращает признак наличия настроек авторизации в информационной базе.
//
// Параметры:
//  ВладелецДанных - Строка - домен владельца данных
//  ИмяИнтернетСервиса - Строка - имя почтового сервиса, если известно
//
// Возвращаемое значение:
//  Булево
//
Функция ЕстьНастройкиАвторизации(ВладелецДанных, ИмяИнтернетСервиса = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбщиеНастройкиАвторизацииИнтернетСервисов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ОбщиеНастройкиАвторизацииИнтернетСервисов КАК ОбщиеНастройкиАвторизацииИнтернетСервисов
	|ГДЕ
	|	ОбщиеНастройкиАвторизацииИнтернетСервисов.ВладелецДанных = &ВладелецДанных
	|	И ВЫРАЗИТЬ(ОбщиеНастройкиАвторизацииИнтернетСервисов.ИдентификаторПриложения КАК СТРОКА(1024)) <> """"
	|	И НЕ ОбщиеНастройкиАвторизацииИнтернетСервисов.ПометкаУдаления
	|	И (&ИмяИнтернетСервиса = """"
	|	ИЛИ ОбщиеНастройкиАвторизацииИнтернетСервисов.ИмяИнтернетСервиса = &ИмяИнтернетСервиса)";
	
	Запрос.УстановитьПараметр("ВладелецДанных", ВладелецДанных);
	Запрос.УстановитьПараметр("ИмяИнтернетСервиса", ИмяИнтернетСервиса);
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	ИмяСервиса = ?(ЗначениеЗаполнено(ИмяИнтернетСервиса), ИмяИнтернетСервиса, ВладелецДанных);
	НастройкиАвторизации = НовыеНастройкиАвторизации();
	
	ИнтеграцияПодсистемБСП.ПриПолученииОбщихНастроекАвторизацииИнтернетСервиса(
		ИмяСервиса, ВладелецДанных, НастройкиАвторизации);
	
	Возврат ЗначениеЗаполнено(НастройкиАвторизации.ИдентификаторПриложения);
	
КонецФункции

Функция НовыеНастройкиАвторизации()
	
	НастройкиАвторизации = Новый Структура;
	НастройкиАвторизации.Вставить("Ссылка");
	НастройкиАвторизации.Вставить("ИмяИнтернетСервиса");
	НастройкиАвторизации.Вставить("ВладелецДанных");
	НастройкиАвторизации.Вставить("АдресАвторизации");
	НастройкиАвторизации.Вставить("АдресРегистрацииУстройства");
	НастройкиАвторизации.Вставить("АдресПолученияКлюча");
	НастройкиАвторизации.Вставить("АдресПеренаправления");
	НастройкиАвторизации.Вставить("АдресПеренаправленияВебКлиент");
	НастройкиАвторизации.Вставить("ЗапрашиваемыеРазрешения");
	НастройкиАвторизации.Вставить("ИспользоватьКлючПроверкиПодлинностиPKCE");
	НастройкиАвторизации.Вставить("ИдентификаторПриложения");
	НастройкиАвторизации.Вставить("ИспользоватьПарольПриложения");
	НастройкиАвторизации.Вставить("ПарольПриложения");
	НастройкиАвторизации.Вставить("ДополнительныеПараметрыАвторизации");
	НастройкиАвторизации.Вставить("ДополнительныеПараметрыПолученияТокена");
	НастройкиАвторизации.Вставить("ПояснениеПоАдресуПеренаправления", "");
	НастройкиАвторизации.Вставить("ПояснениеПоИдентификаторуПриложения", "");
	НастройкиАвторизации.Вставить("ПояснениеПоПаролюПриложения", "");
	НастройкиАвторизации.Вставить("ДополнительноеПояснение", "");
	НастройкиАвторизации.Вставить("ПсевдонимАдресаПеренаправления", "");
	НастройкиАвторизации.Вставить("ПсевдонимИдентификатораПриложения", "");
	НастройкиАвторизации.Вставить("ПсевдонимПароляПриложения", "");
	НастройкиАвторизации.Вставить("АдресПеренаправленияПоУмолчанию", "");
	НастройкиАвторизации.Вставить("ПодсказкаВводаПароля", "");
	НастройкиАвторизации.Вставить("ИспользоватьБраузерОперационнойСистемы", Ложь);
	
	Возврат НастройкиАвторизации;
	
КонецФункции

#КонецОбласти

#КонецЕсли