///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// См. ИнтерфейсыСообщенийВМоделиСервисаПереопределяемый.ЗаполнитьОбработчикиПринимаемыхСообщений.
Процедура РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков) Экспорт
	
	МассивОбработчиков.Добавить(СообщенияОткрытаяАвторизацияПочтовогоСервисаИнтерфейс);
	
КонецПроцедуры

// Возвращает тип XDTO-сообщения для обратного вызова после авторизации.
//
// Параметры:
//   Пакет - Строка, Неопределено - пространство имен типа XDTO
//
// Возвращаемое значение:
//   ТипОбъектаXDTO - тип объекта XDTO-сообщения для обратного вызова
//
Функция ТипОбратныйВызов(Пакет = Неопределено) Экспорт
	
	Возврат СоздатьТипСообщения("CallBack", Пакет);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создает тип XDTO -сообщения по указанному имени и пакету.
//
// Параметры:
//   ИмяТипа - Строка - имя типа сообщения в пакете XDTO
//   Пакет - Строка - пространство имен пакета XDTO. Если не указано, используется пакет по умолчанию
//
// Возвращаемое значение:
//   ТипОбъектаXDTO - созданный тип объекта XDTO-сообщения
//
Функция СоздатьТипСообщения(ИмяТипа, Пакет = Неопределено)
	
	Возврат ФабрикаXDTO.Тип(?(Пакет = Неопределено, СообщенияОткрытаяАвторизацияПочтовогоСервисаИнтерфейс.Пакет(), Пакет), ИмяТипа);
	
КонецФункции

#КонецОбласти