///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция УведомленияКлиентаДоступны() Экспорт
	
	Если ТолькоДляТестирования() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Версия = СистемнаяИнформация.ВерсияПриложения;
	
// АПК:547-выкл временное решение для обратной совместимости.
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	ИнформационнаяБазаФайловая = ОбщегоНазначения.ИнформационнаяБазаФайловая();
#Иначе
	ИнформационнаяБазаФайловая = ОбщегоНазначенияКлиент.ИнформационнаяБазаФайловая();
#КонецЕсли
// АПК:547-вкл
	
	Если ИнформационнаяБазаФайловая Тогда
		Возврат ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Версия, "8.3.27.1935") >= 0
		      И ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Версия, "8.5.1.0") < 0
		    Или ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Версия, "8.5.1.1119") >= 0;
	Иначе
		Возврат ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Версия, "8.3.27.2130") >= 0
		      И ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Версия, "8.5.1.0") < 0
		    Или ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Версия, "8.5.1.1343") >= 0
		      И ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Версия, "8.5.4.0") < 0
		    Или ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Версия, "8.5.4.1306") >= 0;
	КонецЕсли;
	
КонецФункции

Функция ТолькоДляТестирования()
	
	Возврат Ложь;
	
КонецФункции

Функция КлючУведомленийСерверныхОповещений() Экспорт
	
	Возврат "СтандартныеПодсистемы.БазоваяФункциональность.СерверныеОповещения";
	
КонецФункции

#КонецОбласти
