///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция УведомленияКлиентаДоступны() Экспорт
	
	Если ТолькоДляТестирования() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Версия = СистемнаяИнформация.ВерсияПриложения;
	
	Возврат ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Версия, "8.3.26.1498") >= 0
	      И ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Версия, "8.3.27.0") < 0
	    Или ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Версия, "8.3.27.1288") >= 0;
	
КонецФункции

Функция ТолькоДляТестирования()
	
// АПК:547-выкл временное решение для тестирования.
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	РазделениеВключено = ОбщегоНазначения.РазделениеВключено();
#Иначе
	РазделениеВключено = ОбщегоНазначенияКлиент.РазделениеВключено();
#КонецЕсли
// АПК:547-вкл
	
	Возврат РазделениеВключено;
	
КонецФункции

Функция КлючУведомленийСерверныхОповещений() Экспорт
	
	Возврат "СтандартныеПодсистемы.БазоваяФункциональность.СерверныеОповещения";
	
КонецФункции

#КонецОбласти
