///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Устанавливает признак разрешения отправки документов на подпись в сервис мобильной подписи.
// 
// Параметры:
//  Включить - Булево
//
Процедура НастроитьРаботуССервисомМобильнойПодписи(Включить) Экспорт
	
	Если Константы.ИспользоватьСервисМобильнойПодписи.Получить() <> Включить Тогда
		Константы.ИспользоватьСервисМобильнойПодписи.Установить(Включить);
	КонецЕсли;

КонецПроцедуры

// Возвращает Истина, если доступна отправка подписей в мобильный сервис.
//
// Возвращаемое значение:
//  Булево
//
Функция ИспользоватьСервисМобильнойПодписи() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьСервисМобильнойПодписи") И ОбщегоНазначения.РазрешенДоступКИнтернетСервисам();
	
КонецФункции

// Отправляет данные на подписание в сервис мобильной подписи, возвращает идентификатор подписи,
// по которому потом можно получить результат. 
// 
// Параметры:
//  НаборДанных - Массив из Структура:
//     * Данные            - ДвоичныеДанные - данные для подписания.
//                         - Строка - адрес временного хранилища, содержащего двоичные данные.
//     * Объект              - ЛюбаяСсылка - (необязательный) - ссылка на объект, к которому нужно добавить подпись.
//                          Если не указан, то подпись не требуется добавлять.
//     * ВерсияОбъекта       - Строка - (необязательный) - версия данных объекта для проверки и
//                          блокировки объекта перед записью признака подписи.
//     * Представление        - Строка - имя файла с расширением длиной не более 250 символов и без дублей
//                          в наборе данных в случае пакетной отправки.
//  Подписант - см. СервисМобильнойПодписиКлиентСервер.ПараметрыПодписанта
//            - СправочникСсылка.ПодписантыСервисаМобильнойПодписи
//  Параметры - Структура:
//    * ТипПодписи - ПеречислениеСсылка.ТипыПодписиКриптографии
//    * ИдентификаторФормы - УникальныйИдентификатор, Неопределено - для блокировки объекта подписания, если заполнен.
//    * Доверенность - СправочникСсылка.МашиночитаемыеДоверенности
//    * ПакетнаяОтправкаНаПодписание - Булево - отправить набор одним пакетом.
// 
// Возвращаемое значение:
//  - Массив из Структура:
//     * ИдентификаторДокумента - УникальныйИдентификатор - при успешной отправке вставлен в структуру переданных данных.
//  - Структура - в случае ошибки отправки:
//     * ЗаголовокОшибки - Строка
//     * ТекстОшибки - Строка
//     * НаборДанных - Массив из Структура - у успешно обработанных элементов будет свойство:
//        ** ИдентификаторДокумента - УникальныйИдентификатор - при успешной отправке вставлен в структуру переданных данных.
//     * ИдентификаторЗапроса - Строка, Неопределено
//     * ДополнительныеФайлы - Массив из Структура:
//        ** Данные - ДвоичныеДанные
//        ** Имя - имя файла
//
Функция ОтправитьНаПодписание(Знач НаборДанных, Знач Подписант, Знач Параметры) Экспорт
	
	Возврат СервисМобильнойПодписиСлужебный.ОтправитьНаПодписание(НаборДанных, Подписант, Параметры);
	
КонецФункции

// Получает результаты из сервиса мобильной подписи.
// 
// Параметры:
//  ИдентификаторыДокументов - Массив из УникальныйИдентификатор
// 
// Возвращаемое значение:
//  Структура:
//  * РезультатыПроверки - Соответствие из КлючИЗначение:
//   ** Ключ - УникальныйИдентификатор
//   ** Значение - Структура:
//      *** Подпись - ДвоичныеДанные - если не заполнена, значит подпись не получена.
//      
//      Свойства подписи если получена:
//      *** ТипПодписи          - ПеречислениеСсылка.ТипыПодписиКриптографии, Неопределено.
//      *** СрокДействияПоследнейМеткиВремени - Дата - срок действия сертификата, которым подписана
//            последняя метка времени (или пустая дата, если нет метки времени), если удалось определить с помощью МенеджерКриптографии.
//      *** НеподтвержденнаяДатаПодписи - Дата - неподтвержденная дата подписи.
//                                      - Неопределено - неподтвержденная дата подписи отсутствует в данных подписи.
//      *** ДатаПодписиИзМетки - Дата - дата самой ранней метки времени.
//                         - Неопределено - метка времени отсутствует в данных подписи.
//      *** ДатаПодписи - Дата - НеподтвержденнаяДатаПодписи, если не заполнена - ТекущаяДатаСеанса.
//      *** Сертификат - ДвоичныеДанные - сертификат подписанта
//      *** Отпечаток - Строка - отпечаток сертификата в формате строки Base64.
//      *** КомуВыданСертификат - Строка - представление субъекта, полученное из двоичных данных сертификата.
//      *** ЗаписаннаяПодпись - Структура:
//            **** ПодписанныйОбъект - ОпределяемыйТип.ПодписанныйОбъект
//            **** ПорядковыйНомер - Число
//      *** ИдентификаторПодписи - УникальныйИдентификатор
//      
//      Свойства подписи если не получена:
//      *** СтатусВМобильномСервисе - ПеречислениеСсылка.СервисМобильнойПодписиСтатусы
//      *** ОшибкаПроверкиДополнительныхАтрибутов - Строка - если подпись еще не получена, информация о статусе или
//                                                           ошибке.
//      
//   * Ошибка - Структура - в случае ошибки проверки статуса:
//     ** ЗаголовокОшибки - Строка
//     ** ТекстОшибки - Строка
//     ** ИдентификаторЗапроса - Строка, Неопределено - идентификатор запроса в сервис.
//     ** ДополнительныеФайлы - Массив из Структура:
//        ** Данные - ДвоичныеДанные
//        ** Имя - Строка - имя файла
//
Функция РезультатыПодписанияИзСервисаМобильнойПодписи(ИдентификаторыДокументов) Экспорт
	
	Возврат СервисМобильнойПодписиСлужебный.РезультатПроверкиОжидаемыхПодписей(ИдентификаторыДокументов);
		
КонецФункции

#КонецОбласти
