///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПереданныеПараметры();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПолучитьДанныеБлокируемыеОбъекты();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБлокируемыеОбъекты

&НаКлиенте
Процедура БлокируемыеОбъектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.БлокируемыеОбъекты.ТекущиеДанные;
		
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуПроблемы(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура Обновить(Команда)
	
	ПолучитьДанныеБлокируемыеОбъекты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроблему(Команда)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.БлокируемыеОбъекты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта'"));
		Возврат;
		
	КонецЕсли;
	
	ОткрытьФормуПроблемы(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьПереданныеПараметры()
	
	ПолученныйОбъект       = Параметры.ОбъектКПолучению;
	УзелИнформационнойБазы = Параметры.УзелИнформационнойБазы;
	ОбъектФормата          = Параметры.ОбъектФормата;
	
КонецПроцедуры

#Область БлокируемыеОбъекты

&НаКлиенте
Процедура ПолучитьДанныеБлокируемыеОбъекты()
	
	БлокируемыеОбъекты.Очистить();
	
	ДлительнаяОперация = ДлительнаяОперацияБлокируемыеОбъекты(УникальныйИдентификатор);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ПолучитьДанныеБлокируемыхОбъектовЗавершение(ДлительнаяОперация, Неопределено);
		
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучитьДанныеБлокируемыхОбъектовЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияБлокируемыеОбъекты(УникальныйИдентификатор)
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ПолученныйОбъект", ПолученныйОбъект);
	ПараметрыПроцедуры.Вставить("ОбъектФормата",    ОбъектФормата);
	ПараметрыПроцедуры.Вставить("УзелПланаОбмена",  УзелИнформационнойБазы);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение данных количества блокируемых объектов'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.ОбъектыБлокирующиеЗагрузку.ПолучитьДанныеБлокируемыхОбъектов",
		                                                    ПараметрыПроцедуры, ПараметрыВыполнения);
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьДанныеБлокируемыхОбъектовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ОбработатьПолученныеДанныеБлокирует(Результат.АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПолученныеДанныеБлокирует(АдресРезультата)

	Если Не ЭтоАдресВременногоХранилища(АдресРезультата) Тогда 
		Возврат;
	КонецЕсли;
	
	ПолученныеДанные = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ПолученныеДанные = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипЗнч(ПолученныеДанные) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ИменаТаблиц = Новый Массив;
	ИменаТаблиц.Добавить("БлокируетНепосредственно");
	ИменаТаблиц.Добавить("БлокируетОпосредовано");
	
	Для Каждого ИмяТаблицы Из ИменаТаблиц Цикл
		
		РаботаСРезультатамиОбмена.ДобавитьСтрокиБлокируемыеОбъекты(БлокируемыеОбъекты, ПолученныеДанные[ИмяТаблицы]);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ФормаПроблемы

&НаКлиенте
Процедура ОткрытьФормуПроблемы(ТекущиеДанные)
		
	ДанныеЗаписи = РаботаСРезультатамиОбменаКлиентСервер.НовыйКлючЗаписиОбъектыКЗагрузке();
	
	ДанныеЗаписи.ПолученныйОбъект   = ТекущиеДанные.ПолученныйОбъект;
	ДанныеЗаписи.ПравилоКонвертации = ТекущиеДанные.ПравилоКонвертации;
	ДанныеЗаписи.ОбъектФормата      = ТекущиеДанные.ОбъектФормата;
	ДанныеЗаписи.УзелПланаОбмена    = УзелИнформационнойБазы;
	
	ОповещениеОЗакрытииФормыПроблемы = Новый ОписаниеОповещения("ПослеЗакрытияФормыПроблемы", ЭтотОбъект);
	
	РаботаСРезультатамиОбменаКлиент.ОткрытьФормуПроблемы(
		ДанныеЗаписи, ЭтотОбъект,
		ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетЗагрузкуДругихОбъектов"), ОповещениеОЗакрытииФормыПроблемы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыПроблемы(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено Тогда
	
		ПолучитьДанныеБлокируемыеОбъекты();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти





