///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция ТипыВнешнихСистем() Экспорт

	ТипыИнтеграций = Новый Структура;
	ТипыИнтеграций.Вставить("Max", "MAX");
	ТипыИнтеграций.Вставить("Telegram", "Telegram");
	ТипыИнтеграций.Вставить("ВКонтакте", "VK");
	ТипыИнтеграций.Вставить("WhatsApp", "WhatsApp Devino");
	ТипыИнтеграций.Вставить("ВебЧат", "WebChat");
	ТипыИнтеграций.Вставить("Webhook", "Webhook");
	
	Возврат ТипыИнтеграций;

КонецФункции

#КонецОбласти