///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
Процедура ДобавитьЗапись(ВидРезервнойКопии, ДатаСоздания, ИмяФайлаРезервнойКопии) Экспорт

	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.ВидРезервнойКопии.Установить(ВидРезервнойКопии);
	Набор.Отбор.ДатаСоздания.Установить(ДатаСоздания);

	Запись = Набор.Добавить();
	Запись.ВидРезервнойКопии		= ВидРезервнойКопии;
	Запись.ДатаСоздания				= ДатаСоздания;
	Запись.ИмяФайлаРезервнойКопии	= ИмяФайлаРезервнойКопии;

	Набор.Записать();

КонецПроцедуры
#КонецОбласти

#КонецЕсли