///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ТребуетсяПроверитьЛегальностьПолученияОбновления() Экспорт
	
	Результат = Истина;
	Если СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации() 
		Или ОбщегоНазначения.РазделениеВключено()
		Или ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Настройки = Новый Структура;
	Настройки.Вставить("ТребуетсяПроверитьЛегальностьПолученияОбновления", Результат);
	ПроверкаЛегальностиПолученияОбновленияПереопределяемый.ПриОпределенииНастроек(Настройки);
	
	Результат = Настройки.ТребуетсяПроверитьЛегальностьПолученияОбновления;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
