///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция ИсключенияПоискаСсылокРазрешающихУдаление() Экспорт
	Возврат УдалениеПомеченныхОбъектовСлужебный.ИсключенияПоискаСсылокРазрешающихУдалениеСлужебный();
КонецФункции

Функция ПроверятьИспользованиеУдаляемыхОбъектов() Экспорт
	Результат = Новый Структура("Значение, МеткаВремени");
	Результат.Значение = Константы.ПроверятьИспользованиеУдаляемыхОбъектов.Получить();
	Результат.МеткаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Возврат Результат;
КонецФункции

#КонецОбласти