///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПереданныеПараметры();
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗагружатьПриИзменении(Элемент)
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ДанныеВозврата());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьПереданныеПараметры()
	
	Загружать                           = ?(Параметры.Загружать, "Загружать", "НеЗагружать");
	ПредставлениеТипаМетаданных         = Параметры.ПредставлениеТипаМетаданных;
	
	Элементы.ОбъектМетаданных.Заголовок = РаботаСРезультатамиОбменаКлиентСервер.ТекстДляПоИмениОбъектаМетаданных(Параметры.ИмяТипаМетаданных);
	Элементы.ГруппаЗагружать.Заголовок  = ЗаголовокЗагружатьПо(Параметры.ИмяТипаМетаданных);
	
	УстанавливатьСоответствия           = Параметры.УстанавливатьСоответствия;
	КакЗагружать                        = Параметры.КакЗагружать;
	Комментарий                         = Параметры.Комментарий;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностью(Форма)
	
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементыФормы.УстанавливатьСоответствия.ТолькоПросмотр = Форма.Загружать = "НеЗагружать";
	ЭлементыФормы.КакЗагружать.ТолькоПросмотр              = Форма.Загружать = "НеЗагружать";
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокЗагружатьПо(ИмяТипаМетаданных)
	
	Возврат СтрШаблон(НСтр("ru = '%1 данного типа:'"), ЗаголовокРаздельно(ИмяТипаМетаданных));
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокРаздельно(ИсточникСтрока)
	
	Если ИсточникСтрока = "Справочники" Тогда
		
		Возврат НСтр("ru = 'Элементы справочника'");
		
	ИначеЕсли ИсточникСтрока = "Документы" Тогда
		
		Возврат НСтр("ru = 'Документы'");
		
	ИначеЕсли ИсточникСтрока = "РегистрыСведений" Тогда
		
		Возврат НСтр("ru = 'Записи регистра сведений'");
		
	ИначеЕсли ИсточникСтрока = "РегистрыНакоплений" Тогда
		
		Возврат НСтр("ru = 'Записи регистра накопления'");
		
	ИначеЕсли ИсточникСтрока = "РегистрыРасчета" Тогда
		
		Возврат НСтр("ru = 'Записи регистра расчетов'");
		
	ИначеЕсли ИсточникСтрока = "ПланыВидовХарактеристик" Тогда
		
		Возврат НСтр("ru = 'Элементы плана видов характеристик'");
		
	Иначе
		
		Возврат ИсточникСтрока;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ДанныеВозврата()

	ДанныеВозврата = Новый Структура;
	ДанныеВозврата.Вставить("Загружать",                  Загружать = "Загружать");
	ДанныеВозврата.Вставить("УстанавливатьСоответствия",  УстанавливатьСоответствия);
	ДанныеВозврата.Вставить("КакЗагружать",               КакЗагружать);
	ДанныеВозврата.Вставить("Комментарий",                Комментарий);
	ДанныеВозврата.Вставить("НаличиеКомментария",         НЕ ПустаяСтрока(Комментарий));
	Возврат ДанныеВозврата;

КонецФункции

#КонецОбласти