///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОграниченныеПоля = Новый Массив;
	ОграниченныеПоля.Добавить("Идентификатор");
	ОграниченныеПоля.Добавить("Ссылка");
	ОграниченныеПоля.Добавить("УзелИнформационнойБазы");
	
	Список.УстановитьОграниченияИспользованияВПорядке(ОграниченныеПоля);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанныеСтроки = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанныеСтроки = Неопределено
		ИЛИ Поле.Имя <> "СсылкаВнешняяНавигационная" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПерейтиПоВнешнейНавигационнойСсылке(ТекущиеДанныеСтроки[Поле.Имя], СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПерейтиПоВнешнейНавигационнойСсылке(СсылкаВнешняяНавигационная, СтандартнаяОбработка)
	
	Если ПустаяСтрока(СсылкаВнешняяНавигационная) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(СсылкаВнешняяНавигационная);
	
КонецПроцедуры

#КонецОбласти