///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область Функции

// Метод для вызова ОбменДаннымиXDTOСервер.ВерсияФорматаОбменаПриВыгрузке().
//
// Параметры:
//  УзелКорреспондента - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//
// Возвращаемое значение:
//  см. ОбменДаннымиXDTOСервер.ВерсияФорматаОбменаПриВыгрузке
//
Функция ВерсияФорматаОбменаПриВыгрузке(УзелКорреспондента) Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.ВерсияФорматаОбменаПриВыгрузке(УзелКорреспондента)
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.ДоступныеРасширенияФормата().
//
// Параметры:
//  ВерсияФорматаОбмена - Строка - версия формата обмена EnterpriseData.
// 
// Возвращаемое значение:
//   Соответствие из КлючИЗначение:
//     * Ключ - Строка - URI пространства имен схемы расширения формата.
//     * Значение - Строка - номер расширяемой версии формата.
//
Функция ДоступныеРасширенияФормата(ВерсияФорматаОбмена) Экспорт 
	
	Возврат ОбменДаннымиXDTOСервер.ДоступныеРасширенияФормата(ВерсияФорматаОбмена)
	
КонецФункции

// Метод для вызова РегистрыСведений.ДанныеОбъектовДляРегистрацииВОбменах.ОбъектЕстьВРегистре().
//
// Параметры:
//   УзелКорреспондента - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//   ПодобраннаяОбъектнаяСсылка - СправочникСсылка,
//                                ДокументСсылка - подобранная ссылка по запросу на повторную выгрузку данных.
// 
// Возвращаемое значение:
//   Булево - ИСТИНА, если запись есть в регистре.
//
Функция ЕстьВДанныхОбъектовДляРегистрацииВОбменах(УзелКорреспондента, ПодобраннаяОбъектнаяСсылка) Экспорт
	
	Возврат РегистрыСведений.ДанныеОбъектовДляРегистрацииВОбменах.ОбъектЕстьВРегистре(ПодобраннаяОбъектнаяСсылка, УзелКорреспондента);
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.ЗаписатьВПротоколВыполнения().
// @skip-check method-too-many-params
//
// Параметры:
//  КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//  КодОшибки        - Число - код ошибки, см. ОбменДаннымиПовтИсп.СообщенияОбОшибках(),
//                   - Строка - описание ошибки,
//                   - Структура - структура с кратким и подробным описанием ошибки:
//                         * КраткоеПредставлениеОшибки - Строка - описание ошибки для протокола (для пользователя).
//                         * ПодробноеПредставлениеОшибки - Строка - описание ошибки для журнала регистрации.
//                         * Уровень - УровеньЖурналаРегистрации - уровень важности ошибки.
//  СтруктураЗаписи   - Структура - структура записи протокола.
//  ВзвестиФлагОшибок - Булево - если истина, то - это сообщение об ошибке. Взводится ФлагОшибки.
//  Уровень           - Число - отступ слева, количество табуляций.
//  Выравнивание      - Число - отступ в тексте, для выравнивания текста выводимого в виде Ключ - Значение.
//  БезусловнаяЗаписьВПротоколОбмена - Булево - флаг безусловной записи информации в протокол.
//
// Возвращаемое значение:
//  см. ОбменДаннымиXDTOСервер.ЗаписатьВПротоколВыполнения.
//
Функция ЗаписатьВПротоколВыполнения(КомпонентыОбмена, КодОшибки = "", СтруктураЗаписи = Неопределено, ВзвестиФлагОшибок = Истина,
		Уровень = 0, Выравнивание = 22, БезусловнаяЗаписьВПротоколОбмена = Ложь) Экспорт
	
	Возврат
		ОбменДаннымиXDTOСервер.ЗаписатьВПротоколВыполнения(
			КомпонентыОбмена,
			КодОшибки,
			СтруктураЗаписи,
			ВзвестиФлагОшибок,
			Уровень,
			Выравнивание,
			БезусловнаяЗаписьВПротоколОбмена);
	
КонецФункции

// Метод для вызова ОбменДаннымиСобытия.ЗагрузкаЗапрещена().
//
// Параметры:
//   УзелКорреспондента - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//   ДанныеИБ - ДокументОбъект, СправочникОбъект - удаляемый объект ИБ.
//
// Возвращаемое значение:
//   см. ОбменДаннымиСобытия.ЗагрузкаЗапрещена.
//
Функция ЗапретЗагрузкиДанных(УзелКорреспондента, ДанныеИБ) Экспорт
	
	Возврат ОбменДаннымиСобытия.ЗагрузкаЗапрещена(ДанныеИБ, УзелКорреспондента);
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена().
//
// Параметры:
//  НаправлениеОбмена - Строка - направление выполнения обмена: "Отправка" | "Получение".
//
// Возвращаемое значение:
//  см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//
Функция ИнициализироватьКомпонентыОбмена(НаправлениеОбмена) Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена(НаправлениеОбмена);
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.ИнициализироватьПолученныеДанные().
//
// Параметры:
//   ПравилоКонвертации - СтрокаТабличнойЧасти - см. ОбменДаннымиXDTOСервер.ТаблицаПравилКонвертации().
// Возвращаемое значение:
//   СправочникМенеджер,
//   ДокументМенеджер,
//   НаборЗаписейМенеджер,
//   БизнесПроцессМенеджер,
//   ЗадачаМенеджер,
//   СчетМенеджер,
//   ВидРасчетаМенеджер
//
Функция ИнициализироватьПолученныеДанные(ПравилоКонвертации) Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.ИнициализироватьПолученныеДанные(ПравилоКонвертации);
	
КонецФункции

// Метод для вызова РегистрыСведений.ОбщиеНастройкиУзловИнформационныхБаз.ИнтервалОбновленияСтратегииПоискаПоКлючам().
//
// Параметры:
//   УзелКорреспондента - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//
// Возвращаемое значение:
//   Число - количество дней, при которых определенная стратегия поиска считается актуальной.
//
Функция ИнтервалОбновленияСтратегииПоискаПоКлючамПланаОбменаXDTO(Знач УзелКорреспондента) Экспорт
	
	Возврат РегистрыСведений.ОбщиеНастройкиУзловИнформационныхБаз.ИнтервалОбновленияСтратегииПоискаПоКлючам(УзелКорреспондента);
	
КонецФункции

// Метод для вызова ОбменДаннымиПовтИсп.ИспользоватьКешПубличныхИдентификаторов().
//
// Параметры:
//  ИмяПланаОбмена - Строка - имя плана обмена, как оно задано в конфигураторе.
//
// Возвращаемое значение:
//  см. ОбменДаннымиПовтИсп.ИспользоватьКешПубличныхИдентификаторов.
//
Функция ИспользоватьКешПубличныхИдентификаторов(ИмяПланаОбмена) Экспорт
	
	Возврат ОбменДаннымиПовтИсп.ИспользоватьКешПубличныхИдентификаторов(ИмяПланаОбмена);
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.КлассСсылка().
//
// Возвращаемое значение:
//  Строка - наименование свойства Ссылка объектов ИБ. На английском языке соответствует свойству объекта Ref.
//
Функция КлассСсылка() Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.КлассСсылка();
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.КлассФорматаЗапросНаВыгрузку().
//
// Возвращаемое значение:
//  Строка - наименование объекта ЗапросНаВыгрузку в формате EnterpriseData.
//
Функция КлассФорматаЗапросНаВыгрузку() Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.КлассФорматаЗапросНаВыгрузку();
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.КлассФорматаЛюбаяСсылка().
//
// Возвращаемое значение:
//  Строка - наименование объекта ЛюбаяСсылка в формате EnterpriseData.
//
Функция КлассФорматаЛюбаяСсылка() Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.КлассФорматаЛюбаяСсылка();
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.КлассФорматаСсылкаВнешняяНавигационная().
//
// Возвращаемое значение:
//  Строка - наименование класса СсылкаВнешняяНавигационная в формате EnterpriseData.
//
Функция КлассФорматаСсылкаВнешняяНавигационная() Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.КлассФорматаСсылкаВнешняяНавигационная();
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.КлассФорматаСсылкаНаОбъект().
//
// Возвращаемое значение:
//  Строка - наименование класса "СсылкаНаОбъект" в формате EnterpriseData.
//
Функция КлассФорматаСсылкаНаОбъект() Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.КлассФорматаСсылкаНаОбъект();
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.КлассФорматаУдалениеОбъекта().
//
// Возвращаемое значение:
//  Строка - наименование класса "УдалениеОбъекта" в формате EnterpriseData.
//
Функция КлассФорматаУдалениеОбъекта() Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.КлассФорматаУдалениеОбъекта();
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.МенеджерОбменаВерсииФормата().
//
// Параметры:
//  УзелКорреспондента - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//  ВерсияФорматаОбмена - Строка - версия формата обмена EnterpriseData.
// 
// Возвращаемое значение:
//  см. ОбменДаннымиXDTOСервер.МенеджерОбменаВерсииФормата.
//
Функция МенеджерОбменаВерсииФормата(УзелКорреспондента, ВерсияФорматаОбмена) Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.МенеджерОбменаВерсииФормата(ВерсияФорматаОбмена, УзелКорреспондента)
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.ОбъектXDTOВСтруктуру().
//
// Параметры:
//  КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//  ОбъектXDTO - Структура - 
// 
// Возвращаемое значение:
//  см. ОбменДаннымиXDTOСервер.ОбъектXDTOВСтруктуру.
//
Функция ОбъектXDTOВСтруктуру(КомпонентыОбмена, ОбъектXDTO) Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.ОбъектXDTOВСтруктуру(ОбъектXDTO, КомпонентыОбмена);
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.ОбъектФорматаПроходитПоФильтруXDTO().
//
// Параметры:
//  КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//  ОбъектФормата - Строка - имя объекта формата EnterpriseData, как оно задано в пакете XDTO.
//
// Возвращаемое значение:
//  Булево - Истина, если объект формата поддерживается конвертацией в приложении, иначе Ложь.
// 
Функция ОбъектФорматаПроходитПоФильтруXDTO(КомпонентыОбмена, ОбъектФормата) Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.ОбъектФорматаПроходитПоФильтруXDTO(КомпонентыОбмена, ОбъектФормата);
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.ПКОПоИмени().
//
// Параметры:
//   КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//   ИмяПКО - Строка - имя правила конвертации как оно задано в конвертации данных.
//
// Возвращаемое значение:
//   см. ОбменДаннымиXDTOСервер.ПКОПоИмени.
//
Функция ПКОПоИмени(КомпонентыОбмена, ИмяПКО) Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, ИмяПКО);
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.ПОДПоТипуОбъектаXDTO().
//
// Параметры:
//   КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//   ИмяОбъектаФормата - Строка - имя объекта формата, как оно задано в пакете EnterpriseData.
//   ВозвращатьПустоеЗначение - Булево - флаг, который регулирует обработку ситуации, когда ПОД отсутствует.
//           Если ИСТИНА, то отсутствие ПОД будет обыграно возвратом Неопределено.
//           Если ЛОЖЬ, то отсутствие ПОД приведет к вызову исключения.
//
// Возвращаемое значение:
//   СтрокаТаблицыЗначений - см. ОбменДаннымиXDTOСервер.ТаблицаПравилОбработкиДанных
//
Функция ПОДПоИмениОбъектаФорматаXDTO(КомпонентыОбмена, ИмяОбъектаФормата, ВозвращатьПустоеЗначение) Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.ПОДПоТипуОбъектаXDTO(КомпонентыОбмена, ИмяОбъектаФормата, ВозвращатьПустоеЗначение);
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.ПОДПоТипуОбъектаXDTO().
//
// Параметры:
//   КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//   ТипОбъектаXDTO - ТипОбъектаXDTO - тип объекта формата EnterpriseData.
//   ВозвращатьПустоеЗначение - Булево - флаг, который регулирует обработку ситуации, когда ПОД отсутствует.
//           Если ИСТИНА, то отсутствие ПОД будет обыграно возвратом Неопределено.
//           Если ЛОЖЬ, то отсутствие ПОД приведет к вызову исключения.
//
// Возвращаемое значение:
//   СтрокаТаблицыЗначений - см. ОбменДаннымиXDTOСервер.ТаблицаПравилОбработкиДанных
//
Функция ПОДПоТипуОбъектаXDTO(КомпонентыОбмена, ТипОбъектаXDTO, ВозвращатьПустоеЗначение) Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.ПОДПоТипуСсылкиXDTO(КомпонентыОбмена, ТипОбъектаXDTO, ВозвращатьПустоеЗначение);
	
КонецФункции

// Метод для вызова ОбменДаннымиПовтИсп.ПолучитьИмяПланаОбмена().
//
// Параметры:
//  УзелКорреспондента - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//
// Возвращаемое значение:
//  см. ОбменДаннымиПовтИсп.ПолучитьИмяПланаОбмена.
//
Функция ПолучитьИмяПланаОбмена(УзелКорреспондента) Экспорт
	
	Возврат ОбменДаннымиПовтИсп.ПолучитьИмяПланаОбмена(УзелКорреспондента);
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.ПравилаРегистрацииОбъектов().
//
// Параметры:
//  УзелКорреспондента - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//
// Возвращаемое значение:
//  см. ОбменДаннымиXDTOСервер.ПравилаРегистрацииОбъектов.
//
Функция ПравилаРегистрацииОбъектов(УзелКорреспондента) Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.ПравилаРегистрацииОбъектов(УзелКорреспондента);
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.ПредставлениеОбъектаДляПротокола().
//
// Параметры:
//  ПолученныеДанные - ЛюбаяСсылка - ссылка на любой ОМД,
//                   - СправочникСсылка.ИдентификаторыОбъектовМетаданных
//                   - ОбъектXDTO - объект XDTO;
//                   - Структура.
//  МетаданныеДляПредставленияСтруктуры - ОбъектМетаданных - метаданные объекта, для которого формируется представление.
//
// Возвращаемое значение:
//  см. ОбменДаннымиXDTOСервер.ПредставлениеОбъектаДляПротокола.
//
Функция ПредставлениеОбъектаДляПротокола(ПолученныеДанные, МетаданныеДляПредставленияСтруктуры = Неопределено) Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.ПредставлениеОбъектаДляПротокола(ПолученныеДанные, МетаданныеДляПредставленияСтруктуры);
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.РазрешенаЗаписьОбъекта().
//
// Параметры:
//   КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//   ДанныеИБ - ЛюбаяСсылка - объект информационной базы, который найден при идентификации загружаемых данных.
// 
// Возвращаемое значение:
//   Булево
//
Функция РазрешенаЗаписьОбъекта(КомпонентыОбмена, ДанныеИБ) Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.РазрешенаЗаписьОбъекта(ДанныеИБ, КомпонентыОбмена);
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.СвойстваУзлаПланаОбмена().
//
// Параметры:
//  УзелКорреспондента - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//
// Возвращаемое значение:
//  см. ОбменДаннымиXDTOСервер.СвойстваУзлаПланаОбмена.
//
Функция СвойстваУзлаПланаОбмена(УзелКорреспондента) Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.СвойстваУзлаПланаОбмена(УзелКорреспондента);
	
КонецФункции

// Метод для вызова ОбменДаннымиПовтИсп.СпособКонвертацииОбъектовXDTO()
//
// Параметры:
//  УзелКорреспондента - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//
// Возвращаемое значение:
//  см. ОбменДаннымиПовтИсп.СпособКонвертацииОбъектовXDTO.
//
Функция СпособКонвертацииОбъектовXDTO(УзелКорреспондента) Экспорт
	
	Возврат ОбменДаннымиПовтИсп.СпособКонвертацииОбъектовXDTO(УзелКорреспондента)
	
КонецФункции

// Метод для вызова РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.СсылкаНаОбъектПоПубличномуИдентификатору().
//
// Параметры:
//  УзелКорреспондента - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//  ВнешняяСсылка - Строка - строковое значение входящей ссылки, для которой ищем соответствие.
//  ОбъектФормата - Строка - имя объекта как оно задано в формате EnterpriseData.
//
// Возвращаемое значение:
//  ЛюбаяСсылка - ссылка, которая соответствует внешнему УИД.
//
Функция СсылкаНаОбъектПоПубличномуИдентификатору(УзелКорреспондента, ВнешняяСсылка, ОбъектФормата) Экспорт
	
	Возврат РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.СсылкаНаОбъектПоПубличномуИдентификатору(УзелКорреспондента, ВнешняяСсылка, ОбъектФормата);
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.ТаблицаПравилКонвертации().
//
// Параметры:
//  КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//  ТолькоПоддерживаемыеОбъектыФормата - Булево - Признак того, что требуется получить только заголовки объектов
//
// Возвращаемое значение:
//   ТаблицаЗначений - см. ОбменДаннымиXDTOСервер.КоллекцияПравилКонвертации.
//
Функция ТаблицаПравилКонвертации(Знач КомпонентыОбмена, ТолькоПоддерживаемыеОбъектыФормата = Ложь) Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.ТаблицаПравилКонвертации(КомпонентыОбмена, , ТолькоПоддерживаемыеОбъектыФормата);
	
КонецФункции

// Метод для вызова ОбменДаннымиОценкаПроизводительности.ТипСобытияБиблиотека().
//
// Возвращаемое значение:
//  Строка - имя "Подсистема обменов".
//
Функция ТипСобытияБиблиотека() Экспорт
	
	Возврат ОбменДаннымиОценкаПроизводительности.ТипСобытияБиблиотека();
	
КонецФункции

// Метод для вызова ОбменДаннымиXDTOСервер.ФорматОбмена().
//
// Параметры:
//  ИмяПланаОбмена - Строка - имя плана обмена, как оно задано в конфигураторе.
//  ВерсияФорматаОбмена - Строка - версия формата обмена EnterpriseData.
//
// Возвращаемое значение:
//  см. ОбменДаннымиXDTOСервер.ФорматОбмена.
//
Функция ФорматОбмена(ИмяПланаОбмена, ВерсияФорматаОбмена) Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.ФорматОбмена(ИмяПланаОбмена, ВерсияФорматаОбмена);
	
КонецФункции

// Метод для вызова ОбменДаннымиСервер.ЭтоПланОбменаXDTO().
//
// Параметры:
//  УзелКорреспондента - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//
// Возвращаемое значение:
//  см. ОбменДаннымиСервер.ЭтоПланОбменаXDTO.
//
Функция ЭтоПланОбменаXDTO(УзелКорреспондента) Экспорт
	
	Возврат ОбменДаннымиСервер.ЭтоПланОбменаXDTO(УзелКорреспондента);
	
КонецФункции

// Метод для вызова ОбменДаннымиПовтИсп.ЭтоСтроковыйРеквизитНеограниченнойДлины().
//
// Параметры:
//  ПолноеИмяМетаданных - Строка - полное имя объекта метаданных, в котором необходимо проверить тип указанного реквизита.
//  ИмяРеквизита - Строка - имя проверяемого реквизита, как оно задано в конфигураторе.
//
// Возвращаемое значение:
//  Булево - Истина, если это строка неограниченной длины.
//
Функция ЭтоСтроковыйРеквизитНеограниченнойДлины(ПолноеИмяМетаданных, ИмяРеквизита) Экспорт
	
	Возврат ОбменДаннымиПовтИсп.ЭтоСтроковыйРеквизитНеограниченнойДлины(ПолноеИмяМетаданных, ИмяРеквизита);
	
КонецФункции

#КонецОбласти

#Область Процедуры

// Метод для вызова ОбменДаннымиXDTOСервер.ВключитьПространствоИмен().
//
// Параметры:
//  КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//  РасширенноеПространствоИмен - Строка - URI расширения формата.
//  Псевдоним - Строка - псевдоним, который будет дописывается к пространству имен в именах узлов xml.
// 
Процедура ВключитьПространствоИмен(КомпонентыОбмена, РасширенноеПространствоИмен, Псевдоним = "ext") Экспорт
	
	ОбменДаннымиXDTOСервер.ВключитьПространствоИмен(КомпонентыОбмена, РасширенноеПространствоИмен, Псевдоним);
	
КонецПроцедуры

// Метод для вызова РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ДобавитьЗапись().
//
// Параметры:
//  СтруктураЗаписи - Структура - структура со значениями записи в регистр:
//                     * УзелИнформационнойБазы - ПланОбменаСсылка - узел плана обмена.
//                     * Ссылка - ЛюбаяСсылка - ссылка, которая будет выступать в качестве соответствия.
//                     * Идентификатор - Строка - внешняя ссылка (УИД).
//                     * СсылкаВнешняяНавигационная -Строка - навигационная ссылка на объект в источнике.
//  РежимЗагрузка - Булево - включить режим "ОбменДанными.Загрузка = Истина".
//  ДополнительныеСвойства - Структура - 
//
Процедура ДобавитьЗаписьПИСО(СтруктураЗаписи, РежимЗагрузка, ДополнительныеСвойства) Экспорт
	
	РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ДобавитьЗапись(СтруктураЗаписи, РежимЗагрузка, ДополнительныеСвойства);
	
КонецПроцедуры

// Метод для вызова ОбменДаннымиXDTOСервер.ДобавитьОбъектВФильтрРазрешенныхОбъектов().
//
// Параметры:
//   УзелКорреспондента - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//   ПодобраннаяОбъектнаяСсылка - СправочникСсылка, 
//                                ДокументСсылка - подобранная ссылка по запросу на повторную выгрузку данных.
//
Процедура ДобавитьОбъектВФильтрРазрешенныхОбъектов(УзелКорреспондента, ПодобраннаяОбъектнаяСсылка) Экспорт
	
	ОбменДаннымиXDTOСервер.ДобавитьОбъектВФильтрРазрешенныхОбъектов(ПодобраннаяОбъектнаяСсылка, УзелКорреспондента);
	
КонецПроцедуры

// Метод для вызова ОбменДаннымиОценкаПроизводительности.ЗавершитьЗамер().
//
// Параметры:
//  ВремяНачала - Дата - дата и время начала события.
//  ИмяСобытия - Строка - имя измеряемого события.
//  ОбъектСобытия - ЛюбаяСсылка, Структура - объект, по которому будет создано представление.
//  КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//  ТипСобытияБиблиотека - см. ОбменДаннымиОценкаПроизводительности.ТипСобытияБиблиотека.
// 
Процедура ЗавершитьЗамер(ВремяНачала, ИмяСобытия, ОбъектСобытия, КомпонентыОбмена, ТипСобытияБиблиотека) Экспорт
	
	ОбменДаннымиОценкаПроизводительности.ЗавершитьЗамер(ВремяНачала, ИмяСобытия, ОбъектСобытия, КомпонентыОбмена, ТипСобытияБиблиотека)
	
КонецПроцедуры

// Метод для вызова ОбменДаннымиXDTOСервер.ЗаполнитьПоддерживаемыеОбъектыXDTO().
//
// Параметры:
//  КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
// 
Процедура ЗаполнитьПоддерживаемыеОбъектыXDTO(КомпонентыОбмена) Экспорт
	
	ОбменДаннымиXDTOСервер.ЗаполнитьПоддерживаемыеОбъектыXDTO(КомпонентыОбмена);
	
КонецПроцедуры

// Метод для вызова ОбменДаннымиXDTOСервер.ЗаполнитьСтруктуруНастроекXDTO().
//
// Параметры:
//  КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
// 
Процедура ЗаполнитьСтруктуруНастроекXDTO(КомпонентыОбмена) Экспорт
	
	ОбменДаннымиXDTOСервер.ЗаполнитьСтруктуруНастроекXDTO(КомпонентыОбмена);
	
КонецПроцедуры

// Метод для вызова РегистрыСведений.ОбщиеНастройкиУзловИнформационныхБаз.ИзменитьСпособОбъектнойКонвертацииXDTO().
//
// Параметры:
//  УзелКорреспондента - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//  НовоеЗначение - Булево - значение, которое требуется установить.
//
Процедура ИзменитьСпособОбъектнойКонвертацииXDTO(УзелКорреспондента, НовоеЗначение) Экспорт
	
	РегистрыСведений.ОбщиеНастройкиУзловИнформационныхБаз.ИзменитьСпособОбъектнойКонвертацииXDTO(УзелКорреспондента, НовоеЗначение);
	
КонецПроцедуры

// Метод для вызова ОбменДаннымиXDTOСервер.ИнициализироватьТаблицыПравилОбмена().
//
// Параметры:
//  КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//  ТолькоПоддерживаемыеОбъектыФормата - Булево - Признак того, что требуется получить только заголовки объектов
//
Процедура ИнициализироватьТаблицыПравилОбмена(КомпонентыОбмена, ТолькоПоддерживаемыеОбъектыФормата = Ложь) Экспорт
	
	ОбменДаннымиXDTOСервер.ИнициализироватьТаблицыПравилОбмена(КомпонентыОбмена, ТолькоПоддерживаемыеОбъектыФормата);
	
КонецПроцедуры

// Метод для вызова ОбменДаннымиСлужебный.ОтключитьОбновлениеКлючейДоступа()
//
// Параметры:
//  ЗначениеОпции - Булево - когда Истина, то включить иначе выключить.
//
Процедура ОтключитьОбновлениеКлючейДоступа(ЗначениеОпции) Экспорт
	
	ОбменДаннымиСлужебный.ОтключитьОбновлениеКлючейДоступа(ЗначениеОпции);
	
КонецПроцедуры

// Метод для вызова ОбменДаннымиXDTOСервер.ОтменитьПроведениеОбъектаВИБ().
//
// Параметры:
//   КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//   УзелКорреспондента - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//   ДанныеИБ - ДокументОбъект - документ как объект, для которого выполняется попытка отмены проведения.
//
Процедура ОтменитьПроведениеОбъектаВИБ(КомпонентыОбмена, УзелКорреспондента, ДанныеИБ) Экспорт
	
	ОбменДаннымиXDTOСервер.ОтменитьПроведениеОбъектаВИБ(ДанныеИБ, УзелКорреспондента, КомпонентыОбмена);
	
КонецПроцедуры

// Метод для вызова ОбменДаннымиXDTOСервер.ПолучитьЗначениеВложенныхСвойств().
//
// Параметры:
//  ИсточникДанных - Структура - произвольные данные, которые прочитали из xml в структуру.
//  ВложенныеСвойства - Строка - имя свойства, которое указано через точку, например, Производитель.Наименование
//  ЗначениеСвойства - Произвольный - переменная, в которую будет сохранено значение вложенного свойства.
//
Процедура ПолучитьЗначениеВложенныхСвойств(ИсточникДанных, ВложенныеСвойства, ЗначениеСвойства) Экспорт
	
	ОбменДаннымиXDTOСервер.ПолучитьЗначениеВложенныхСвойств(ИсточникДанных, ВложенныеСвойства, ЗначениеСвойства)
	
КонецПроцедуры

// Метод для вызова ОбменДаннымиXDTOСервер.ПослеИнициализацииКомпонентыОбмена().
//
// Параметры:
//  КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
// 
Процедура ПослеИнициализацииКомпонентыОбмена(КомпонентыОбмена) Экспорт
	
	ОбменДаннымиXDTOСервер.ПослеИнициализацииКомпонентыОбмена(КомпонентыОбмена);
	
КонецПроцедуры

// Метод для вызова ОбменДаннымиПереопределяемый.ПриОпределенииПриоритетовКонвертации().
//
// Параметры:
//  ПространствоИменВерсииФормата - Строка - отбор, который указывает на пространство имен,
//                          чьи приоритеты заполняются. Допускается пустое значение
//                          или базовое значение (без номера). Примеры:
//                           1. {http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.2}
//                           2. {http://v8.1c.ru/edi/edi_stnd/EnterpriseData/}
//  ПриоритетыКонвертации - ТаблицаЗначений:
//   * ОбъектФормата - Строка - Расширенное имя типа объекта формата EnterpriseData.
//   * Приоритет - Число - приоритет, в котором должен конвертироваться объект формата.
//   * ПутьКДате - Строка - путь к свойству доп упорядочивания, для документов,
//                          как правило, это дата из ключевых свойств.
//
Процедура ПриОпределенииПриоритетовКонвертации(ПространствоИменВерсииФормата, ПриоритетыКонвертации) Экспорт
	
	ОбменДаннымиПереопределяемый.ПриОпределенииПриоритетовКонвертации(ПространствоИменВерсииФормата, ПриоритетыКонвертации);
	
КонецПроцедуры

// Метод для вызова ОбменДаннымиСобытия.ПриОтправкеДанныхКорреспонденту().
// Вызывается при обработке запроса на повторную выгрузку. 
//
// Цель метода:
// - проверить, что объект успешно проходит проверку перед выгрузкой и может быть выгружен.
//
// Параметры:
//   УзелКорреспондента - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//   ОтправкаЭлемента - ОтправкаЭлементаДанных - системное перечисление платформы.
//   ПодобраннаяОбъектнаяСсылка - СправочникСсылка, 
//                                ДокументСсылка - подобранная ссылка по запросу на повторную выгрузку данных.
//   ЭтоНачальнаяВыгрузкаДанных - Булево - свойство, которое используется в обменах РИБ.
//   ЭтоАнализДанных - Булево - свойство, которое регулирует необходимость работы с приоритетными данными в обменах РИБ.
//
Процедура ПриОтправкеДанныхКорреспонденту(УзелКорреспондента, ОтправкаЭлемента, ПодобраннаяОбъектнаяСсылка, ЭтоНачальнаяВыгрузкаДанных, ЭтоАнализДанных) Экспорт
	
	ОбменДаннымиСобытия.ПриОтправкеДанныхКорреспонденту(ПодобраннаяОбъектнаяСсылка, ОтправкаЭлемента, ЭтоНачальнаяВыгрузкаДанных, УзелКорреспондента, ЭтоАнализДанных);
	
КонецПроцедуры

// Метод для вызова ОбменДаннымиXDTOСервер.ПровестиГенерациюКодаНомераПриНеобходимости().
//
// Параметры:
//  ДанныеИБ - ЛюбаяСсылка - объект, в который загрузили данные.
//
Процедура ПровестиГенерациюКодаНомераПриНеобходимости(ДанныеИБ) Экспорт
	
	ОбменДаннымиXDTOСервер.ПровестиГенерациюКодаНомераПриНеобходимости(ДанныеИБ);
	
КонецПроцедуры

// Метод для вызова ОбменДаннымиXDTOСервер.СнятьПометкуУдаленияСПредопределенногоЭлемента().
//
// Параметры:
//  КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//  ТипДанных - ОбъектМетаданных - 
//  ДанныеИБ - ЛюбаяСсылка - объект информационной базы, который найден при идентификации загружаемых данных.
// 
Процедура СнятьПометкуУдаленияСПредопределенногоЭлемента(КомпонентыОбмена, ТипДанных, ДанныеИБ) Экспорт
	
	ОбменДаннымиXDTOСервер.СнятьПометкуУдаленияСПредопределенногоЭлемента(ДанныеИБ, ТипДанных, КомпонентыОбмена)
	
КонецПроцедуры

// Метод для вызова РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ДобавитьЗапись().
//
// Параметры:
//  СтруктураЗаписи - Структура - структура со значениями записи в регистр:
//                     * УзелИнформационнойБазы - ПланОбменаСсылка - узел плана обмена.
//                     * Ссылка - ЛюбаяСсылка - ссылка, которая будет выступать в качестве соответствия.
//                     * Идентификатор - Строка - внешняя ссылка (УИД).
//                     * СсылкаВнешняяНавигационная -Строка - навигационная ссылка на объект в источнике.
//  РежимЗагрузка - Булево - включить режим "ОбменДанными.Загрузка = Истина".
//
Процедура УдалитьЗаписьПИСО(СтруктураЗаписи, РежимЗагрузка) Экспорт
	
	РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.УдалитьЗапись(СтруктураЗаписи, РежимЗагрузка);
	
КонецПроцедуры

// Метод для вызова ОбменДаннымиСервер.УстановитьОбменДаннымиЗагрузка().
//
// Параметры:
//   УзелКорреспондента - ПланОбменаСсылка - признак необходимости регистрации данных к обратной отправке.
//   ДанныеИБ - Произвольный - объект, для которого устанавливается свойство.
//   ЗначениеЗагрузка - Булево - значение устанавливаемого свойства "Загрузка".
//   ОтправкаНазад - Булево - признак необходимости регистрации данных к обратной отправке.
//
Процедура УстановитьОбменДаннымиЗагрузка(УзелКорреспондента, ДанныеИБ, ЗначениеЗагрузка, ОтправкаНазад = Ложь) Экспорт
	
	ОбменДаннымиСервер.УстановитьОбменДаннымиЗагрузка(ДанныеИБ, ЗначениеЗагрузка, ОтправкаНазад, УзелКорреспондента);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
