///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокВыбора = Элементы.ВидПриложения.СписокВыбора;
	
	Если ЭлектроннаяПодпись.ОбщиеНастройки().ПроверятьЭлектронныеПодписиНаСервере 
		Или ЭлектроннаяПодпись.ОбщиеНастройки().СоздаватьЭлектронныеПодписиНаСервере Тогда
		СписокВыбора.Добавить("Приложение", НСтр("ru='Приложение электронной подписи на компьютере или сервере'"));
	Иначе
		СписокВыбора.Добавить("Приложение", НСтр("ru='Приложение электронной подписи на компьютере'"));
	КонецЕсли;

	Если ЭлектроннаяПодписьСлужебный.ИспользоватьСервисОблачнойПодписи() Тогда
		СписокВыбора.Добавить("ОблачнаяПодпись", НСтр("ru='Учетная запись сервиса DSS'"));
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.СервисМобильнойПодписи") Тогда
		МодульСервисМобильнойПодписи = ОбщегоНазначения.ОбщийМодуль("СервисМобильнойПодписи");
		Если МодульСервисМобильнойПодписи.ИспользоватьГосключ() Тогда
			СписокВыбора.Добавить("НастройкаОтправкиВГосключ", НСтр("ru='Настройка отправки в Госключ'"));
		КонецЕсли;
	КонецЕсли;
	
	Если СписокВыбора.Количество() = 1 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ВидПриложения = СписокВыбора[0].Значение;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	
	Закрыть(ВидПриложения);
	
КонецПроцедуры

#КонецОбласти
