///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПереданныеПараметры();
	
	Если История.Количество() > 1 Тогда
		
		Элементы.ВыбранныеПоляИстория.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПоляВыбраныКорректно() Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(ВыбранныеПоля);
	
КонецПроцедуры

&НаКлиенте
Процедура История(Команда)
	
	ОповещениеОВыбореРанееИспользовавшегосяВарианта = Новый ОписаниеОповещения("ПослеВыбораРанееИспользовавшегосяВарианта", ЭтотОбъект );
	
	РанееИспользовавшиесяПоляПредставления = РаботаСРезультатамиОбменаКлиентСервер.РанееИспользовавшиесяОтображаемыеПоля(История);
	
	ПоказатьВыборИзМеню(ОповещениеОВыбореРанееИспользовавшегосяВарианта,
	                    РанееИспользовавшиесяПоляПредставления,
	                    Элементы.ВыбранныеПоляИстория);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьПереданныеПараметры()
	
	ВыбранныеПоля = Параметры.ПоляПредставления;
	История       = Параметры.История;
	
	Если Не ПустаяСтрока(Параметры.ЗаголовокФормы) Тогда
		Заголовок = Параметры.ЗаголовокФормы;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Параметры.ТекстПояснения) Тогда
		Элементы.ДекорацияПояснение.Заголовок = Новый ФорматированнаяСтрока(Параметры.ТекстПояснения,, ЦветаСтиля.ПоясняющийТекст);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораРанееИспользовавшегосяВарианта(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("ЭлементСпискаЗначений") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	РаботаСРезультатамиОбменаКлиент.ОтразитьИзменениеОтображаемыхПолейПослеВыбораВариантаИзИстории(
		ВыбранныеПоля, История, Результат.Значение);
	
КонецПроцедуры

&НаКлиенте
Функция ПоляВыбраныКорректно()
	
	ПоляВыбраныКорректно = Истина;
	
	КоличествоВыбранныхПолей = 0;
	
	Для Каждого ЭлементСписка Из ВыбранныеПоля Цикл
		
		Если ЭлементСписка.Пометка Тогда
			
			КоличествоВыбранныхПолей = КоличествоВыбранныхПолей + 1;
			
			Если КоличествоВыбранныхПолей > 5 Тогда
				
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для отображения возможно выбрать не более 5 полей.'")
				                                                 ,,"ВыбранныеПоля");
				
				ПоляВыбраныКорректно = Ложь;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПоляВыбраныКорректно;
	
КонецФункции

#КонецОбласти
