///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Включает/отключает показ предупреждений о необходимости обновления курсов валют.
//
// Параметры:
//  ПоказыватьПредупреждение - Булево - при установке значения Ложь предупреждения показываться не будут.
//
Процедура ПриОпределенииНеобходимостиПоказаПредупрежденияОбУстаревшихКурсахВалют(ПоказыватьПредупреждение) Экспорт
	
КонецПроцедуры

// Определяет для объекта имя поля, по которому будет определяться валюта по умолчанию.
// 
// Параметры:
//  ТипОбъектаПечати - Тип - возможные типы ссылок СправочникСсылка, ДокументСсылка, ПланВидовХарактеристикСсылка,
//   ПланСчетовСсылка, ПланВидовРасчетаСсылка, БизнесПроцессСсылка, ЗадачаСсылка
//  ИмяПоляВалюты - Строка
// Пример:
//  Если ТипОбъектаПечати = Тип("ДокументСсылка.Заказ") Тогда
//      
//      ИмяПоляВалюты = "ВалютаДокумента";
//      
//  Иначе
//      
//      ИмяПоляВалюты = "ОбщееПоле.ВалютаУправленческогоУчета";
//      
//  КонецЕсли;
//
Процедура ПриОпределенииВалютыОбъектаПоУмолчанию(ТипОбъектаПечати, ИмяПоляВалюты) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
