///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверка, что форма открыта с нужными параметрами
	Если Не Параметры.Свойство("ИмяПланаОбмена") Тогда
		
		ВызватьИсключение НСтр("ru = 'Эта форма не предназначена для непосредственного открытия.'", ОбщегоНазначения.КодОсновногоЯзыка());
		
	КонецЕсли;
	
	ОбменДаннымиСервер.ПроверитьВозможностьАдминистрированияОбменов();
	
	ИнициализироватьРеквизитыФормы();
	
	ИнициализироватьСвойстваФормы();
	
	УстановитьНачальноеОтображениеЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьТаблицуЭтаповНастройки();
	ОбновитьОтображениеТекущегоСостоянияНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаСуществует   = Ложь;
	НастройкаЗавершена = Ложь;
	
	Если ЗначениеЗаполнено(Объект.УзелИнформационнойБазы) Тогда
		
		НастройкаЗавершена = НастройкаСинхронизацииЗавершена(Объект.УзелИнформационнойБазы);
		
		СсылкаСуществует = СсылкаСуществует(Объект.УзелИнформационнойБазы);
		Если Не СсылкаСуществует Тогда
			// Закрытие формы при удалении настройки синхронизации.
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.УзелИнформационнойБазы)
		Или Не НастройкаЗавершена
		Или (НастройкаРИБ И Не ПродолжениеНастройкиВПодчиненномУзлеРИБ И Не НачальныйОбразСоздан(Объект.УзелИнформационнойБазы))Тогда
		ТекстПредупреждения = НСтр("ru = 'Настройка синхронизации данных еще не завершена.
		|Завершить работу с помощником? Настройку можно будет продолжить позже.'");
		ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияПроизвольнойФормы(
			ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, "ЗакрытьФормуБезусловно");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		Оповестить("ЗакрытаФормаПомощникаСозданияОбменаДанными");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыборТипаТранспорта(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяПланаОбмена", Неопределено);
	ПараметрыФормы.Вставить("ИдентификаторТранспорта", Неопределено);
	ПараметрыФормы.Вставить("ИдентификаторНастройки", Неопределено);
	ПараметрыФормы.Вставить("ВариантРаботыМастера", Неопределено);

	ЗаполнитьЗначенияСвойств(ПараметрыФормы, Объект);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыборТипаТранспортаЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.ПомощникСозданияОбменаДанными.Форма.ВыборТипаТранспорта",
		ПараметрыФормы, ЭтотОбъект,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодробноеОписаниеСинхронизацииДанных(Команда)
	
	ОбменДаннымиКлиент.ОткрытьПодробноеОписаниеСинхронизации(ОписаниеВариантаНастройки.ПодробнаяИнформацияПоОбмену);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПараметрыПодключения(Команда)
		
	ПолноеИмяФормыНастройки = ТранспортСообщенийОбменаВызовСервера.ПолноеИмяФормыПервойНастройки(Объект.ИдентификаторТранспорта);
	
	НастройкиПодключения = ТранспортСообщенийОбменаКлиентСервер.НастройкиПодключенияПоОбработке(Объект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НастройкиПодключения", НастройкиПодключения);
	ПараметрыФормы.Вставить("ИдентификаторНастройки", НастройкиПодключения.ИдентификаторНастройки);
	ПараметрыФормы.Вставить("НастройкиТранспорта", НастройкиПодключения.НастройкиТранспорта);
		
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдентификаторТранспорта", Объект.ИдентификаторТранспорта);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастроитьПараметрыПодключенияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму(ПолноеИмяФормыНастройки, ПараметрыФормы,,,,, 
		ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОбщиеПараметры(Команда)
	
	Если ЗначениеЗаполнено(Объект.ДанныеАутентификации) Тогда
		НастроитьОбщиеПараметрыПродолжение();
		Возврат;
	КонецЕсли;
	
	ПараметрыАутентификации = ТранспортСообщенийОбменаКлиент.ПараметрыАутентификации();
	ПараметрыАутентификации.Корреспондент = Объект.УзелИнформационнойБазы;
	ПараметрыАутентификации.ИмяПланаОбмена = Объект.ИмяПланаОбмена;
	ПараметрыАутентификации.ИдентификаторТранспорта = Объект.ИдентификаторТранспорта;
	ПараметрыАутентификации.НастройкиТранспорта = Объект.НастройкиТранспорта;
	
	ТребуетсяАутентификация = Ложь;
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастроитьОбщиеПараметрыЗавершениеАутентификации", ЭтотОбъект);
	ТранспортСообщенийОбменаКлиент.НачалоАутентификации(ПараметрыАутентификации, ТребуетсяАутентификация, ОповещениеОЗакрытии);
	
	Если НЕ ТребуетсяАутентификация Тогда
		НастроитьОбщиеПараметрыПродолжение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПодтверждениеПодключения(Команда)
		
	Если ПолученыНастройкиXDTOКорреспондента(Объект.УзелИнформационнойБазы) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Подключение подтверждено.'"));
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ОбменДаннымиСВнешнимиСистемами") Тогда
		Контекст = Новый Структура;
		Контекст.Вставить("Режим",                  "ПодтверждениеПодключения");
		Контекст.Вставить("Корреспондент",          Объект.УзелИнформационнойБазы);
		Контекст.Вставить("ИдентификаторНастройки", "ИдентификаторНастройки");
		Контекст.Вставить("ПараметрыПодключения",   ПараметрыПодключенияВнешнейСистемы);
		
		Отказ = Ложь;
		ИмяФормыПомощника  = "";
		ПараметрыПомощника = Новый Структура;
		
		МодульОбменДаннымиСВнешнимиСистемамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбменДаннымиСВнешнимиСистемамиКлиент");
		МодульОбменДаннымиСВнешнимиСистемамиКлиент.ПередНастройкойПараметровПодключения(
			Контекст, Отказ, ИмяФормыПомощника, ПараметрыПомощника);
		
		Если Не Отказ Тогда
			ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПолучитьПодтверждениеПодключенияЗавершение", ЭтотОбъект);
			ОткрытьФорму(ИмяФормыПомощника,
				ПараметрыПомощника, ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПравилаОтправкиИПолученияДанных(Команда)
	
	ОповещениеПродолжения = Новый ОписаниеОповещения("НастроитьПравилаОтправкиИПолученияДанныхПродолжение", ЭтотОбъект);
	
	// Для плана обмена XDTO перед настройкой правил выгрузки и загрузки
	// должны быть получены настройки корреспондента.
	Если НастройкаXDTO Тогда
		ПрерватьНастройку = Ложь;
		ВыполнитьЗагрузкуНастроекXDTOПриНеобходимости(ПрерватьНастройку, ОповещениеПродолжения);
		
		Если ПрерватьНастройку Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ПродолжитьНастройку",            Истина);
	Результат.Вставить("ПолученыДанныеДляСопоставления", ПолученыДанныеДляСопоставления);
	
	ВыполнитьОбработкуОповещения(ОповещениеПродолжения, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНачальныйОбразРИБ(Команда)
	
	ПараметрыПомощника = Новый Структура("Ключ, Узел", Объект.УзелИнформационнойБазы, Объект.УзелИнформационнойБазы);
			
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("СоздатьНачальныйОбразРИБЗавершение", ЭтотОбъект);
	ОткрытьФорму(ИмяФормыСозданияНачальногоОбраза,
		ПараметрыПомощника, ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСопоставлениеИЗагрузкуДанных(Команда)
	
	ОповещениеПродолжения = Новый ОписаниеОповещения("ВыполнитьСопоставлениеИЗагрузкуДанныхПродолжение", ЭтотОбъект);
	
	ПараметрыПомощника = Новый Структура;
	ПараметрыПомощника.Вставить("ОтправитьДанные",     Ложь);
	ПараметрыПомощника.Вставить("НастройкаРасписания", Ложь);
	
	Если ЭтоОбменСПриложениемВСервисе Тогда
		ПараметрыПомощника.Вставить("ОбластьДанныхКорреспондента", ОбластьДанныхКорреспондента);
	КонецЕсли;
	
	ВспомогательныеПараметры = Новый Структура;
	ВспомогательныеПараметры.Вставить("ПараметрыПомощника",  ПараметрыПомощника);
	ВспомогательныеПараметры.Вставить("ОповещениеОЗакрытии", ОповещениеПродолжения);
	
	ОбменДаннымиКлиент.ОткрытьПомощникСопоставленияОбъектовОбработкаКоманды(Объект.УзелИнформационнойБазы,
		ЭтотОбъект, ВспомогательныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНачальнуюВыгрузкуДанных(Команда)

	Отказ = Ложь;
	
	ПередВыполнениемНачальнойВыгрузки(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДанныеАутентификации) Тогда
		ВыполнитьНачальнуюВыгрузкуДанныхПродолжение();
		Возврат;
	КонецЕсли;
	
	ПараметрыАутентификации = ТранспортСообщенийОбменаКлиент.ПараметрыАутентификации();
	ПараметрыАутентификации.Корреспондент = Объект.УзелИнформационнойБазы;
	ПараметрыАутентификации.ИмяПланаОбмена = Объект.ИмяПланаОбмена;
	ПараметрыАутентификации.ИдентификаторТранспорта = Объект.ИдентификаторТранспорта;
	ПараметрыАутентификации.НастройкиТранспорта = Объект.НастройкиТранспорта;
	
	ТребуетсяАутентификация = Ложь;
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыполнитьНачальнуюВыгрузкуДанныхЗавершениеАутентификации", ЭтотОбъект);
	ТранспортСообщенийОбменаКлиент.НачалоАутентификации(ПараметрыАутентификации, ТребуетсяАутентификация, ОповещениеОЗакрытии);
	
	Если НЕ ТребуетсяАутентификация Тогда
		ВыполнитьНачальнуюВыгрузкуДанныхПродолжение();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьДействияПриЗагрузкеДанных(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодтвержденияДействийПриЗагрузкеДанных", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("УзелПланаОбмена", Объект.УзелИнформационнойБазы);
	ПараметрыОткрытия.Вставить("ТребующиеПодтверждения", Истина);
	
	ИмяФормыПодтверждения = "РегистрСведений.ДействияПриПолученииДанныхОбмена.Форма.НастройкаДействий";
	ОткрытьФорму(ИмяФормыПодтверждения, ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьПервоначальныеДанные(Команда)
	
	ТекущийЭтапНастройки = "ЧтениеДанных";
	ПолучитьПрочитатьСообщениеОбменаОбъектнойКонвертации();
	
КонецПроцедуры

&НаКлиенте
Процедура РассмотретьПроблемыЗагрузкиПервоначальныхДанных(Команда)
	
	ТекущийЭтапНастройки = "ПроблемыЗагрузки";
	ОткрытьРезультатыОбъектнойСинхронизации();
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьПервоначальныеДанныеПомощником(Команда)
	
	Если ЕстьДанныеДляРучногоСопоставления(Объект.УзелИнформационнойБазы) Тогда
		
		ТекущийЭтапНастройки = "СопоставлениеПервоначальныхДанных";
		ОткрытьФормуРучногоСопоставленияДанных();
		
	Иначе
		
		ТекстПредупреждения = НСтр("ru ='Отсутствуют данные для сопоставления.'");
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения, 15);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьНачальнуюВыгрузкуДанныхЗавершениеАутентификации(ДанныеАутентификации, ДополнительныеПараметры) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(ДанныеАутентификации) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДанныеАутентификации = ДанныеАутентификации;
	
	ВыполнитьНачальнуюВыгрузкуДанныхПродолжение();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНачальнуюВыгрузкуДанныхПродолжение()
	
	ПараметрыПомощника = Новый Структура;
	ПараметрыПомощника.Вставить("УзелОбмена", Объект.УзелИнформационнойБазы);
	ПараметрыПомощника.Вставить("НачальнаяВыгрузка");
	ПараметрыПомощника.Вставить("ДанныеАутентификации", Объект.ДанныеАутентификации);
	
	Если МодельСервиса Тогда
		ПараметрыПомощника.Вставить("ЭтоОбменСПриложениемВСервисе", ЭтоОбменСПриложениемВСервисе);
		ПараметрыПомощника.Вставить("ОбластьДанныхКорреспондента",  ОбластьДанныхКорреспондента);
	КонецЕсли;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыполнитьНачальнуюВыгрузкуДанныхЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ПомощникИнтерактивногоОбменаДанными.Форма.ВыгрузкаДанныхДляСопоставления",
		ПараметрыПомощника, ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОбщиеПараметрыЗавершениеАутентификации(ДанныеАутентификации, ДополнительныеПараметры) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(ДанныеАутентификации) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДанныеАутентификации = ДанныеАутентификации;
	
	НастроитьОбщиеПараметрыПродолжение();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОбщиеПараметрыПродолжение()

	ПараметрыФормы = Новый Структура;
	
	НастройкиПодключения = ТранспортСообщенийОбменаКлиентСервер.СтруктураНастроекПодключения();
	ЗаполнитьЗначенияСвойств(НастройкиПодключения, Объект);
	
	НастройкиПодключения.ИмяПланаОбмена = Объект.ИмяПланаОбмена;
	НастройкиПодключения.ИдентификаторНастройки = Объект.ИдентификаторНастройки;
	
	ПараметрыФормы.Вставить("НастройкиПодключения", НастройкиПодключения);
	
	Если ПродолжениеНастройкиВПодчиненномУзлеРИБ Тогда
		ПараметрыФормы.Вставить("ПродолжениеНастройкиВПодчиненномУзлеРИБ");
	КонецЕсли;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастройкаОбщихПараметровЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.ПомощникСозданияОбменаДанными.Форма.НастройкаОбщихПараметров", 
		ПараметрыФормы, ЭтотОбъект,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРезультатыОбъектнойСинхронизации()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПросмотраРезультатовОбъектнойСинхронизации", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("УзелИнформационнойБазы", Объект.УзелИнформационнойБазы);
	
	ИмяФормыРезультатов = "Обработка.РаботаСРезультатамиОбмена.Форма.РазборРезультатовПообъектногоОбмена";
	ОткрытьФорму(ИмяФормыРезультатов, ПараметрыОткрытия, ЭтотОбъект, Объект.УзелИнформационнойБазы, , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРучногоСопоставленияДанных()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеРучногоСопоставленияДанных", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("УзелИнформационнойБазы", Объект.УзелИнформационнойБазы);
	
	ИмяФормыСопоставления = "Обработка.РаботаСРезультатамиОбмена.Форма.ОбъектыКПоискуИУстановкеСоответствий";
	ОткрытьФорму(ИмяФормыСопоставления, ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияДействийПриЗагрузкеДанных(Результат, ДополнительныеПараметры) Экспорт
	
	Контекст = КонтекстОбъектнойНастройкиСинхронизации(Объект.УзелИнформационнойБазы);
	
	Если ТекущийЭтапНастройки = "ДействияПриЗагрузкеДанных"
		И НЕ Контекст.ЕстьДанныеДляРучногоСопоставления
		И НЕ Контекст.ЕстьПроблемыПриЗагрузке
		И НЕ Контекст.НужноПодтвердитьДействияПриПолученииДанныхОбмена
		Тогда
		
		Если Контекст.БылоОтправленоСообщениеОбмена Тогда
			
			ЗавершитьНастройкуСинхронизацииДанных(Объект.УзелИнформационнойБазы, Объект.ЭтоУзелОбъектнойКонвертации);
			
		КонецЕсли;
		
		ПерейтиКСледующемуЭтапуНастройки();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПросмотраРезультатовОбъектнойСинхронизации(Результат, ДополнительныеПараметры) Экспорт
	
	Контекст = КонтекстОбъектнойНастройкиСинхронизации(Объект.УзелИнформационнойБазы);
	
	Если ТекущийЭтапНастройки = "ПроблемыЗагрузки"
		И НЕ Контекст.ЕстьДанныеДляРучногоСопоставления
		И НЕ Контекст.ЕстьПроблемыПриЗагрузке
		Тогда
		
		Если Контекст.БылоОтправленоСообщениеОбмена Тогда
			
			ЗавершитьНастройкуСинхронизацииДанных(Объект.УзелИнформационнойБазы, Объект.ЭтоУзелОбъектнойКонвертации);
			
		КонецЕсли;
		
		ПерейтиКСледующемуЭтапуНастройки();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеРучногоСопоставленияДанных(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТекущийЭтапНастройки = "СопоставлениеПервоначальныхДанных"
		И НЕ ЕстьДанныеДляРучногоСопоставления(Объект.УзелИнформационнойБазы) Тогда
		
		ПерейтиКСледующемуЭтапуНастройки();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПрочитатьСообщениеОбменаОбъектнойКонвертации()
	
	КонтекстДо = КонтекстОбъектнойНастройкиСинхронизации(Объект.УзелИнформационнойБазы);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПолученияСообщенияОбъектнойКонвертации", ЭтотОбъект, КонтекстДо);
	
	ПараметрыПомощника = Новый Структура;
	ПараметрыПомощника.Вставить("ОтправитьДанные",     Ложь);
	ПараметрыПомощника.Вставить("НастройкаРасписания", Ложь);
	ПараметрыПомощника.Вставить("ОбъектнаяКонвертацияXDTO", Объект.ЭтоУзелОбъектнойКонвертации);
	ПараметрыПомощника.Вставить("ЗакрытьФормуБезусловно", (Объект.ЭтоУзелОбъектнойКонвертации = ИСТИНА));
	
	Если ЭтоОбменСПриложениемВСервисе Тогда
		
		ПараметрыПомощника.Вставить("ОбластьДанныхКорреспондента", ОбластьДанныхКорреспондента);
		
	КонецЕсли;
	
	ВспомогательныеПараметры = Новый Структура;
	ВспомогательныеПараметры.Вставить("ПараметрыПомощника",  ПараметрыПомощника);
	ВспомогательныеПараметры.Вставить("ОповещениеОЗакрытии", ОписаниеОповещения);
	
	ОбменДаннымиКлиент.ОткрытьПомощникСопоставленияОбъектовОбработкаКоманды(Объект.УзелИнформационнойБазы,
		ЭтотОбъект, ВспомогательныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияСообщенияОбъектнойКонвертации(Результат, ДополнительныеПараметры) Экспорт
	
	// Должны пройти далее в 2 сценариях:
	// 1. Если прочитаны настройки корреспондента, тогда делаем в этой ИБ первую выгрузку;
	// 2. Если прочитано (получено) первое сообщение с данными от корреспондента, тогда сопоставление и т.д..
	КонтекстДО = ДополнительныеПараметры;
	
	ЭтоБылоЧтениеНастроек = (КонтекстДО.ПолученыНастройкиXDTO = ЛОЖЬ);
	ЭтоБылоЧтениеСообщения = (КонтекстДО.ПолученыНастройкиXDTO = ИСТИНА И КонтекстДО.БылоПолученоСообщениеОбмена = ЛОЖЬ);
	
	Если ЭтоБылоЧтениеНастроек Тогда
		
		ТекущийЭтапНастройки = "НачальнаяВыгрузкаДанных";
		ОбновитьОтображениеТекущегоСостоянияНастройки();
		
	ИначеЕсли ЭтоБылоЧтениеСообщения Тогда
		
		Контекст = КонтекстОбъектнойНастройкиСинхронизации(Объект.УзелИнформационнойБазы);
		Если НЕ Контекст.БылоПолученоСообщениеОбмена Тогда
			
			ТекущийЭтапНастройки = "ЧтениеДанных";
			ОбновитьОтображениеТекущегоСостоянияНастройки();
			
			ТекстПредупреждения = НСтр("ru ='Отсутствуют данные для получения (нет новых сообщений).'");
			ПоказатьПредупреждение(Неопределено, ТекстПредупреждения, 10);
			
		ИначеЕсли Контекст.ЕстьДанныеДляРучногоСопоставления Тогда
			
			ТекущийЭтапНастройки = "СопоставлениеПервоначальныхДанных";
			ЗаполнитьТаблицуЭтаповНастройки();
			ОбновитьОтображениеТекущегоСостоянияНастройки();
			
		ИначеЕсли Контекст.ЕстьПроблемыПриЗагрузке Тогда
			
			ТекущийЭтапНастройки = "ПроблемыЗагрузки";
			ЗаполнитьТаблицуЭтаповНастройки();
			ОбновитьОтображениеТекущегоСостоянияНастройки();
			
		ИначеЕсли Контекст.НужноПодтвердитьДействияПриПолученииДанныхОбмена Тогда
			
			ТекущийЭтапНастройки = "ДействияПриЗагрузкеДанных";
			ЗаполнитьТаблицуЭтаповНастройки();
			ОбновитьОтображениеТекущегоСостоянияНастройки();
			
		Иначе
			
			ПерейтиКСледующемуЭтапуНастройки();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередВыполнениемНачальнойВыгрузки(Отказ)
	
	// Для переопределения
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СостояниеНастройкиСинхронизации(УзелОбмена)
	
	Результат = Новый Структура;
	Результат.Вставить("НастройкаСинхронизацииЗавершена",           НастройкаСинхронизацииЗавершена(УзелОбмена));
	Результат.Вставить("НачальныйОбразСоздан",                      НачальныйОбразСоздан(УзелОбмена));
	Результат.Вставить("ПолученоСообщениеСДаннымиДляСопоставления", ОбменДаннымиСервер.ПолученоСообщениеСДаннымиДляСопоставления(УзелОбмена));
	Результат.Вставить("ПолученыНастройкиXDTOКорреспондента",       ПолученыНастройкиXDTOКорреспондента(УзелОбмена));
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолученыНастройкиXDTOКорреспондента(УзелОбмена)
	
	Если УзелОбмена = Неопределено Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	НастройкиКорреспондента = ОбменДаннымиXDTOСервер.ПоддерживаемыеОбъектыФорматаКорреспондента(УзелОбмена, "ОтправкаПолучение");
	
	Возврат НастройкиКорреспондента.Количество() > 0;
	
КонецФункции

&НаСервереБезКонтекста
Функция НачальныйОбразСоздан(УзелОбмена)
	
	Возврат РегистрыСведений.ОбщиеНастройкиУзловИнформационныхБаз.НачальныйОбразСоздан(УзелОбмена);
	
КонецФункции

&НаКлиенте
Процедура НастроитьПараметрыПодключенияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.НастройкиТранспорта = РезультатЗакрытия;
	
	Если ТекущийЭтапНастройки = "НастройкаПодключения" Тогда
		ПерейтиКСледующемуЭтапуНастройки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура ВыборТипаТранспортаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Для Каждого КлючИЗначение Из РезультатЗакрытия Цикл
		Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			Объект[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
		КонецЕсли;
	КонецЦикла;
	
	ЕстьНастройкиТранспорта = ЗначениеЗаполнено(Объект.НастройкиТранспорта);

	Если Объект.ВариантРаботыМастера = "ПродолжитьНастройкуОбменаДанными" Тогда
		ТекущийЭтапНастройки = "ВыборТипаТранспорта";
	КонецЕсли;
	
	Если ТекущийЭтапНастройки = "ВыборТипаТранспорта" Тогда
		
		ПерейтиКСледующемуЭтапуНастройки();
		
		Если Объект.ВариантРаботыМастера = "ПродолжитьНастройкуОбменаДанными" 
			И ЕстьНастройкиТранспорта
			И НЕ НастройкаУзлаВКорреспондентеНаСервере() Тогда
			
			ПерейтиКСледующемуЭтапуНастройки();
			
		КонецЕсли;
		
	ИначеЕсли ТекущийЭтапНастройки = "НастройкаПодключения"
		И Объект.ВариантРаботыМастера = "ПродолжитьНастройкуОбменаДанными" 
		И ЕстьНастройкиТранспорта
		И НЕ НастройкаУзлаВКорреспондентеНаСервере() Тогда
		
		ПерейтиКСледующемуЭтапуНастройки();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НастройкаУзлаВКорреспондентеНаСервере()
	
	Возврат ТранспортСообщенийОбмена.ПараметрТранспорта(
		Объект.ИдентификаторТранспорта, "НастройкаУзлаВКорреспонденте");
	
КонецФункции

&НаКлиенте
Процедура НастройкаОбщихПараметровЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.УзелИнформационнойБазы = РезультатЗакрытия.УзелОбмена;
	
	Если ЗначениеЗаполнено(Объект.ДанныеАутентификации) Тогда
		ТранспортСообщенийОбменаВызовСервера.УстановитьПарольСинхронизацииДанных(
			Объект.УзелИнформационнойБазы, Объект.ДанныеАутентификации);
	КонецЕсли;
		
	Если РезультатЗакрытия.Свойство("ЕстьДанныеДляСопоставления")
		И РезультатЗакрытия.ЕстьДанныеДляСопоставления Тогда
		ПолученыДанныеДляСопоставления = Истина;
	КонецЕсли;
	
	ЗаполнитьТаблицуЭтаповНастройки();
	ОбновитьОтображениеТекущегоСостоянияНастройки();
	
	Если ТекущийЭтапНастройки = "ОбщиеПараметры" Тогда
		ПерейтиКСледующемуЭтапуНастройки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПодтверждениеПодключенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ПолученыНастройкиXDTOКорреспондента(Объект.УзелИнформационнойБазы) Тогда
		ПерейтиКСледующемуЭтапуНастройки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуНастроекXDTOПриНеобходимости(ПрерватьНастройку, ОповещениеПродолжения)
	
	СостояниеНастройки = СостояниеНастройкиСинхронизации(Объект.УзелИнформационнойБазы);
	Если Не СостояниеНастройки.НастройкаСинхронизацииЗавершена
		И Не СостояниеНастройки.ПолученыНастройкиXDTOКорреспондента Тогда
		
		ПараметрыЗагрузки = Новый Структура;
		ПараметрыЗагрузки.Вставить("УзелОбмена", Объект.УзелИнформационнойБазы);
		
		ОткрытьФорму("Обработка.ПомощникСозданияОбменаДанными.Форма.ЗагрузкаНастроекXDTO",
			ПараметрыЗагрузки, ЭтотОбъект, , , , ОповещениеПродолжения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		ПрерватьНастройку = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПравилаОтправкиИПолученияДанныхПродолжение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура")
		ИЛИ Не РезультатЗакрытия.ПродолжитьНастройку Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если РезультатЗакрытия.ПолученыДанныеДляСопоставления
		И Не ПолученыДанныеДляСопоставления Тогда
		ПолученыДанныеДляСопоставления = РезультатЗакрытия.ПолученыДанныеДляСопоставления;
	КонецЕсли;
	
	ЗаполнитьТаблицуЭтаповНастройки();
	ОбновитьОтображениеТекущегоСостоянияНастройки();
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастроитьПравилаОтправкиИПолученияДанныхЗавершение", ЭтотОбъект);
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("Корреспондент",          Объект.УзелИнформационнойБазы);
	ПараметрыПроверки.Вставить("ИмяПланаОбмена",         Объект.ИмяПланаОбмена);
	ПараметрыПроверки.Вставить("ИдентификаторНастройки", Объект.ИдентификаторНастройки);
	
	НастройкаВыполнена = Ложь;
	ПередНастройкойСинхронизацииДанных(ПараметрыПроверки, НастройкаВыполнена, ИмяФормыПомощникаНастройкиСинхронизацииДанных);
	
	Если НастройкаВыполнена Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Настройка правил отправки и получения данных выполнена.'"));
		ВыполнитьОбработкуОповещения(ОповещениеОЗакрытии, Истина);
		Возврат;
	КонецЕсли;
	
	ПараметрыПомощника = Новый Структура;
	
	Если ПустаяСтрока(ИмяФормыПомощникаНастройкиСинхронизацииДанных) Тогда
		ПараметрыПомощника.Вставить("Ключ", Объект.УзелИнформационнойБазы);
		ПараметрыПомощника.Вставить("ИмяФормыПомощника", "ПланОбмена.[ИмяПланаОбмена].ФормаОбъекта");
		
		ПараметрыПомощника.ИмяФормыПомощника = СтрЗаменить(ПараметрыПомощника.ИмяФормыПомощника,
			"[ИмяПланаОбмена]", Объект.ИмяПланаОбмена);
	Иначе
		ПараметрыПомощника.Вставить("УзелОбмена", Объект.УзелИнформационнойБазы);
		ПараметрыПомощника.Вставить("ИмяФормыПомощника", ИмяФормыПомощникаНастройкиСинхронизацииДанных);
	КонецЕсли;
	
	ОткрытьФорму(ПараметрыПомощника.ИмяФормыПомощника,
		ПараметрыПомощника, ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПравилаОтправкиИПолученияДанныхЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТекущийЭтапНастройки = "НастройкаПравил" Тогда
		
		Если Объект.ЭтоУзелОбъектнойКонвертации Тогда
			
			Контекст = КонтекстОбъектнойНастройкиСинхронизации(Объект.УзелИнформационнойБазы);
			Если Контекст.ПолученыНастройкиXDTO
				И НЕ Контекст.БылоОтправленоСообщениеОбмена
				И НЕ Контекст.БылоПолученоСообщениеОбмена
				И НЕ ПолученыДанныеДляСопоставления
				Тогда
				
				ТекущийЭтапНастройки = "НачальнаяВыгрузкаДанных";
				ОбновитьОтображениеТекущегоСостоянияНастройки();
				
			ИначеЕсли Контекст.ПолученыНастройкиXDTO
				И ПолученыДанныеДляСопоставления
				И Не Контекст.БылоПолученоСообщениеОбмена Тогда
				
				ТекущийЭтапНастройки = "ЧтениеДанных";
				ОбновитьОтображениеТекущегоСостоянияНастройки();
				
			ИначеЕсли Контекст.ПолученыНастройкиXDTO
				И Контекст.БылоПолученоСообщениеОбмена Тогда
				
				ЗаполнитьТаблицуЭтаповНастройки();
				
				Если Контекст.ЕстьДанныеДляРучногоСопоставления Тогда
					
					ТекущийЭтапНастройки = "СопоставлениеПервоначальныхДанных";
					
				ИначеЕсли Контекст.ЕстьПроблемыПриЗагрузке Тогда
					
					ТекущийЭтапНастройки = "ПроблемыЗагрузки";
					
				ИначеЕсли Контекст.НужноПодтвердитьДействияПриПолученииДанныхОбмена Тогда
					
					ТекущийЭтапНастройки = "ДействияПриЗагрузкеДанных";
					
				Иначе
					
					ТекущийЭтапНастройки = "НачальнаяВыгрузкаДанных";
					
				КонецЕсли;
				
				ОбновитьОтображениеТекущегоСостоянияНастройки();
				
			КонецЕсли;
			
		ИначеЕсли НастройкаСинхронизацииЗавершена(Объект.УзелИнформационнойБазы) Тогда
			
			Оповестить("Запись_УзелПланаОбмена");
			Если ПродолжениеНастройкиВПодчиненномУзлеРИБ Тогда
				ОбновитьИнтерфейс();
			КонецЕсли;
			ПерейтиКСледующемуЭтапуНастройки();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСопоставлениеИЗагрузкуДанныхПродолжение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТекущийЭтапНастройки = "СопоставлениеИЗагрузка"
		И ВыполненаЗагрузкаДанныхДляСопоставления(Объект.УзелИнформационнойБазы) Тогда
		ПерейтиКСледующемуЭтапуНастройки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНачальныйОбразРИБЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТекущийЭтапНастройки = "НачальныйОбразРИБ"
		И НачальныйОбразСоздан(Объект.УзелИнформационнойБазы) Тогда
		ПерейтиКСледующемуЭтапуНастройки();
	КонецЕсли;
	
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНачальнуюВыгрузкуДанныхЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТекущийЭтапНастройки = "НачальнаяВыгрузкаДанных"
		И РезультатЗакрытия = Объект.УзелИнформационнойБазы Тогда
		
		ПерейтиКСледующемуЭтапуНастройки();
		
		Если ТекущийЭтапНастройки = "" Тогда
			
			ЗавершитьНастройкуСинхронизацииДанных(Объект.УзелИнформационнойБазы, Объект.ЭтоУзелОбъектнойКонвертации);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.ЭтоУзелОбъектнойКонвертации Тогда
		
		Контекст = КонтекстОбъектнойНастройкиСинхронизации(Объект.УзелИнформационнойБазы);
		Если ТекущийЭтапНастройки = ""
			И Контекст.ПолученыНастройкиXDTO
			И НЕ Контекст.БылоПолученоСообщениеОбмена
			И Контекст.БылоОтправленоСообщениеОбмена
			Тогда
			
			ТекстПредупреждения = НСтр("ru ='После обработки выгруженных
				|данных в приемнике (корреспонденте)
				|вернитесь в помощник синхронизации
				|и завершите настройку.'");
			
			ПоказатьПредупреждение(Неопределено, ТекстПредупреждения, 20);
			
			ЗакрытьФормуБезусловно = Истина;
			Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеТекущегоСостоянияНастройки()
	
	// Видимость элементов настройки.
	Для Каждого ЭтапНастройки Из ЭтапыНастройки Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ЭтапНастройки.Группа, "Видимость", ЭтапНастройки.Используется);
	КонецЦикла;
	
	Если ПустаяСтрока(ТекущийЭтапНастройки) Тогда
		// Все этапы завершены.
		Для Каждого ЭтапНастройки Из ЭтапыНастройки Цикл
			Элементы[ЭтапНастройки.Группа].Доступность = Истина;
			Элементы[ЭтапНастройки.Кнопка].Шрифт = ОбщегоНазначенияКлиент.ШрифтСтиля("КомандаПомощникаНастройкиСинхронизацииОбычнаяШрифт");
			
			// Зеленый флажок только для основных этапов настройки.
			Если ЭтапНастройки.Основное Тогда
				Элементы[ЭтапНастройки.Панель].ТекущаяСтраница = Элементы[ЭтапНастройки.СтраницаУспешно];
			Иначе
				Элементы[ЭтапНастройки.Панель].ТекущаяСтраница = Элементы[ЭтапНастройки.СтраницаПустой];
			КонецЕсли;
		КонецЦикла;
	Иначе
		
		ТекущийЭтапНайден = Ложь;
		Для Каждого ЭтапНастройки Из ЭтапыНастройки Цикл
			Если ЭтапНастройки.Название = ТекущийЭтапНастройки Тогда
				Элементы[ЭтапНастройки.Группа].Доступность = Истина;
				Элементы[ЭтапНастройки.Панель].ТекущаяСтраница = Элементы[ЭтапНастройки.СтраницаТекущий];
				Элементы[ЭтапНастройки.Кнопка].Шрифт = ОбщегоНазначенияКлиент.ШрифтСтиля("КомандаПомощникаНастройкиСинхронизацииВажнаяШрифт");
				ТекущийЭтапНайден = Истина;
			ИначеЕсли Не ТекущийЭтапНайден Тогда
				Элементы[ЭтапНастройки.Группа].Доступность = Истина;
				Элементы[ЭтапНастройки.Панель].ТекущаяСтраница = Элементы[ЭтапНастройки.СтраницаУспешно];
				Элементы[ЭтапНастройки.Кнопка].Шрифт = ОбщегоНазначенияКлиент.ШрифтСтиля("КомандаПомощникаНастройкиСинхронизацииОбычнаяШрифт");
			Иначе
				Элементы[ЭтапНастройки.Группа].Доступность = Ложь;
				Элементы[ЭтапНастройки.Панель].ТекущаяСтраница = Элементы[ЭтапНастройки.СтраницаПустой];
				Элементы[ЭтапНастройки.Кнопка].Шрифт = ОбщегоНазначенияКлиент.ШрифтСтиля("КомандаПомощникаНастройкиСинхронизацииОбычнаяШрифт");
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ЭтапНастройки Из ЭтапыНастройки Цикл
			Если НЕ ЭтапНастройки.Используется Тогда
				Элементы[ЭтапНастройки.Группа].Доступность = Ложь;
				Элементы[ЭтапНастройки.Панель].ТекущаяСтраница = Элементы[ЭтапНастройки.СтраницаПустой];
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ЭтапыПослеПодключения = "НастройкаПравил,НачальныйОбразРИБ,СопоставлениеИЗагрузка,НачальнаяВыгрузкаДанных,ПодтверждениеПодключения"; 
	Если СтрНайти(ЭтапыПослеПодключения, ТекущийЭтапНастройки) > 0 Тогда
		
		Элементы.ВыборТипаТранспорта.Доступность = Ложь;
		Элементы.НастроитьПараметрыПодключения.Доступность = Ложь;
		Элементы.ПолучитьПодтверждениеПодключения.Доступность = Ложь;
		Элементы.НастроитьОбщиеПараметры.Доступность = Ложь;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСледующемуЭтапуНастройки()
	
	СледующаяСтрока = Неопределено;
	ТекущийЭтапНайден = Ложь;
	Для Каждого СтрокаЭтапыНастройки Из ЭтапыНастройки Цикл
		Если ТекущийЭтапНайден И СтрокаЭтапыНастройки.Используется Тогда
			СледующаяСтрока = СтрокаЭтапыНастройки;
			Прервать;
		КонецЕсли;
		
		Если СтрокаЭтапыНастройки.Название = ТекущийЭтапНастройки Тогда
			ТекущийЭтапНайден = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если СледующаяСтрока <> Неопределено Тогда
		ТекущийЭтапНастройки = СледующаяСтрока.Название;
		
		Если ТекущийЭтапНастройки = "НастройкаПравил" Тогда
			ПараметрыПроверки = Новый Структура;
			ПараметрыПроверки.Вставить("Корреспондент",          Объект.УзелИнформационнойБазы);
			ПараметрыПроверки.Вставить("ИмяПланаОбмена",         Объект.ИмяПланаОбмена);
			ПараметрыПроверки.Вставить("ИдентификаторНастройки", Объект.ИдентификаторНастройки);
			
			НастройкаВыполнена = НастройкаСинхронизацииЗавершена(Объект.УзелИнформационнойБазы);
			Если Не НастройкаВыполнена Тогда
				Если Не НастройкаXDTO Или ПолученыНастройкиXDTOКорреспондента(Объект.УзелИнформационнойБазы) Тогда
					ПередНастройкойСинхронизацииДанных(ПараметрыПроверки, НастройкаВыполнена, ИмяФормыПомощникаНастройкиСинхронизацииДанных);
				КонецЕсли;
			КонецЕсли;
			
			Если НастройкаВыполнена Тогда
				ПерейтиКСледующемуЭтапуНастройки();
				Возврат;
			КонецЕсли;
			
		ИначеЕсли ТекущийЭтапНастройки = "ЧтениеДанных" Тогда
			
			ПолучитьПрочитатьСообщениеОбменаОбъектнойКонвертации();
			
		ИначеЕсли ТекущийЭтапНастройки = "СопоставлениеПервоначальныхДанных" Тогда
			
			Если НЕ ЕстьДанныеДляРучногоСопоставления(Объект.УзелИнформационнойБазы) Тогда
				
				ПерейтиКСледующемуЭтапуНастройки();
				
			Иначе
				
				ОткрытьФормуРучногоСопоставленияДанных();
				
			КонецЕсли;
			
		ИначеЕсли ТекущийЭтапНастройки = "ПроблемыЗагрузки" Тогда
			
			Если НЕ ЕстьПроблемыПриЗагрузке(Объект.УзелИнформационнойБазы) Тогда
				
				ПерейтиКСледующемуЭтапуНастройки();
				
			Иначе
				
				ОткрытьРезультатыОбъектнойСинхронизации();
				
			КонецЕсли;
			
		ИначеЕсли ТекущийЭтапНастройки = "ДействияПриЗагрузкеДанных" Тогда
			
			Если НЕ НужноПодтвердитьДействияПриПолученииДанныхОбмена(Объект.УзелИнформационнойБазы) Тогда
				
				ПерейтиКСледующемуЭтапуНастройки();
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ СледующаяСтрока.Основное Тогда
			ТекущийЭтапНастройки = "";
		КонецЕсли;
	Иначе
		
		ТекущийЭтапНастройки = "";
		
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбновитьОтображениеТекущегоСостоянияНастройки", 0.2, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КонтекстОбъектнойНастройкиСинхронизации(Знач УзелИнформационнойБазы)
	
	Контекст = Новый Структура;
	Контекст.Вставить("ПолученыНастройкиXDTO", ПолученыНастройкиXDTOКорреспондента(УзелИнформационнойБазы));
	Контекст.Вставить("БылоПолученоСообщениеОбмена", БылоПолученоСообщениеОбмена(УзелИнформационнойБазы));
	Контекст.Вставить("БылоОтправленоСообщениеОбмена", БылоОтправленоСообщениеОбмена(УзелИнформационнойБазы));
	Контекст.Вставить("ЕстьДанныеДляРучногоСопоставления", ЕстьДанныеДляРучногоСопоставления(УзелИнформационнойБазы));
	Контекст.Вставить("ЕстьПроблемыПриЗагрузке", ЕстьПроблемыПриЗагрузке(УзелИнформационнойБазы));
	Контекст.Вставить("ЕстьПрочитанныеДанныеСообщенияОбмена", ЕстьПрочитанныеДанныеСообщенияОбмена(УзелИнформационнойБазы));
	Контекст.Вставить("НужноПодтвердитьДействияПриПолученииДанныхОбмена", НужноПодтвердитьДействияПриПолученииДанныхОбмена(УзелИнформационнойБазы));
	
	Возврат Контекст;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьДанныеДляРучногоСопоставления(Знач УзелИнформационнойБазы)
	
	Возврат РегистрыСведений.ОбъектыКЗагрузке.ЕстьДанныеДляРучногоСопоставления(УзелИнформационнойБазы);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьПроблемыПриЗагрузке(Знач УзелИнформационнойБазы)
	
	ТипыИсключенныхПроблем = Новый Массив;
	ТипыИсключенныхПроблем.Добавить(Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПоискСоответствия);
	
	ТипыИскомыхПроблем = Новый Массив;
	Для каждого ЗначениеПеречисления Из Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке Цикл
		
		Если ТипыИсключенныхПроблем.Найти(ЗначениеПеречисления) <> Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ТипыИскомыхПроблем.Добавить(ЗначениеПеречисления);
		
	КонецЦикла;
	
	КоличествоПроблемПоТипам = РегистрыСведений.ОбъектыКЗагрузке.КоличествоТиповПроблемПоУзлуПланаОбмена(УзелИнформационнойБазы, ТипыИскомыхПроблем, Ложь);
	
	ЕстьПроблемы = Ложь;
	Если КоличествоПроблемПоТипам.Количество() = 0 Тогда
		
		Возврат ЕстьПроблемы;
		
	КонецЕсли;
	
	Для каждого ЗначениеПеречисления Из ТипыИскомыхПроблем Цикл
		
		Если КоличествоПроблемПоТипам[ЗначениеПеречисления] = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ЕстьПроблемы = Истина;
		Прервать;
		
	КонецЦикла;
	
	Возврат ЕстьПроблемы;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьПрочитанныеДанныеСообщенияОбмена(УзелИнформационнойБазы)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", УзелИнформационнойБазы);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПрочитанныеДанные.ПолученныйОбъект КАК ПолученныйОбъект
	|ИЗ
	|	РегистрСведений.ПрочитанныеДанныеСообщенийОбмена КАК ПрочитанныеДанные
	|ГДЕ
	|	ПрочитанныеДанные.УзелПланаОбмена = &УзелИнформационнойБазы";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

&НаСервереБезКонтекста
Функция НастройкаСинхронизацииЗавершена(Знач УзелОбмена)
	
	Возврат ОбменДаннымиСервер.НастройкаСинхронизацииЗавершена(УзелОбмена);
	
КонецФункции

&НаСервереБезКонтекста
Функция НужноПодтвердитьДействияПриПолученииДанныхОбмена(Знач УзелИнформационнойБазы)
	
	КоличествоОбъектов = РегистрыСведений.ДействияПриПолученииДанныхОбмена.КоличествоОбъектовЗначенияУстановленыАвтоматически(УзелИнформационнойБазы);
	Возврат (КоличествоОбъектов > 0);
	
КонецФункции

&НаСервереБезКонтекста
Функция БылоПолученоСообщениеОбмена(УзелИнформационнойБазы)
	
	Если НЕ ЗначениеЗаполнено(УзелИнформационнойБазы) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	НомерПринятого = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УзелИнформационнойБазы, "НомерПринятого");
	Возврат (НомерПринятого > 0);
	
КонецФункции

&НаСервереБезКонтекста
Функция БылоОтправленоСообщениеОбмена(УзелИнформационнойБазы)
	
	Если НЕ ЗначениеЗаполнено(УзелИнформационнойБазы) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	НомерОтправленного = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УзелИнформационнойБазы, "НомерОтправленного");
	Возврат (НомерОтправленного > 0);
	
КонецФункции

&НаСервереБезКонтекста
Функция СсылкаСуществует(Знач УзелОбмена)
	
	Возврат ОбщегоНазначения.СсылкаСуществует(УзелОбмена);
	
КонецФункции

&НаСервереБезКонтекста
// Взводит признак "Настройка завершена" в регистре сведений "ОбщиеНастройкиУзловИнформационныхБаз".
//
// Параметры:
//   УзелКорреспондента - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//   ЭтоУзелОбъектнойКонвертации - Булево - это узел, который выполняет загрузку данных объектно.
//
Процедура ЗавершитьНастройкуСинхронизацииДанных(Знач УзелИнформационнойБазы, Знач ЭтоУзелОбъектнойКонвертации)
	
	ЗначениеНомерПринятого = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УзелИнформационнойБазы, "НомерПринятого", ИСТИНА);
	Если ЗначениеНомерПринятого > 0 Тогда
		
		Если ЭтоУзелОбъектнойКонвертации = Истина Тогда
			
			РегистрыСведений.ОбщиеНастройкиУзловИнформационныхБаз.УстановитьПризнакНастройкаЗавершена(УзелИнформационнойБазы);
			
		КонецЕсли;
		
		ОбменДаннымиСервер.ЗавершитьНастройкуСинхронизацииДанных(УзелИнформационнойБазы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТекущийЭтапОбъектнойКонвертации()
	
	Контекст = КонтекстОбъектнойНастройкиСинхронизации(Объект.УзелИнформационнойБазы);
	
	Если НЕ Контекст.ПолученыНастройкиXDTO Тогда
		
		ТекущийЭтапНастройки = "НастройкаПравил";
		
	ИначеЕсли Контекст.ПолученыНастройкиXDTO
		И НЕ Контекст.БылоОтправленоСообщениеОбмена
		И НЕ Контекст.БылоПолученоСообщениеОбмена
		И НЕ ПолученыДанныеДляСопоставления
		Тогда
		
		ТекущийЭтапНастройки = "НачальнаяВыгрузкаДанных";
		
	ИначеЕсли Контекст.ПолученыНастройкиXDTO
		И (Контекст.БылоОтправленоСообщениеОбмена ИЛИ ПолученыДанныеДляСопоставления)
		И НЕ Контекст.БылоПолученоСообщениеОбмена
		Тогда
		
		ТекущийЭтапНастройки = "ЧтениеДанных";
		
	ИначеЕсли Контекст.ПолученыНастройкиXDTO
		И Контекст.БылоПолученоСообщениеОбмена
		И Контекст.ЕстьДанныеДляРучногоСопоставления
		Тогда
		
		ТекущийЭтапНастройки = "СопоставлениеПервоначальныхДанных";
		
	ИначеЕсли Контекст.ПолученыНастройкиXDTO
		И Контекст.БылоПолученоСообщениеОбмена
		И Контекст.ЕстьПроблемыПриЗагрузке
		Тогда
		
		ТекущийЭтапНастройки = "ПроблемыЗагрузки";
		
	ИначеЕсли Контекст.ПолученыНастройкиXDTO
		И Контекст.БылоПолученоСообщениеОбмена
		И НЕ Контекст.ЕстьДанныеДляРучногоСопоставления
		И НЕ Контекст.ЕстьПроблемыПриЗагрузке
		И Контекст.НужноПодтвердитьДействияПриПолученииДанныхОбмена
		Тогда
		
		ТекущийЭтапНастройки = "ДействияПриЗагрузкеДанных";
		
	Иначе
		
		ТекущийЭтапНастройки = "НачальнаяВыгрузкаДанных";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполненаЗагрузкаДанныхДляСопоставления(УзелОбмена)
	
	Возврат Не ОбменДаннымиСервер.ПолученоСообщениеСДаннымиДляСопоставления(УзелОбмена);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПередНастройкойСинхронизацииДанных(ПараметрыПроверки, НастройкаВыполнена, ИмяФормыПомощника)
	
	Если ОбменДаннымиСервер.ЕстьАлгоритмМенеджераПланаОбмена("ПередНастройкойСинхронизацииДанных", ПараметрыПроверки.ИмяПланаОбмена) Тогда
		
		Контекст = Новый Структура;
		Контекст.Вставить("Корреспондент",          ПараметрыПроверки.Корреспондент);
		Контекст.Вставить("ИдентификаторНастройки", ПараметрыПроверки.ИдентификаторНастройки);
		Контекст.Вставить("НачальнаяНастройка",     Не НастройкаСинхронизацииЗавершена(ПараметрыПроверки.Корреспондент));
		
		ПланыОбмена[ПараметрыПроверки.ИмяПланаОбмена].ПередНастройкойСинхронизацииДанных(
			Контекст, НастройкаВыполнена, ИмяФормыПомощника);
		
		Если НастройкаВыполнена Тогда
			ОбменДаннымиСервер.ЗавершитьНастройкуСинхронизацииДанных(ПараметрыПроверки.Корреспондент);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ИнициализацияФормыПриСоздании

&НаСервере
Процедура ИнициализироватьСвойстваФормы()
	
	Заголовок = ОписаниеВариантаНастройки.ЗаголовокПомощникаСозданияОбмена;
	
	Если ПустаяСтрока(Заголовок) Тогда
		Если НастройкаРИБ Тогда
			Заголовок = НСтр("ru = 'Настройка распределенной информационной базы'");
		Иначе
			Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Настройка синхронизации данных с ""%1""'"),
				ОписаниеВариантаНастройки.НаименованиеКорреспондента);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьРеквизитыФормы()
	
	Параметры.Свойство("ОписаниеВариантаНастройки",    ОписаниеВариантаНастройки);
	
	НастройкаНовойСинхронизации = Параметры.Свойство("НастройкаНовойСинхронизации");
	ПродолжениеНастройкиВПодчиненномУзлеРИБ = Параметры.Свойство("ПродолжениеНастройкиВПодчиненномУзлеРИБ");
	МодельСервиса = ОбщегоНазначения.РазделениеВключено() И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных();
	ПодсистемаВерсионированияСуществует = ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов");
	
	Если НастройкаНовойСинхронизации Тогда
		Объект.ИмяПланаОбмена         = Параметры.ИмяПланаОбмена;
		Объект.ИдентификаторНастройки = Параметры.ИдентификаторНастройки;
		
		Если Не ПродолжениеНастройкиВПодчиненномУзлеРИБ Тогда
			Если ОбменДаннымиСервер.ЭтоПодчиненныйУзелРИБ() Тогда
				ИмяПланаОбменаРИБ = ОбменДаннымиСервер.ГлавныйУзел().Метаданные().Имя;
				
				ПродолжениеНастройкиВПодчиненномУзлеРИБ = (Объект.ИмяПланаОбмена = ИмяПланаОбменаРИБ)
				И Не Константы.НастройкаПодчиненногоУзлаРИБЗавершена.Получить();
			КонецЕсли;
		КонецЕсли;
		
		Если ПродолжениеНастройкиВПодчиненномУзлеРИБ Тогда
			
			ОбменДаннымиСервер.ПриПродолженииНастройкиПодчиненногоУзлаРИБ();
			Объект.УзелИнформационнойБазы = ОбменДаннымиСервер.ГлавныйУзел();
			Объект.ВариантРаботыМастера = "ПродолжитьНастройкуОбменаДанными";
			
		Иначе
			
			Объект.ВариантРаботыМастера = "НоваяСинхронизация";
			
		КонецЕсли;
		
	Иначе
		Объект.УзелИнформационнойБазы = Параметры.УзелОбмена;
		
		Объект.ИмяПланаОбмена         = ОбменДаннымиПовтИсп.ПолучитьИмяПланаОбмена(Объект.УзелИнформационнойБазы);
		Объект.ИдентификаторНастройки = ОбменДаннымиСервер.СохраненныйВариантНастройкиУзлаПланаОбмена(Объект.УзелИнформационнойБазы);
		
		Если МодельСервиса Тогда
			Параметры.Свойство("ОбластьДанныхКорреспондента",  ОбластьДанныхКорреспондента);
			Параметры.Свойство("ЭтоОбменСПриложениемВСервисе", ЭтоОбменСПриложениемВСервисе);
		КонецЕсли;
		
		Объект.ВариантРаботыМастера = "ПродолжитьНастройкуОбменаДанными";
	КонецЕсли;
		
	Если ПродолжениеНастройкиВПодчиненномУзлеРИБ Или ОписаниеВариантаНастройки = Неопределено Тогда
		
		МодульПомощник = ОбменДаннымиСервер.МодульПомощникСозданияОбменаДанными();
		ОписаниеВариантаНастройки = МодульПомощник.СтруктураОписанияВариантаНастройки();
		
		ЗначенияНастроекДляВарианта = ОбменДаннымиСервер.ЗначениеНастройкиПланаОбмена(Объект.ИмяПланаОбмена,
			"НаименованиеКонфигурацииКорреспондента,
			|ЗаголовокКомандыДляСозданияНовогоОбменаДанными,
			|ЗаголовокПомощникаСозданияОбмена,
			|КраткаяИнформацияПоОбмену,
			|ПодробнаяИнформацияПоОбмену",
			Объект.ИдентификаторНастройки);
			
		ЗаполнитьЗначенияСвойств(ОписаниеВариантаНастройки, ЗначенияНастроекДляВарианта);
		ОписаниеВариантаНастройки.НаименованиеКорреспондента = ЗначенияНастроекДляВарианта.НаименованиеКонфигурацииКорреспондента;
		
		ТекстJSON = Константы.НастройкиПодчиненногоУзлаРИБ.Получить();
		
		Если ЗначениеЗаполнено(ТекстJSON) Тогда
			
			НастройкиПодключения = ТранспортСообщенийОбмена.НастройкиПодключенияИзJSON(ТекстJSON);
			
			Если  ЗначениеЗаполнено(НастройкиПодключения.ИдентификаторТранспорта)
				И НастройкиПодключения.Свойство("НастройкиТранспорта") Тогда

				// Помещение в безопасное хранилище
				РеквизитыДляБезопасногоХранилища = ТранспортСообщенийОбмена.ПараметрТранспорта(
				НастройкиПодключения.ИдентификаторТранспорта, "РеквизитыДляБезопасногоХранилища");

				НастройкиТранспорта = НастройкиПодключения.НастройкиТранспорта;

				УстановитьПривилегированныйРежим(Истина);

				Для Каждого Реквизит Из РеквизитыДляБезопасногоХранилища Цикл

					Значение = НастройкиТранспорта[Реквизит];

					Если ЗначениеЗаполнено(Значение) Тогда

						ЗначениеИдентификатор = Строка(Новый УникальныйИдентификатор);
						ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ЗначениеИдентификатор, Значение);
						НастройкиТранспорта[Реквизит] = ЗначениеИдентификатор;

					КонецЕсли;

				КонецЦикла;

				УстановитьПривилегированныйРежим(Ложь);
				
			КонецЕсли;
			
		Иначе
			
			НастройкиПодключения = Новый Структура;
			НастройкиПодключения.Вставить("НаименованиеВторойБазы", ПланыОбмена.ГлавныйУзел().Наименование);
			НастройкиПодключения.Вставить("ПрефиксИнформационнойБазыПриемника", ПланыОбмена.ГлавныйУзел().Код);
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Объект, НастройкиПодключения);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.УзелИнформационнойБазы)
		И Не ЗначениеЗаполнено(Объект.ИдентификаторТранспорта)
		И Не ЗначениеЗаполнено(Объект.НастройкиТранспорта) Тогда
		
		НастройкаЗавершена = НастройкаСинхронизацииЗавершена(Объект.УзелИнформационнойБазы);
		
		Объект.НастройкиТранспорта = ТранспортСообщенийОбмена.НастройкиТранспортаПоУмолчанию(
			Объект.УзелИнформационнойБазы, Объект.ИдентификаторТранспорта);
		
	КонецЕсли;
	
	ЕстьНастройкиТранспорта = ЗначениеЗаполнено(Объект.НастройкиТранспорта)
		Или ЗначениеЗаполнено(Объект.ИдентификаторТранспорта) 
			И ТранспортСообщенийОбмена.ПараметрТранспорта(Объект.ИдентификаторТранспорта, "ПассивныйРежим");
	
	РезервноеКопирование = Не МодельСервиса
		И Не ПродолжениеНастройкиВПодчиненномУзлеРИБ
		И ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РезервноеКопированиеИБ");
		
	Если РезервноеКопирование Тогда
		МодульРезервноеКопированиеИБСервер = ОбщегоНазначения.ОбщийМодуль("РезервноеКопированиеИБСервер");
		
		НавигационнаяСсылкаОбработкиРезервногоКопирования =
			МодульРезервноеКопированиеИБСервер.НавигационнаяСсылкаОбработкиРезервногоКопирования();
	КонецЕсли;
		
	НастройкаРИБ = ОбменДаннымиПовтИсп.ЭтоПланОбменаРаспределеннойИнформационнойБазы(Объект.ИмяПланаОбмена);
	НастройкаXDTO = ОбменДаннымиСервер.ЭтоПланОбменаXDTO(Объект.ИмяПланаОбмена);
	НастройкаУниверсальногоОбмена = ОбменДаннымиПовтИсп.ЭтоУзелСтандартногоОбменаДанными(Объект.ИмяПланаОбмена); // без правил конвертации
	
	ДоступнаИнтерактивнаяОтправка = Не НастройкаРИБ И Не НастройкаУниверсальногоОбмена;
	
	Если НастройкаНовойСинхронизации
		Или НастройкаРИБ
		Или НастройкаУниверсальногоОбмена Тогда
		
		ПолученыДанныеДляСопоставления = Ложь;
		
	ИначеЕсли ЭтоОбменСПриложениемВСервисе Тогда
		
		ПолученыДанныеДляСопоставления = ОбменДаннымиСервер.ПолученоСообщениеСДаннымиДляСопоставления(Объект.УзелИнформационнойБазы);
		
	Иначе
		
		ПрямоеПодключение = ТранспортСообщенийОбмена.ПараметрТранспорта(Объект.ИдентификаторТранспорта, "ПрямоеПодключение");
		
		Если ПрямоеПодключение И ЕстьНастройкиТранспорта Тогда
			ПолученыДанныеДляСопоставления = ОбменДаннымиСервер.ПолученоСообщениеСДаннымиДляСопоставления(Объект.УзелИнформационнойБазы);
		Иначе
			ПолученыДанныеДляСопоставления = Истина;
		КонецЕсли;
		
	КонецЕсли;
		
	ЗначенияНастроекДляВарианта = ОбменДаннымиСервер.ЗначениеНастройкиПланаОбмена(Объект.ИмяПланаОбмена,
		"ИмяФормыСозданияНачальногоОбраза,
		|ИмяФормыПомощникаНастройкиСинхронизацииДанных,
		|ПоддерживаетсяСопоставлениеДанных,
		|ИмяКонфигурацииКорреспондента,
		|ИмяПланаОбменаКорреспондента,
		|ФорматОбмена,
		|ИмяФайлаНастроекДляПриемника,
		|НаименованиеКонфигурацииКорреспондента,
		|КраткаяИнформацияПоОбмену,
		|ПодробнаяИнформацияПоОбмену,
		|ОбъектнаяКонвертацияXDTO",
		Объект.ИдентификаторНастройки);
	
	ЗначенияНастроекДляВарианта.ПоддерживаетсяСопоставлениеДанных = 
		(ЗначенияНастроекДляВарианта.ПоддерживаетсяСопоставлениеДанных И НЕ ЗначенияНастроекДляВарианта.ОбъектнаяКонвертацияXDTO);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияНастроекДляВарианта);
	
	Если ПустаяСтрока(ИмяФормыСозданияНачальногоОбраза)
		И ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		ИмяФормыСозданияНачальногоОбраза = "ОбщаяФорма.[ФормаСозданияНачальногоОбраза]";
		ИмяФормыСозданияНачальногоОбраза = СтрЗаменить(ИмяФормыСозданияНачальногоОбраза,
			"[ФормаСозданияНачальногоОбраза]", "СозданиеНачальногоОбразаСФайлами");
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(Объект, ЗначенияНастроекДляВарианта);
	
	Если Не ЗначениеЗаполнено(Объект.ИмяПланаОбменаКорреспондента) Тогда
		Объект.ИмяПланаОбменаКорреспондента = Объект.ИмяПланаОбмена;
	КонецЕсли;
	
	Если МодельСервиса Тогда
		
		МодульОбменДаннымиВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("ОбменДаннымиВМоделиСервиса");
		Объект.НаименованиеЭтойБазы = МодульОбменДаннымиВМоделиСервиса.СформироватьНаименованиеПредопределенногоУзла();
		
	Иначе
		
		// Представление этой информационной базы.
		Объект.НаименованиеЭтойБазы = ОбменДаннымиСервер.НаименованиеПредопределенногоУзлаПланаОбмена(Объект.ИмяПланаОбмена);
		Если ПустаяСтрока(Объект.НаименованиеЭтойБазы) Тогда
			Объект.НаименованиеЭтойБазы = ОбменДаннымиПовтИсп.ИмяЭтойИнформационнойБазы();
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.НаименованиеВторойБазы) Тогда
			Объект.НаименованиеВторойБазы = ЗначенияНастроекДляВарианта.НаименованиеКонфигурацииКорреспондента;
		КонецЕсли;
				
	КонецЕсли;
	
	Объект.ИдентификаторИнформационнойБазыИсточника = 
		ОбменДаннымиСервер.КодПредопределенногоУзлаПланаОбмена(Объект.ИмяПланаОбмена);
	
	Если НастройкаXDTO Тогда
		
		Объект.ЭтоУзелОбъектнойКонвертации = ЗначенияНастроекДляВарианта.ОбъектнаяКонвертацияXDTO;
		Объект.ИспользоватьПрефиксыДляНастройкиОбмена = 
			Не ОбменДаннымиXDTOСервер.ПоддерживаетсяВерсияСИдентификаторомОбменаДанными(
			ПланыОбмена[Объект.ИмяПланаОбмена].ПустаяСсылка());
	
		Если ПустаяСтрока(Объект.ИдентификаторИнформационнойБазыИсточника) Тогда
			Объект.ИдентификаторИнформационнойБазыИсточника = 
				?(Объект.ИспользоватьПрефиксыДляНастройкиОбмена,
					Объект.ПрефиксИнформационнойБазыИсточника,
					Строка(Новый УникальныйИдентификатор));
		КонецЕсли;
		
	Иначе
		
		Объект.ЭтоУзелОбъектнойКонвертации = Ложь;
		Объект.ИспользоватьПрефиксыДляНастройкиОбмена = Истина;
		
	КонецЕсли;
	
	Объект.ИспользоватьПрефиксыДляНастройкиОбменаКорреспондента = Истина;
	
	Если Не ЗначениеЗаполнено(Объект.ПрефиксИнформационнойБазыИсточника) Тогда
		
		ПрефиксИнформационнойБазы = ПолучитьФункциональнуюОпцию("ПрефиксИнформационнойБазы");
		
		Если ЗначениеЗаполнено(ПрефиксИнформационнойБазы) Тогда
			Объект.ПрефиксИнформационнойБазыИсточника = ПрефиксИнформационнойБазы;
		Иначе
			ОбменДаннымиПереопределяемый.ПриОпределенииПрефиксаИнформационнойБазыПоУмолчанию(Объект.ПрефиксИнформационнойБазыИсточника);
		КонецЕсли;
	
	КонецЕсли;
	
	ТекущийЭтапНастройки = "";
	Если (НастройкаНовойСинхронизации И Не ПродолжениеНастройкиВПодчиненномУзлеРИБ)
		Или (ПродолжениеНастройкиВПодчиненномУзлеРИБ И Не ЕстьНастройкиТранспорта) Тогда
		ТекущийЭтапНастройки = "ВыборТипаТранспорта";
	ИначеЕсли НастройкаНовойСинхронизации И ПродолжениеНастройкиВПодчиненномУзлеРИБ Тогда
		ТекущийЭтапНастройки = "ОбщиеПараметры";
	ИначеЕсли НЕ Объект.ЭтоУзелОбъектнойКонвертации Тогда
		
		Если Не НастройкаСинхронизацииЗавершена(Объект.УзелИнформационнойБазы) Тогда
			ТекущийЭтапНастройки = "НастройкаПравил";
		ИначеЕсли НастройкаРИБ
			И Не ПродолжениеНастройкиВПодчиненномУзлеРИБ
			И Не НачальныйОбразСоздан(Объект.УзелИнформационнойБазы) Тогда
			Если Не ПустаяСтрока(ИмяФормыСозданияНачальногоОбраза) Тогда
				ТекущийЭтапНастройки = "НачальныйОбразРИБ";
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(Объект.УзелИнформационнойБазы) Тогда
			НомераСообщений = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.УзелИнформационнойБазы, "НомерПринятого, НомерОтправленного");
			Если НомераСообщений.НомерПринятого = 0
				И НомераСообщений.НомерОтправленного = 0
				И ОбменДаннымиСервер.ПолученоСообщениеСДаннымиДляСопоставления(Объект.УзелИнформационнойБазы) Тогда
				ТекущийЭтапНастройки = "СопоставлениеИЗагрузка";
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Объект.ЭтоУзелОбъектнойКонвертации Тогда
		
		ТекущийЭтапОбъектнойКонвертации();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДобавитьЭтапНастройки(Название, Кнопка, ЭлементыФормы, Используется, Основное = Истина)
	
	СтрокаЭтап = ЭтапыНастройки.Добавить();
	СтрокаЭтап.Название        = Название;
	СтрокаЭтап.Кнопка          = Кнопка;
	СтрокаЭтап.Используется    = Используется;
	СтрокаЭтап.Основное        = Основное;
	
	ЗаполнитьЗначенияСвойств(СтрокаЭтап, ЭлементыФормы);
	
	Возврат СтрокаЭтап;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТаблицуЭтаповНастройки()
	
	ЭтапыНастройки.Очистить();
	
	// Выбор типа транспорта
	ЭтапИспользуется = НастройкаНовойСинхронизации
		Или (ПродолжениеНастройкиВПодчиненномУзлеРИБ И Не ЕстьНастройкиТранспорта);
	
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа"			, Элементы.ГруппаВыборТипаТранспорта.Имя);
	ЭлементыФормы.Вставить("Панель"			, Элементы.ПанельВыборТипаТранспорта.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаВыборТипаТранспортаУспешно.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаВыборТипаТранспортаТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой"	, Элементы.СтраницаВыборТипаТранспортаПустой.Имя);
	
	ДобавитьЭтапНастройки("ВыборТипаТранспорта", "ВыборТипаТранспорта", ЭлементыФормы, ЭтапИспользуется);
		
	// Настройка подключения
	ЭтапИспользуется = ЕстьНастройкиТранспорта Или НастройкаНовойСинхронизации;
	
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа"			, Элементы.ГруппаНастройкаПодключения.Имя);
	ЭлементыФормы.Вставить("Панель"			, Элементы.ПанельНастройкаПодключения.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаНастройкаПодключенияУспешно.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаНастройкаПодключенияТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой"	, Элементы.СтраницаНастройкаПодключенияПустой.Имя);
	
	ДобавитьЭтапНастройки("НастройкаПодключения", "НастроитьПараметрыПодключения", ЭлементыФормы, ЭтапИспользуется);
	
	// Общие параметры синхронизации
	ЭтапИспользуется = ЕстьНастройкиТранспорта Или НастройкаНовойСинхронизации;
	
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа" , Элементы.ГруппаОбщиеПараметры.Имя);
	ЭлементыФормы.Вставить("Панель" , Элементы.ПанельОбщиеПараметры.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаОбщиеПараметрыУспешно.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаОбщиеПараметрыТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой", Элементы.СтраницаОбщиеПараметрыПустой.Имя);
	
	ДобавитьЭтапНастройки("ОбщиеПараметры", "НастроитьОбщиеПараметры", ЭлементыФормы, ЭтапИспользуется);
	
	// Подтверждение подключения
	ЭтапИспользуется = Ложь;
	
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа", Элементы.ГруппаПодтверждениеПодключения.Имя);
	ЭлементыФормы.Вставить("Панель", Элементы.ПанельПодтверждениеПодключения.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаПодтверждениеПодключенияУспешно.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаПодтверждениеПодключенияТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой", Элементы.СтраницаПодтверждениеПодключенияПустой.Имя);
	
	ДобавитьЭтапНастройки("ПодтверждениеПодключения", "ПолучитьПодтверждениеПодключения", ЭлементыФормы, ЭтапИспользуется);
		
	// Настройка правил
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа", Элементы.ГруппаНастройкаПравил.Имя);
	ЭлементыФормы.Вставить("Панель", Элементы.ПанельНастройкаПравил.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаНастройкаПравилУспешно.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаНастройкаПравилТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой", Элементы.СтраницаНастройкаПравилПустой.Имя);
	
	ДобавитьЭтапНастройки("НастройкаПравил", "НастроитьПравилаОтправкиИПолучения", ЭлементыФормы, Истина);
		
	// Начальный образ РИБ
	ЭтапИспользуется = НастройкаРИБ
		И Не ПродолжениеНастройкиВПодчиненномУзлеРИБ
		И Не ПустаяСтрока(ИмяФормыСозданияНачальногоОбраза);
		
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа", Элементы.ГруппаНачальныйОбразРИБ.Имя);
	ЭлементыФормы.Вставить("Панель", Элементы.ПанельНачальныйОбразРИБ.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаНачальныйОбразРИБУспешно.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаНачальныйОбразРИБТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой", Элементы.СтраницаНачальныйОбразРИБПустой.Имя);
	
	ДобавитьЭтапНастройки("НачальныйОбразРИБ", "СоздатьНачальныйОбразРИБ", ЭлементыФормы, ЭтапИспользуется);
		
	// Сопоставление и загрузка
	ЭтапИспользуется = Не НастройкаРИБ 
		И Не НастройкаУниверсальногоОбмена
		И Не Объект.ЭтоУзелОбъектнойКонвертации
		И ПолученыДанныеДляСопоставления 
		И ПоддерживаетсяСопоставлениеДанных <> Ложь;
		
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа", Элементы.ГруппаСопоставлениеИЗагрузка.Имя);
	ЭлементыФормы.Вставить("Панель", Элементы.ПанельСопоставлениеИЗагрузка.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаСопоставлениеИЗагрузкаУспешно.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаСопоставлениеИЗагрузкаТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой", Элементы.СтраницаСопоставлениеИЗагрузкаПустой.Имя);
	
	ДобавитьЭтапНастройки("СопоставлениеИЗагрузка", "ВыполнитьСопоставлениеИЗагрузкуДанных", ЭлементыФормы, ЭтапИспользуется);
	
#Область ОбъектнаяКонвертация
	
	Контекст = КонтекстОбъектнойНастройкиСинхронизации(Объект.УзелИнформационнойБазы);
	
	// Объектно. Чтение данных
	// Этап должен быть доступен для чтения 1го сообщения.
	
	ОжидаемПервоеСообщение = Контекст.ПолученыНастройкиXDTO
			И Контекст.БылоОтправленоСообщениеОбмена
			И НЕ Контекст.БылоПолученоСообщениеОбмена;
	
	ЭтапИспользуется = НЕ НастройкаРИБ
		И НЕ НастройкаУниверсальногоОбмена
		И Объект.ЭтоУзелОбъектнойКонвертации
		И (ПолученыДанныеДляСопоставления ИЛИ ОжидаемПервоеСообщение);
	
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа", Элементы.ГруппаЧтениеДанных.Имя);
	ЭлементыФормы.Вставить("Панель", Элементы.ПанельЧтениеДанных.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаЧтениеДанныхУспешно.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаЧтениеДанныхТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой", Элементы.СтраницаЧтениеДанныхПустой.Имя);
	
	ДобавитьЭтапНастройки("ЧтениеДанных", "ПрочитатьПервоначальныеДанные", ЭлементыФормы, ЭтапИспользуется);
	
	// Объектно. Сопоставление данных в ручную
	ЭтапИспользуется = Не НастройкаРИБ
		И Не НастройкаУниверсальногоОбмена
		И Объект.ЭтоУзелОбъектнойКонвертации
		И Контекст.ЕстьДанныеДляРучногоСопоставления;
		
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа", Элементы.ГруппаСопоставлениеПервоначальныхДанных.Имя);
	ЭлементыФормы.Вставить("Панель", Элементы.ПанельСопоставлениеПервоначальныхДанных.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаСопоставлениеПервоначальныхДанныхУспешно.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаСопоставлениеПервоначальныхДанныхТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой", Элементы.СтраницаСопоставлениеПервоначальныхДанныхПустой.Имя);
	
	ДобавитьЭтапНастройки("СопоставлениеПервоначальныхДанных", "СопоставитьПервоначальныеДанныеПомощником", ЭлементыФормы, ЭтапИспользуется);
	
	// Объектно. Работа с предупреждениями при конвертации
	ЭтапИспользуется = Не НастройкаРИБ 
		И Не НастройкаУниверсальногоОбмена
		И Объект.ЭтоУзелОбъектнойКонвертации
		И Контекст.ЕстьПроблемыПриЗагрузке;
		
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа", Элементы.ГруппаРассмотретьПроблемыЗагрузки.Имя);
	ЭлементыФормы.Вставить("Панель", Элементы.ПанельРассмотретьПроблемыЗагрузки.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаРассмотретьПроблемыЗагрузкиУспешно.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаРассмотретьПроблемыЗагрузкиТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой", Элементы.СтраницаРассмотретьПроблемыЗагрузкиПустой.Имя);
	
	ДобавитьЭтапНастройки("ПроблемыЗагрузки", "РассмотретьПроблемыЗагрузкиПервоначальныхДанных", ЭлементыФормы, ЭтапИспользуется);
	
	// Объектно. Подтвердить настройку "Действия при загрузке"
	ЭтапИспользуется = Объект.ЭтоУзелОбъектнойКонвертации;
	
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа", Элементы.ГруппаПодтвердитьДействияПриЗагрузкеДанных.Имя);
	ЭлементыФормы.Вставить("Панель", Элементы.ПанельПодтвердитьДействияПриЗагрузкеДанных.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаПодтвердитьДействияПриЗагрузкеДанныхУспешно.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаПодтвердитьДействияПриЗагрузкеДанныхТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой", Элементы.СтраницаПодтвердитьДействияПриЗагрузкеДанныхПустой.Имя);
	
	ДобавитьЭтапНастройки("ДействияПриЗагрузкеДанных", "ПодтвердитьДействияПриЗагрузкеДанных", ЭлементыФормы, ЭтапИспользуется);
	
#КонецОбласти
	
	// Начальная выгрузка данных
	Если Объект.ЭтоУзелОбъектнойКонвертации Тогда
		
		НадоОтправитьНастройкиXDTO = НЕ Контекст.ПолученыНастройкиXDTO
			И НЕ Контекст.БылоОтправленоСообщениеОбмена;
		
		НадоОтправитьДанные = Контекст.ПолученыНастройкиXDTO
			И НЕ Контекст.БылоОтправленоСообщениеОбмена;
			
		ЭтапИспользуется = ДоступнаИнтерактивнаяОтправка
			И (ЕстьНастройкиТранспорта Или НастройкаНовойСинхронизации)
			И (НадоОтправитьНастройкиXDTO ИЛИ НадоОтправитьДанные);
	Иначе
		
		ЭтапИспользуется = ДоступнаИнтерактивнаяОтправка
			И (ЕстьНастройкиТранспорта Или НастройкаНовойСинхронизации);
		
	КонецЕсли;
	
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа", Элементы.ГруппаНачальнаяВыгрузкаДанных.Имя);
	ЭлементыФормы.Вставить("Панель", Элементы.ПанельНачальнаяВыгрузкаДанных.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаНачальнаяВыгрузкаДанныхУспешно.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаНачальнаяВыгрузкаДанныхТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой", Элементы.СтраницаНачальнаяВыгрузкаДанныхПустой.Имя);
	
	ДобавитьЭтапНастройки("НачальнаяВыгрузкаДанных", "ВыполнитьНачальнуюВыгрузкуДанных", ЭлементыФормы, ЭтапИспользуется);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНачальноеОтображениеЭлементовФормы()
	
	Элементы.ДекорацияКраткаяИнформацияПоОбменуНадпись.Заголовок = ОписаниеВариантаНастройки.КраткаяИнформацияПоОбмену;
	Элементы.ПодробноеОписаниеСинхронизацииДанных.Видимость = ЗначениеЗаполнено(ОписаниеВариантаНастройки.ПодробнаяИнформацияПоОбмену);
	Элементы.ГруппаРезервноеКопирование.Видимость = РезервноеКопирование;
	Элементы.ПолучитьПодтверждениеПодключения.РасширеннаяПодсказка.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		Элементы.ПолучитьПодтверждениеПодключения.РасширеннаяПодсказка.Заголовок,
		ОписаниеВариантаНастройки.НаименованиеКорреспондента);
		
	Если РезервноеКопирование Тогда
		Элементы.ДекорацияРезервноеКопированиеНадпись.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = 'Перед началом настройки новой синхронизации данных рекомендуется <a href=""%1"">создать резервную копию данных</a>.'"),
			НавигационнаяСсылкаОбработкиРезервногоКопирования);
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти

#КонецОбласти