///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Записывает новое состояние оригинала документа
//	Подробнее - см. описание УправлениеФиксациейПервичныхДокументов.УстановитьНовоеСостояниеОригинала(ДанныеЗапись,ИмяСостояния)
//
Процедура УстановитьНовоеСостояниеОригинала(ДанныеЗаписи, ИмяСостояния) Экспорт

	УчетОригиналовПервичныхДокументов.УстановитьНовоеСостояниеОригинала(ДанныеЗаписи, ИмяСостояния);

КонецПроцедуры

// Возвращает ссылку на документ по штрихкоду табличного документа
//
//	Подробнее - см. описание УчетОригиналовПервичныхДокументов.ПриСканированииДокументаПодключаемымОборудованием(ШтрихКод)
//
Процедура ОбработатьШтрихкод(Штрихкод) Экспорт
	
	УчетОригиналовПервичныхДокументов.ОбработатьШтрихкод(ШтрихКод);

КонецПроцедуры

// Вызывается для записи состояний оригиналов печатных форм в регистр, после печати формы.
//
//	Подробнее - см. описание УчетОригиналовПервичныхДокументовКлиент.ЗаписатьСостоянияОригиналовПослеПечати(ОбъектыПечати, ИменаМакетов, ПечатныеФормы).
//
Процедура ЗаписатьСостоянияОригиналовПослеПечати(ОбъектыПечати, СписокПечати) Экспорт

	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетОригиналовПервичныхДокументов") Тогда
		РегистрыСведений.СостоянияОригиналовПервичныхДокументов.ЗаписатьСостоянияОригиналовДокументаПослеПечатиФормы(ОбъектыПечати, СписокПечати);
	КонецЕсли;

КонецПроцедуры

// Возвращает структуру с данными о текущим общем состоянии оригинала документа по ссылке 
//
//	Подробнее - см. описание УправлениеФиксациейПервичныхДокументов.СведенияОСостоянииОригиналаПоСсылке(ДокументСсылка)
//
Функция СведенияОСостоянииОригиналаПоСсылке(ДокументСсылка) Экспорт

	Возврат УчетОригиналовПервичныхДокументов.СведенияОСостоянииОригиналаПоСсылке(ДокументСсылка);
	
КонецФункции

// Проверяет и возвращает признак того, является ли документ по ссылке документом с учетом оригиналов 
//
//	Подробнее - см. описание УправлениеФиксациейПервичныхДокументов.ВозможностьЗаписиОбъектов(МассивСсылок)
//
Функция ВозможностьЗаписиОбъектов(МассивСсылок) Экспорт
	
	Возврат УчетОригиналовПервичныхДокументов.ВозможностьЗаписиОбъектов(МассивСсылок);

КонецФункции

// Проверяет и возвращает признак того, является ли документ по ссылке документом с учетом оригиналов 
//
//	Подробнее - см. описание УправлениеФиксациейПервичныхДокументов.ЭтоОбъектУчета(ОбъектСсылка)
//
Функция ЭтоОбъектУчета(ОбъектСсылка) Экспорт
	
	Возврат УчетОригиналовПервичныхДокументов.ЭтоОбъектУчета(ОбъектСсылка);

КонецФункции

// Проверяет и возвращает признак того, есть ли у текущего пользователя права на изменение состояния
//
//	Подробнее - см. описание Пользователи.РолиДоступны(...);
//
Функция ПраваНаИзменениеСостояния() Экспорт
	
	Если ПравоДоступа("Редактирование",Метаданные.РегистрыСведений.СостоянияОригиналовПервичныхДокументов) 
		И ПравоДоступа("Изменение",Метаданные.РегистрыСведений.СостоянияОригиналовПервичныхДокументов) Тогда
		Возврат Истина 
	Иначе
		Возврат Ложь
	КонецЕсли;

КонецФункции

// Возвращает ключ записи регистра общего состояния оригинала документа по ссылке
//
//	Подробнее - см. описание УчетОригиналовПервичныхДокументов.КлючЗаписиОбщегоСостояния(ДокументСсылка)
//
Функция КлючЗаписиОбщегоСостояния(ДокументСсылка) Экспорт

	Возврат УчетОригиналовПервичныхДокументов.КлючЗаписиОбщегоСостояния(ДокументСсылка);

КонецФункции

#КонецОбласти
