///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область Функции

// Функция возвращает массив возможных стратегий записи объектов.
//
// В зависимости от того, какой объект загружается механизм конвертации принимает решение как записывать объект.
// 1. Если данные загружаются в новый объект, то рекомендуется оптимистичная стратегия:
//    - проведение (для документов), если неудача - запись с включенной бизнес логикой, если неудача сохранение;
// 2. Если данные загружаются в существующий объект, то рекомендуется стратегия не ухудшения данных:
//    - проведение (для документов) или запись с включенной бизнес логикой (для справочников), 
//      если неудача - прерываем конвертацию.
//
// Возвращаемое значение:
//   Массив из Строка - возможные значения "_Проведение", "_Проведение_Запись", "_Проведение_Запись_Сохранение",
//                      "_Запись", "_Запись_Сохранение".
//
Функция ВозможныеСтратегияЗаписиОбъекта() Экспорт
	
	ИмяСтратегииПроведения = КонвертацияОбъектноСлужебный.ИмяСтратегииПроведения();
	ИмяСтратегииЗаписи = КонвертацияОбъектноСлужебный.ИмяСтратегииЗаписи();
	ИмяСтратегииСохранения = КонвертацияОбъектноСлужебный.ИмяСтратегииСохранения();
	
	СтратегияЗаписиОбъекта = Новый Массив(5);
	СтратегияЗаписиОбъекта[0] = ИмяСтратегииПроведения;								// _Проведение
	СтратегияЗаписиОбъекта[1] = СтратегияЗаписиОбъекта[0] + ИмяСтратегииЗаписи;		// _Проведение_Запись
	СтратегияЗаписиОбъекта[2] = СтратегияЗаписиОбъекта[1] + ИмяСтратегииСохранения; // _Проведение_Запись_Сохранение
	СтратегияЗаписиОбъекта[3] = ИмяСтратегииЗаписи; 								// _Запись
	СтратегияЗаписиОбъекта[4] = СтратегияЗаписиОбъекта[3] + ИмяСтратегииСохранения; // _Запись_Сохранение
	
	Возврат СтратегияЗаписиОбъекта;
	
КонецФункции

// Возвращает границу элементов без сопоставления, 
// до которой актуально использовать оптимизированный список поиска по ключам.
//
// Возвращаемое значение:
//    Число - количество элементов без сопоставления,больше которых используется поиск по основной таблице.
//
Функция ГраницаИспользованияОптимальнойСтратегииПоискаПоКлючам() Экспорт
	
	Возврат 1000;
	
КонецФункции

// Функция возвращает идентификатор оптимальной стратегии поиска по ключевым значениям.
//
// Оптимальную стратегию поиска рекомендуется использовать,
// когда не сопоставленных записей в ИБ мало.
// В этом случае будет оптимальнее получать такие записи из ИБ,
// поместить их во временную таблицу с индексированием по полям поиска,
// а после выполнить поиск уже по временной таблице...
//
// Возвращаемое значение:
//  Строка
//
Функция ИдентификаторОптимальнойСтратегииПоискаПоКлючам() Экспорт
	
	Возврат "Оптимально";
	
КонецФункции

// Функция возвращает идентификатор стандартной стратегии поиска по ключевым значениям.
//
// Используем когда не сопоставленных записей в ИБ много(более 1000).
// В этом случае использование временной таблицы с не сопоставленными записями будет неоптимальным,
// так как потребуется большое количество ресурсов на ее создание.
//
// Пример классического поиска по ключам см. в методе СопоставитьОбъектПоПолямПоискаИлиАлгоритмом()
// общего модуля КонвертацияОбъектноСлужебный
//
// Возвращаемое значение:
//  Строка
//
Функция ИдентификаторСтандартнойСтратегииПоискаПоКлючам() Экспорт
	
	Возврат "Стандарт";
	
КонецФункции

// Метод используем при интерактивной конвертации зачитанных данных. 
// Зачитанные данные храним по-объектно в регистре сведений "ПрочитанныеДанныеСообщенийОбмена".
//
// Параметры:
//  КомпонентыОбмена - Структура - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена().
//  ВыборкаДанныхДляОбработки - ВыборкаИзРезультатаЗапроса - состав полей выборки описан в 
//                          РегистрыСведений.ПрочитанныеДанныеСообщенийОбмена.ВыбранныеДанныеДляОбработки().
//  ПараметрыИнтерактивнойКонвертации - Структура - результат конвертации полученного объекта XDTO:
//     * ИгнорироватьНедостающиеСсылки - Булево - признак того, что объекты будут 
//                          загружены даже в случаи отсутствия в ИБ входящих ссылок
//     * ПодтверждениеЗагрузкиВыполнено - Булево - признак того, что пользователь уже подтвердил загрузку
//     * НеПроверятьОсвободившиесяОбъектыПриЗаписиВПИСО - Булево - признак того, что при выполнении загрузки 
//                          запись в ПИСО для новых объектов надо выполнять с конструкцией 
//                          "НеОпределятьИзменениеОбъектыБлокирующиеЗагрузку = Истина".
//
// Возвращаемое значение:
//   ТаблицаЗначений:
//     * ПолученныеДанные - Строка - 
//     * ПКО - Строка -
//     * ИсторияКонвертацииОбъекта - Структура - состав полей структуры описан в
//                                      см. КонвертацияОбъектноРезультатыСлужебный.КонструкторИсторииПримененияПОД().
//     * ИсторияПримененияПКО - Соответствие из Структура - см. КонвертацияОбъектноРезультатыСлужебный.КонструкторИсторииПримененияПКО
//
Функция КонвертироватьЗачитанныеДанныеСОтчетом(КомпонентыОбмена, ВыборкаДанныхДляОбработки, ПараметрыИнтерактивнойКонвертации) Экспорт
	
	КомпонентыОбмена.Вставить("ПараметрыИнтерактивнойКонвертации", ПараметрыИнтерактивнойКонвертации);
	КомпонентыОбмена.Вставить("ИсторияКонвертацииДанных", КонвертацияОбъектноРезультатыСлужебный.КонструкторИсторииКонвертацииДанных());
	
	Возврат КонвертацияОбъектноСлужебный.КонвертироватьЗачитанныеДанныеСОтчетом(КомпонентыОбмена, ВыборкаДанныхДляОбработки);
	
КонецФункции

// Метод-конструктор, который используется для описания недостающей ссылки в сообщениях о проблемах конвертации.
//
// Возвращаемое значение:
//   Структура:
//     * БлокирующийИдентификатор - Неопределено, Строка - идентификатор из сообщения обмена, который не смогли 
//                                                         сопоставить с объектом этой ИБ.
//     * ИмяРеквизита - Строка - имя реквизита, который планировали заполнить (указывается в ПКС).
//     * ПравилоКонвертации - Строка - имя правила конвертации объекта (ПКО).
//     * ВнешняяНавигационнаяСсылка - Строка - внешняя навигационная ссылка на объект в ИБ источнике.
//     * ОписаниеТипа - Неопределено, 
//                      СправочникСсылка.ИдентификаторыОбъектовМетаданных - тип предполагаемого объекта данных 
//                                                                          для заполнения реквизита.
//     * ОбъектФормата - Строка - имя типа объекта формата.
//     * ПространствоИменОбъектаФормата - Строка - имя объекта формата как оно задано в пакете XDTO.
//
Функция КонструкторСсылкаБлокирующаяКонвертацию() Экспорт
	
	СсылкиБлокирующиеКонвертацию = Новый Структура;
	СсылкиБлокирующиеКонвертацию.Вставить("БлокирующийИдентификатор", Неопределено);
	СсылкиБлокирующиеКонвертацию.Вставить("ИмяРеквизита", "");
	СсылкиБлокирующиеКонвертацию.Вставить("ПравилоКонвертации", "");
	СсылкиБлокирующиеКонвертацию.Вставить("ВнешняяНавигационнаяСсылка", "");
	СсылкиБлокирующиеКонвертацию.Вставить("ОписаниеТипа", Неопределено);
	СсылкиБлокирующиеКонвертацию.Вставить("ОбъектФормата", "");
	СсылкиБлокирующиеКонвертацию.Вставить("ПространствоИменОбъектаФормата", "");
	
	Возврат СсылкиБлокирующиеКонвертацию;
	
КонецФункции

// Возвращает приоритет, в котором должен конвертироваться объект формата при загрузке данных 
//
// Параметры:
//  КомпонентыОбмена - Структура - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена()
//  ТипОбъектаФормата - Строка, РасширенноеИмяXML, ТипОбъектаXDTO - расширенное имя типа объекта формата пакета XDTO.
//                     Может приобретать вид "{http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.16}Документ.ЧекККМ".
// Возвращаемое значение:
//  Структура:
//   * Приоритет - Число - приоритет, в котором должен конвертироваться объект формата.
//   * ПутьКДате - Строка - путь к свойству доп упорядочивания, для документов, как правило, это дата из ключевых свойств.
//
Функция ПриоритетКонвертацииПоТипуОбъектаФормата(КомпонентыОбмена, Знач ТипОбъектаФормата) Экспорт
	Перем ПриоритетыКонвертации, РасширенноеИмяXML;
	
	Если ТипЗнч(ТипОбъектаФормата) = Тип("РасширенноеИмяXML") Тогда
		
		РасширенноеИмяXML = Строка(ТипОбъектаФормата);
		
	ИначеЕсли ТипЗнч(ТипОбъектаФормата) = Тип("ТипОбъектаXDTO") Тогда
		
		РасширенноеИмяXML = Строка(Новый РасширенноеИмяXML(ТипОбъектаФормата.URIПространстваИмен, ТипОбъектаФормата.Имя));
		
	ИначеЕсли ТипЗнч(ТипОбъектаФормата) = Тип("Строка") Тогда
		
		РасширенноеИмяXML = СокрЛП(ТипОбъектаФормата);
		
	КонецЕсли;
	
	Результат = Новый Структура("Приоритет, ПутьКДате", 999, "");
	Если РасширенноеИмяXML = Неопределено
		ИЛИ ПустаяСтрока(РасширенноеИмяXML) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Если НЕ КомпонентыОбмена.Свойство("ПриоритетыКонвертации", ПриоритетыКонвертации)
		ИЛИ ПриоритетыКонвертации = Неопределено Тогда
		
		ВерсияФорматаСтрокой = Неопределено;
		Если НЕ КомпонентыОбмена.Свойство("ВерсияФорматаОбмена", ВерсияФорматаСтрокой) Тогда
			
			// Если нет версии формата в компонентах, то берем все форматы
			ВерсияФорматаСтрокой = "";
			
		КонецЕсли;
		
		ПриоритетыКонвертации = ПриоритетыКонвертацииВерсииФормата(ВерсияФорматаСтрокой);
		КомпонентыОбмена.Вставить("ПриоритетыКонвертации", ПриоритетыКонвертации);
		
	КонецЕсли;
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("ОбъектФормата", РасширенноеИмяXML);
	
	НайденныеПриоритеты = ПриоритетыКонвертации.НайтиСтроки(ОтборСтрок);
	Если НайденныеПриоритеты = Неопределено
		ИЛИ НайденныеПриоритеты.Количество() < 1 Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Результат, НайденныеПриоритеты[0]);
	Возврат Результат;
	
КонецФункции

// Возвращает список приоритетов конвертации для указанной версии формата EnterpriseData. Используется при определении
// порядка, в котором будут конвертироваться объекты при загрузке.
//
// Параметры:
//  ВерсияФорматаСтрокой - Строка - номер версии формата или пространство имен формата.
//                Может приобретать вид "1.17" или "{http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.17}".
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - Строка - Расширенное имя типа объекта формата EnterpriseData.
//   * Значение - Структура:
//       ** Приоритет - Число - приоритет, в котором должен конвертироваться объект формата.
//       ** ПутьКДате - Строка - путь к свойству доп упорядочивания, для документов, 
//                               как правило, это дата из ключевых свойств.
//
Функция ПриоритетыКонвертацииВерсииФормата(ВерсияФорматаСтрокой) Экспорт
	
	Если ТипЗнч(ВерсияФорматаСтрокой) <> Тип("Строка") Тогда
		
		ВерсияФорматаСтрокой = "";
		
	КонецЕсли;
	
	Возврат КонвертацияОбъектноСлужебный.ПриоритетыКонвертацииОбъектовФормата(ВерсияФорматаСтрокой);
	
КонецФункции

// Возвращает опцию плана обмена, указывающую на то, какой механизм конвертации данных применить при обработке 
// структуры XDTO.
//
// Параметры:
//    УзелКорреспондента - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//
//  Возвращаемое значение:
//    Булево - Истина - используется объектная конвертация иначе Ложь.
// 
Функция СпособКонвертацииОбъектовXDTO(Знач УзелКорреспондента) Экспорт
	
	Если НЕ ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат ОбменДаннымиПовтИсп.СпособКонвертацииОбъектовXDTO(УзелКорреспондента);
	
КонецФункции

// Формирует абсолютную ссылку (внешняя навигационная) по объекту ИБ в формате:
// <Public_or_Path_DB>#<Link>
//
// Параметры:
//   ДанныеИБ - СправочникОбъект, ДокументОбъект - выгружаемый объект.
//
// Возвращаемое значение:
//   Строка - абсолютная ссылки на объект ИБ, например:
//             e1c://filev/E/1C/my_DB#e1cib/data/Справочник.Номенклатура?ref=9a9d04d9f5aa634011f04d1fc553692d
Функция СсылкаВнешняяНавигационнаяИзОбъектаВыгрузки(ДанныеИБ) Экспорт
	
	Если ДанныеИБ = Неопределено Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	// Константы "АдресПубликацииИнформационнойБазыВИнтернете" и "АдресПубликацииИнформационнойБазыВЛокальнойСети"
	// находятся в базовой функциональности, поэтому проверять наличие подсистемы не обязательно.
	
	ВнешнийАдресИБ = СокрЛП(Константы.АдресПубликацииИнформационнойБазыВИнтернете.Получить());
	
	Если ПустаяСтрока(ВнешнийАдресИБ) Тогда
		
		ВнешнийАдресИБ = Константы.АдресПубликацииИнформационнойБазыВЛокальнойСети.Получить();
		
	КонецЕсли;
	
	Если ПустаяСтрока(ВнешнийАдресИБ) Тогда
		
		ВнешнийАдресИБ = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
		
	КонецЕсли;
	
	КлассСсылка = КонвертацияОбъектноРецепцияСервер.КлассСсылка();
	НавигационнаяСсылкаИБ = ПолучитьНавигационнуюСсылку(ДанныеИБ[КлассСсылка]);
	
	АбсолютнаяСсылка = "";
	Если ПустаяСтрока(ВнешнийАдресИБ) Тогда
		
		АбсолютнаяСсылка = НавигационнаяСсылкаИБ;
		
	Иначе
		
		АбсолютнаяСсылка = СтрШаблон("%1/#%2", ВнешнийАдресИБ, НавигационнаяСсылкаИБ);
		
	КонецЕсли;
	
	Возврат АбсолютнаяСсылка;
	
КонецФункции

// Возвращает стандартный (рекомендуемый) интервал для обновления стратегии поиска по ключам (в днях).
// Фактически, приложению предписываем обновлять сведения об используемой  стратегии через указанное количество дней.
// Интервал может быть переопределен в свойствах плана обмена XDTO: см. "ИнтервалОбновленияСтратегииПоискаПоКлючам".
//
// Возвращаемое значение:
//    Число - количество дней, при которых определенная стратегия поиска считается актуальной.
//
Функция СтандартныйИнтервалОбновленияСтратегииПоискаПоКлючам() Экспорт
	
	Возврат 7;
	
КонецФункции

// Конвертирует структуру полученную из объекта XDTO в объект ИБ. В случае выявления отсутствующих ссылок на объекты
// выполняется запись в регистры зависимостей, а конвертация ставиться на паузу.
//
// Параметры:
//  КомпонентыОбмена - Структура - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена().
//  ПравилоКонвертации - СтрокаТаблицыЗначений - строка таблицы правил конвертации объектов.
//                     - Структура - описание правила конвертации объекта:
//                          * ПравилоКонвертации - СтрокаТаблицыЗначений - строка таблицы правил конвертации объектов.
//                                                 Обязательное свойство.
//                          * УдалятьСозданныеПоКлючевымСвойствам - Булево - признак необходимости удаления объектов,
//                                                                  созданных только по значениям ключевых свойств.
//                                                                  Необязательное свойство, по умолчанию Ложь.
//  ДанныеXDTO - Структура - результат конвертации полученного объекта XDTO.
//  Отказ - Булево
// 
// Возвращаемое значение:
//   ДокументОбъект,
//   СправочникОбъект,
//   РегистрСведенийНаборЗаписей,
//   БизнесПроцессОбъект,
//   ЗадачаОбъект,
//   ПланСчетовОбъект,
//   ПланВидовРасчетаОбъект,
//   Неопределено - полученный объект ИБ либо Неопределено, если конвертацию выполнить не удалось.
// 
Функция СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, ПравилоКонвертации, ДанныеXDTO, Отказ = Ложь) Экспорт
	
	Возврат КонвертацияОбъектноСлужебный.КонвертироватьСтруктуруОбъектаXDTOВОбъектИБ(КомпонентыОбмена, ПравилоКонвертации, ДанныеXDTO, Отказ);
	
КонецФункции

// Распознает объектную конвертацию по свойствам структуры КомпонентыОбмена
//
// Параметры:
//   КомпонентыОбмена - Структура - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена().
//
// Возвращаемое значение:
//   Булево - ИСТИНА, если конвертация работает объектно.
//
Функция ЭтоОбъектнаяКонвертация(КомпонентыОбмена) Экспорт
	
	Возврат КомпонентыОбмена.Свойство("ОбъектнаяКонвертацияXDTO")
		И КомпонентыОбмена.ОбъектнаяКонвертацияXDTO = ИСТИНА;
	
КонецФункции

#КонецОбласти

#Область Процедуры

// Метод используется для включения механизма объектной конвертации данных.
//
// Параметры:
//   УзелПланаОбмена - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//
Процедура ВключитьОбъектныйМеханизмКонвертации(УзелПланаОбмена) Экспорт
	
	Если НЕ ЗначениеЗаполнено(УзелПланаОбмена) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбъектнаяКонвертацияXDTO = КонвертацияОбъектноРецепцияСервер.СпособКонвертацииОбъектовXDTO(УзелПланаОбмена);
	Если ОбъектнаяКонвертацияXDTO = Истина Тогда
		
		Возврат; // Уже включено - уходим.
		
	КонецЕсли;
	
	КонвертацияОбъектноРецепцияСервер.ИзменитьСпособОбъектнойКонвертацииXDTO(УзелПланаОбмена, Истина);
	
КонецПроцедуры

// Метод используется для выключения механизма объектной конвертации данных.
//
// Параметры:
//    УзелПланаОбмена - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//
Процедура ВыключитьОбъектныйМеханизмКонвертации(УзелПланаОбмена) Экспорт
	
	Если НЕ ЗначениеЗаполнено(УзелПланаОбмена) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбъектнаяКонвертацияXDTO = КонвертацияОбъектноРецепцияСервер.СпособКонвертацииОбъектовXDTO(УзелПланаОбмена);
	Если ОбъектнаяКонвертацияXDTO = Ложь Тогда
		
		Возврат; // Уже выключено, уходим.
		
	КонецЕсли;
	
	КонвертацияОбъектноРецепцияСервер.ИзменитьСпособОбъектнойКонвертацииXDTO(УзелПланаОбмена, Ложь);
	
КонецПроцедуры

// Отражает недостающую ссылку в результатах конвертации данных.
//
// Параметры:
//   КомпонентыОбмена - Структура - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена().
//   СсылкаБлокирующая - Структура - см. КонвертацияОбъектноСервер.КонструкторСсылкаБлокирующаяКонвертацию().
//   ФиксироватьПредупреждение - Булево - если ИСТИНА, то взводится "ЕстьПредупреждениеБлокировкиОбъектаДругимиОбъектами"
//     в ИсторияПримененияТекущегоПКО и добавляется соответствующая запись об ошибке.
//
Процедура ДобавитьБлокирующуюСсылку(КомпонентыОбмена, СсылкаБлокирующая, ФиксироватьПредупреждение = Ложь) Экспорт
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.СсылкиБлокирующиеКонвертацию.Добавить(СсылкаБлокирующая);
	
	Если ФиксироватьПредупреждение = Истина Тогда
		
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьПредупреждениеБлокировкиОбъектаДругимиОбъектами(КомпонентыОбмена);
		
	КонецЕсли;
	
КонецПроцедуры

// Метод используется для конвертации "Запроса на выгрузку".
// Фактически реализована след логика: по УИД и имени объекта формата
// вычисляется объект данных, который регистрируется к отправке.
//
// Параметры:
//   КомпонентыОбмена - Структура - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена(). 
//   ОбъектXDTO - ОбъектXDTO - конвертируемые данные, соответствуют типу XDTO "ЗапросНаВыгрузку".
//
Процедура ЗапросыНаВыгрузкуВДанныеИБ(КомпонентыОбмена, ОбъектXDTO) Экспорт
	
	КонвертацияОбъектноСлужебный.ЗапросыНаВыгрузкуВДанныеИБ(КомпонентыОбмена, ОбъектXDTO);
	
КонецПроцедуры

// Отражает недостающую ссылку в результатах конвертации данных.
//
// Параметры:
//  КомпонентыОбмена - Структура - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена().
//
Процедура ЗапросыНаВыгрузкуДанныхВXML(КомпонентыОбмена) Экспорт
	
	КонвертацияОбъектноСлужебный.ЗапросыНаВыгрузкуДанныхВXML(КомпонентыОбмена);
	
КонецПроцедуры

// Метод используем для конвертации зачитанных данных. 
// Зачитанные данные храним по-объектно в регистре сведений "ПрочитанныеДанныеСообщенийОбмена".
//
// Параметры:
//  КомпонентыОбмена - Структура - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена().
//
Процедура КонвертироватьЗачитанныеДанные(КомпонентыОбмена) Экспорт
	
	КомпонентыОбмена.Вставить("ИсторияКонвертацииДанных", КонвертацияОбъектноРезультатыСлужебный.КонструкторИсторииКонвертацииДанных());
	
	КонвертацияОбъектноСлужебный.КонвертироватьЗачитанныеДанные(КомпонентыОбмена);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
