///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПереданныеПараметры();
	ИнициализироватьДанныеФормы();
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)
	
	ПерейтиПоСтраницамФормы();
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияФормы

&НаСервере
Процедура ОбработатьПереданныеПараметры()

	УзелИнформационнойБазы = Параметры.УзелИнформационнойБазы;

КонецПроцедуры

&НаСервере
Процедура ИнициализироватьДанныеФормы()
	
	ЦветПоясняющийТекст         = ЦветаСтиля.ПоясняющийТекст;
	ШрифтЗаголовкаПредставления = ШрифтыСтиля.ЗаголовокПредставленияТипаОбъектаШрифт;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеЭлементамиФормы

&НаКлиенте
Процедура ПерейтиПоСтраницамФормы()
	
	Если Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаНачало Тогда
		
		Элементы.ДекорацияИнформацияОжидание.Заголовок = НСтр("ru = 'Выполняется анализ документов для загрузки..'");
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОжидание;
		УправлениеДоступностью(ЭтотОбъект);
		ВыполнитьАнализДоступныхДляЗагрузкиОбъектов();
		
	ИначеЕсли Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаИтог Тогда
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностью(Форма)

	ЭлементыФормы = Форма.Элементы;
	
	Если ЭлементыФормы.СтраницыФормы.ТекущаяСтраница = ЭлементыФормы.СтраницаНачало Тогда
		
		ЭлементыФормы.Далее.Видимость    = Истина;
		ЭлементыФормы.Отмена.Доступность = Истина;
		
	ИначеЕсли ЭлементыФормы.СтраницыФормы.ТекущаяСтраница = ЭлементыФормы.СтраницаОжидание Тогда
		
		ЭлементыФормы.Далее.Видимость    = Ложь;
		ЭлементыФормы.Отмена.Доступность = ?(Форма.ВозниклаОшибка, Истина, Ложь);
		
	ИначеЕсли ЭлементыФормы.СтраницыФормы.ТекущаяСтраница = ЭлементыФормы.СтраницаИтог Тогда
		
		ЭлементыФормы.Далее.Видимость    = Истина;
		ЭлементыФормы.Далее.Заголовок    = НСтр("ru = 'Готово'");
		ЭлементыФормы.Отмена.Видимость   = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиОшибкуСтраницыОжидания(Форма, ТекстОшибки)
	
	Форма.ВозниклаОшибка = Истина;
	Форма.Элементы.СтраницыКартинкиОжиданиеОшибка.ТекущаяСтраница = Форма.Элементы.СтраницаКартинкаОшибка;
	Форма.Элементы.ДекорацияИнформацияОшибка.Заголовок            = ТекстОшибки;
	
	УправлениеДоступностью(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область АнализДокументовДоступныхДляЗагрузки

&НаКлиенте
Процедура ВыполнитьАнализДоступныхДляЗагрузкиОбъектов()

	ДлительнаяОперация = ДлительнаяОперацияАнализДоступныхДляЗагрузкиОбъектов();
	
	Если ДлительнаяОперация = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Не удалось инициализировать фоновое задание анализа документов не загруженных из за ошибки проведения.'");
		ВывестиОшибкуСтраницыОжидания(ЭтотОбъект, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ПроанализироватьДоступныеДляЗагрузкиОбъектыЗавершение(ДлительнаяОперация, Неопределено);
		
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПроанализироватьДоступныеДляЗагрузкиОбъектыЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияАнализДоступныхДляЗагрузкиОбъектов()
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("УзелИнформационнойБазы", УзелИнформационнойБазы);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Анализ не загруженных документов с ошибками проведения, доступных для загрузки'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("Обработки.РаботаСРезультатамиОбмена.ВыполнитьАнализДоступныхДляЗагрузкиДокументов",
	                                                       ПараметрыПроцедуры, ПараметрыВыполнения);
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ПроанализироватьДоступныеДляЗагрузкиОбъектыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Возникла неизвестная ошибка при выполнении фонового задания анализа документов, не загруженных из за ошибки проведения.'");
		ВывестиОшибкуСтраницыОжидания(ЭтотОбъект, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВозниклаОшибка = Истина;
		УправлениеДоступностью(ЭтотОбъект);
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ОбработатьРезультатыАнализаДоступныхДляЗагрузкиДокументов(Результат.АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатыАнализаДоступныхДляЗагрузкиДокументов(АдресРезультата)

	РезультатОбработкиАнализаДокументовКЗагрузке = РезультатОбработкиАнализаДокументовКЗагрузке(АдресРезультата);
	
	Если Не РезультатОбработкиАнализаДокументовКЗагрузке.Успешно Тогда
		ТекстОшибки = НСтр("ru = 'Возникла неизвестная ошибка при выполнении фонового задания анализа документов, не загруженных из за ошибки проведения.'");
		ВывестиОшибкуСтраницыОжидания(ЭтотОбъект, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если РезультатОбработкиАнализаДокументовКЗагрузке.ДокументыКОтменеПроведения.Количество() > 0 Тогда
		
		ВыполнитьОтменуПроведенияДокументов(РезультатОбработкиАнализаДокументовКЗагрузке);
		
	ИначеЕсли РезультатОбработкиАнализаДокументовКЗагрузке.ДокументыКЗагрузке.Количество() > 0 Тогда
		
		ВыполнитьЗагрузкуДокументов(РезультатОбработкиАнализаДокументовКЗагрузке, Неопределено); 
		
	Иначе
		
		ПерейтиНаСтраницуИтогиЗагрузки();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатОбработкиАнализаДокументовКЗагрузке(АдресРезультата)
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("Успешно", Ложь);
	РезультатОбработки.Вставить("ДокументыКОтменеПроведения", Новый Массив);
	РезультатОбработки.Вставить("ДокументыКЗагрузке",         Новый Массив);
	
	ДанныеАнализа = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	ТекстНеизвестнойОшибки = НСтр("ru = 'При выполнении анализа доступных для групповой загрузки документа возникла непредвиденная ошибка.'");
	
	Если ДанныеАнализа = Неопределено Тогда
		
		ВывестиОшибкуСтраницыОжидания(ЭтотОбъект, ТекстНеизвестнойОшибки);
		Возврат РезультатОбработки;
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеАнализа) <> Тип("Структура") Тогда
		
		ВывестиОшибкуСтраницыОжидания(ЭтотОбъект, ТекстНеизвестнойОшибки);
		Возврат РезультатОбработки;
		
	КонецЕсли;
	
	Если Не ДанныеАнализа.Успешно Тогда
		
		ВывестиОшибкуСтраницыОжидания(ЭтотОбъект, СтрСоединить(ДанныеАнализа.ТекстыОшибок, Символы.ПС));
		Возврат РезультатОбработки;
		
	КонецЕсли;
	
	ДанныеАнализа.ДокументыКЗагрузке.Сортировать("Проведен Убыв, ДатаДокументаВБазе Убыв");
	
	Для Каждого СтрокаТаблицы Из ДанныеАнализа.ДокументыКЗагрузке Цикл
		
		НоваяСтрока = ОбрабатываемыеДокументы.Добавить();
		НоваяСтрока.ПолученныйОбъект   = СтрокаТаблицы.ПолученныйОбъект;
		НоваяСтрока.ПравилоКонвертации = СтрокаТаблицы.ПравилоКонвертации;
		НоваяСтрока.ОбъектФормата      = СтрокаТаблицы.ОбъектФормата;
		НоваяСтрока.Документ           = СтрокаТаблицы.СсылкаНаОбъект;
		НоваяСтрока.БылПроведен        = СтрокаТаблицы.Проведен;
		
		Если Не СтрокаТаблицы.Проведен Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатОбработки.ДокументыКОтменеПроведения.Добавить(ДанныеЗагружаемогоДокумента(СтрокаТаблицы, Истина));
		
	КонецЦикла;
	
	ДанныеАнализа.ДокументыКЗагрузке.Сортировать("ДатаЗагружаемогоДокумента Возр");
	
	Для Каждого СтрокаТаблицы Из ДанныеАнализа.ДокументыКЗагрузке Цикл
		
		РезультатОбработки.ДокументыКЗагрузке.Добавить(ДанныеЗагружаемогоДокумента(СтрокаТаблицы, Ложь));
		
	КонецЦикла;
	
	РезультатОбработки.Успешно = Истина;
	Возврат РезультатОбработки;
	
КонецФункции

&НаСервере
Функция ДанныеЗагружаемогоДокумента(СтрокаТаблицы, ДобавитьПроведен)
	
	ДанныеДокумента = Новый Структура;
	
	ДанныеДокумента.Вставить("ПолученныйОбъект",   СтрокаТаблицы.ПолученныйОбъект);
	ДанныеДокумента.Вставить("ПравилоКонвертации", СтрокаТаблицы.ПравилоКонвертации);
	ДанныеДокумента.Вставить("ОбъектФормата",      СтрокаТаблицы.ОбъектФормата);
	ДанныеДокумента.Вставить("УзелПланаОбмена",    УзелИнформационнойБазы);
	ДанныеДокумента.Вставить("СсылкаНаОбъект",     СтрокаТаблицы.СсылкаНаОбъект);
	
	Если ДобавитьПроведен Тогда
		ДанныеДокумента.Вставить("Проведен", СтрокаТаблицы.Проведен);
	КонецЕсли;
	
	Возврат ДанныеДокумента;
	
КонецФункции

#КонецОбласти

#Область ОтменаПроведенияДокументов

&НаКлиенте
Процедура ВыполнитьОтменуПроведенияДокументов(РезультатОбработкиАнализаДокументовКЗагрузке)
	
	Элементы.ДекорацияИнформацияОжидание.Заголовок = НСтр("ru = 'Выполняется отмена проведения документов...'"); 
	
	ДлительнаяОперация = ДлительнаяОперацияОтменаПроведенияДокументов(РезультатОбработкиАнализаДокументовКЗагрузке.ДокументыКОтменеПроведения);
	
	Если ДлительнаяОперация = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Возникла неизвестная ошибка при выполнении фонового задания отмены проведения.'");
		ВывестиОшибкуСтраницыОжидания(ЭтотОбъект, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("РезультатОбработкиАнализаДокументовКЗагрузке", РезультатОбработкиАнализаДокументовКЗагрузке);
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ВыполнитьОтменуПроведенияДокументовЗавершение(ДлительнаяОперация, ДополнительныеПараметры);
		
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыполнитьОтменуПроведенияДокументовЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияОтменаПроведенияДокументов(ДокументыКОтменеПроведения)
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ДокументыКОтменеПроведения", ДокументыКОтменеПроведения);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Отмена проведения документов для последующей загрузки'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("Обработки.РаботаСРезультатамиОбмена.ОтменаПроведенияДокументовДляПоследующейЗагрузки",
	                                                       ПараметрыПроцедуры, ПараметрыВыполнения);
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьОтменуПроведенияДокументовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Возникла неизвестная ошибка при выполнении фонового задания отмены проведения.'");
		ВывестиОшибкуСтраницыОжидания(ЭтотОбъект, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВозниклаОшибка = Истина;
		УправлениеДоступностью(ЭтотОбъект);
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ОбработатьРезультатыОтменыПроведенияДокументов(Результат.АдресРезультата, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатыОтменыПроведенияДокументов(АдресРезультата, ДополнительныеПараметры)

	РезультатОтменыПроведения = РезультатОтменыПроведения(АдресРезультата, ДополнительныеПараметры);
	
	Если Не РезультатОтменыПроведения.Успешно Тогда
		
		ТекстОшибки = СтрШаблон(НСтр("ru = 'При выполнении отмены проведения возникли ошибки:
		                             |%1'"), СтрСоединить(РезультатОтменыПроведения.ТекстыОшибок, Символы.ПС)) ;
		ВывестиОшибкуСтраницыОжидания(ЭтотОбъект, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ВыполнитьЗагрузкуДокументов(ДополнительныеПараметры.РезультатОбработкиАнализаДокументовКЗагрузке, РезультатОтменыПроведения);
	
КонецПроцедуры 

&НаСервере
Функция РезультатОтменыПроведения(АдресРезультата, ДополнительныеПараметры)
	
	РезультатОтменыПроведения = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Для Каждого ДанныеДокумента Из РезультатОтменыПроведения.РезультатОтмены Цикл
		
		Если ДанныеДокумента.Проведен Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("ПолученныйОбъект",   ДанныеДокумента.ПолученныйОбъект);
		ПараметрыПоиска.Вставить("ПравилоКонвертации", ДанныеДокумента.ПравилоКонвертации);
		ПараметрыПоиска.Вставить("ОбъектФормата",      ДанныеДокумента.ОбъектФормата);
		ПараметрыПоиска.Вставить("Документ",           ДанныеДокумента.СсылкаНаОбъект);
		
		НайденныеСтроки = ОбрабатываемыеДокументы.НайтиСтроки(ПараметрыПоиска);
		
		Если НайденныеСтроки.Количество() = 1 Тогда
			
			НайденныеСтроки[0].ВыполненаОтменаПроведения = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатОтменыПроведения;
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаОбъектов

&НаКлиенте
Процедура ВыполнитьЗагрузкуДокументов(РезультатОбработкиАнализаДокументовКЗагрузке, РезультатОтменыПроведения)
	
	Если РезультатОбработкиАнализаДокументовКЗагрузке.ДокументыКЗагрузке.Количество() > 0 Тогда
		
		Элементы.ДекорацияИнформацияОжидание.Заголовок = НСтр("ru = 'Выполняется загрузка документов...'");
		
		РезультатИзмененияПричины = РезультатУстановкиПричиныГотовКЗагрузке(РезультатОбработкиАнализаДокументовКЗагрузке.ДокументыКЗагрузке);
		
		РаботаСРезультатамиОбменаКлиент.ОповеститьОРезультатахУстановкиПричиныГотовКЗагрузке(РезультатИзмененияПричины);
		
		ЗагрузитьОбъектыФоновымЗаданием(РезультатИзмененияПричины, РезультатОбработкиАнализаДокументовКЗагрузке);
		
	Иначе
		
		ПерейтиНаСтраницуИтогиЗагрузки();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатУстановкиПричиныГотовКЗагрузке(КлючиЗаписейКОбработке)
	
	Возврат РаботаСРезультатамиОбмена.РезультатУстановкиПричиныГотовКЗагрузке(КлючиЗаписейКОбработке);
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьОбъектыФоновымЗаданием(РезультатИзмененияПричины, РезультатОбработкиАнализаДокументовКЗагрузке)
	
	Если РезультатИзмененияПричины.КоличествоОбработано = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ДлительнаяОперацияЗагрузкиОбъектов(
		УникальныйИдентификатор, 
		РезультатИзмененияПричины.ИдентификаторФоновогоЗадания); 
		
	Если ДлительнаяОперация = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Возникла неизвестная ошибка при выполнении фонового задания загрузки документов.'");
		ВывестиОшибкуСтраницыОжидания(ЭтотОбъект, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ЗагрузитьОбъектыФоновымЗаданиемЗавершение(ДлительнаяОперация, РезультатОбработкиАнализаДокументовКЗагрузке);
		
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("РезультатОбработкиАнализаДокументовКЗагрузке",РезультатОбработкиАнализаДокументовКЗагрузке);
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьОбъектыФоновымЗаданиемЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияЗагрузкиОбъектов(УникальныйИдентификатор, КлючФоновогоЗадания)
	
	ПараметрыПередачи = РаботаСРезультатамиОбмена.НовыйПараметрыПередачиОбъектовНаЗагрузку();
	
	ПараметрыПередачи.НеПроверятьОсвободившиесяОбъектыПриЗаписиВПИСО = Истина;
	ПараметрыПередачи.ПодтверждениеЗагрузкиВыполнено                 = Истина;
	
	Возврат РаботаСРезультатамиОбмена.ДлительнаяОперацияЗагрузкиОбъектов(
		УникальныйИдентификатор,
		УзелИнформационнойБазы,
		КлючФоновогоЗадания,
		ПараметрыПередачи);
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьОбъектыФоновымЗаданиемЗавершение(РезультатФоновогоЗадания, ДополнительныеПараметры) Экспорт
	
	Если РезультатФоновогоЗадания = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Возникла неизвестная ошибка при выполнении фонового задания загрузки документов.'");
		ВывестиОшибкуСтраницыОжидания(ЭтотОбъект, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если РезультатФоновогоЗадания.Статус = "Ошибка" Тогда
		ВызватьИсключение РезультатФоновогоЗадания.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если РезультатФоновогоЗадания.Статус = "Выполнено" Тогда
		РезультатЗагрузкиОбъектов(РезультатФоновогоЗадания);
		ПерейтиНаСтраницуИтогиЗагрузки();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатЗагрузкиОбъектов(РезультатФоновогоЗадания)
	
	РезультатЗагрузкиОбъектов = ПолучитьИзВременногоХранилища(РезультатФоновогоЗадания.АдресРезультата);
	
	ОбновитьТаблицуОбрабатываемыеДокументыПоРезультатамЗагрузки(РезультатЗагрузкиОбъектов.СтатусыЗагрузки);
	
	Возврат РезультатЗагрузкиОбъектов;
	
КонецФункции

&НаСервере
Процедура ОбновитьТаблицуОбрабатываемыеДокументыПоРезультатамЗагрузки(ОбновленныеСтатусыЗагрузки)
	
	ТаблицаСтатусовЗагрузки = Новый ТаблицаЗначений;
	ТаблицаСтатусовЗагрузки.Колонки.Добавить("ПолученныйОбъект",   ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ТаблицаСтатусовЗагрузки.Колонки.Добавить("ПравилоКонвертации", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаСтатусовЗагрузки.Колонки.Добавить("ОбъектФормата",      ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаСтатусовЗагрузки.Колонки.Добавить("ПричинаДобавления",  Новый ОписаниеТипов("ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке"));
	ТаблицаСтатусовЗагрузки.Колонки.Добавить("СтатусЗагрузки",     Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыОбновленияОбъектаПриПроблемахЗаписи"));
	
	Для Каждого ДанныеСтатусаЗагрузки Из ОбновленныеСтатусыЗагрузки Цикл
		
		НоваяСтрока = ТаблицаСтатусовЗагрузки.Добавить();
		НоваяСтрока.ПолученныйОбъект   = ДанныеСтатусаЗагрузки.ПолученныйОбъект;
		НоваяСтрока.ПравилоКонвертации = ДанныеСтатусаЗагрузки.ПравилоКонвертации;
		НоваяСтрока.ОбъектФормата      = ДанныеСтатусаЗагрузки.ОбъектФормата;
		НоваяСтрока.ПричинаДобавления  = ДанныеСтатусаЗагрузки.ПричинаДобавления;
		НоваяСтрока.СтатусЗагрузки     = ДанныеСтатусаЗагрузки.СтатусЗагрузки;
		
	КонецЦикла;
	
	ТаблицаОбрабатываемыеДокументы =  Новый ТаблицаЗначений;
	ТаблицаОбрабатываемыеДокументы.Колонки.Добавить("ПолученныйОбъект",       ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ТаблицаОбрабатываемыеДокументы.Колонки.Добавить("ПравилоКонвертации",     ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаОбрабатываемыеДокументы.Колонки.Добавить("ОбъектФормата",          ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаОбрабатываемыеДокументы.Колонки.Добавить("Документ",               Документы.ТипВсеСсылки());
	ТаблицаОбрабатываемыеДокументы.Колонки.Добавить("ИдентификаторСтроки",    ОбщегоНазначения.ОписаниеТипаЧисло(6));
	
	Для Каждого СтрокаОбрабатываемыеДокументы Из ОбрабатываемыеДокументы Цикл
		
		НоваяСтрока = ТаблицаОбрабатываемыеДокументы.Добавить();
		НоваяСтрока.ПолученныйОбъект    = СтрокаОбрабатываемыеДокументы.ПолученныйОбъект;
		НоваяСтрока.ПравилоКонвертации  = СтрокаОбрабатываемыеДокументы.ПравилоКонвертации;
		НоваяСтрока.ОбъектФормата       = СтрокаОбрабатываемыеДокументы.ОбъектФормата;
		НоваяСтрока.Документ            = СтрокаОбрабатываемыеДокументы.Документ;
		НоваяСтрока.ИдентификаторСтроки = СтрокаОбрабатываемыеДокументы.ПолучитьИдентификатор();
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбрабатываемыеДокументы.ПолученныйОбъект    КАК ПолученныйОбъект,
	|	ОбрабатываемыеДокументы.ПравилоКонвертации  КАК ПравилоКонвертации,
	|	ОбрабатываемыеДокументы.ОбъектФормата       КАК ОбъектФормата,
	|	ОбрабатываемыеДокументы.Документ            КАК ДокументКОбработке,
	|	ОбрабатываемыеДокументы.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ОбрабатываемыеДокументы
	|ИЗ
	|	&ОбрабатываемыеДокументы КАК ОбрабатываемыеДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбновленныеСтатусыЗагрузки.ПолученныйОбъект   КАК ПолученныйОбъект,
	|	ОбновленныеСтатусыЗагрузки.ПравилоКонвертации КАК ПравилоКонвертации,
	|	ОбновленныеСтатусыЗагрузки.ОбъектФормата      КАК ОбъектФормата,
	|	ОбновленныеСтатусыЗагрузки.СтатусЗагрузки     КАК СтатусЗагрузки,
	|	ОбновленныеСтатусыЗагрузки.ПричинаДобавления  КАК ПричинаДобавления
	|ПОМЕСТИТЬ ОбновленныеСтатусыЗагрузки
	|ИЗ
	|	&ОбновленныеСтатусыЗагрузки КАК ОбновленныеСтатусыЗагрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбрабатываемыеДокументы.ПолученныйОбъект     КАК ПолученныйОбъект,
	|	ОбрабатываемыеДокументы.ПравилоКонвертации   КАК ПравилоКонвертации,
	|	ОбрабатываемыеДокументы.ОбъектФормата        КАК ОбъектФормата,
	|	ОбновленныеСтатусыЗагрузки.ПричинаДобавления КАК НоваяПричинаДобавления,
	|	ОбновленныеСтатусыЗагрузки.СтатусЗагрузки    КАК НовыйСтатусЗагрузки,
	|	ОбрабатываемыеДокументы.ИдентификаторСтроки  КАК ИдентификаторСтроки
	|ИЗ
	|	ОбрабатываемыеДокументы КАК ОбрабатываемыеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбновленныеСтатусыЗагрузки КАК ОбновленныеСтатусыЗагрузки
	|		ПО ОбрабатываемыеДокументы.ПолученныйОбъект = ОбновленныеСтатусыЗагрузки.ПолученныйОбъект
	|			И ОбрабатываемыеДокументы.ПравилоКонвертации = ОбновленныеСтатусыЗагрузки.ПравилоКонвертации
	|			И ОбрабатываемыеДокументы.ОбъектФормата = ОбновленныеСтатусыЗагрузки.ОбъектФормата";
	
	Запрос.УстановитьПараметр("ОбрабатываемыеДокументы",    ТаблицаОбрабатываемыеДокументы);
	Запрос.УстановитьПараметр("ОбновленныеСтатусыЗагрузки", ТаблицаСтатусовЗагрузки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		СтрокаОбрабатываемыеДокументы = ОбрабатываемыеДокументы.НайтиПоИдентификатору(Выборка.ИдентификаторСтроки);
		
		Если СтрокаОбрабатываемыеДокументы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаОбрабатываемыеДокументы.НоваяПричинаДобавления = Выборка.НоваяПричинаДобавления;
		СтрокаОбрабатываемыеДокументы.НовыйСтатусЗагрузки    = Выборка.НовыйСтатусЗагрузки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВыводИтоговойИнформации

&НаКлиенте
Процедура ПерейтиНаСтраницуИтогиЗагрузки()
	
	СформироватьИтоговуюИнформациюРезультатыЗагрузки();
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаИтог;
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьИтоговуюИнформациюРезультатыЗагрузки()

	ИтоговаяИнформация = Новый ФорматированнаяСтрока(НСтр("ru = 'Итоговая информация:'"), ШрифтЗаголовкаПредставления, ЦветПоясняющийТекст);
	
	ДокументовКЗагрузке = ОбрабатываемыеДокументы.Количество();
	
	Если ДокументовКЗагрузке = 0 Тогда
		
		ТекстОтсутствуютДокументы             = Новый ФорматированнаяСтрока(НСтр("ru = 'Отсутствуют документы для загрузки'"), , ЦветПоясняющийТекст);
		ИтоговаяИнформация                    = Новый ФорматированнаяСтрока(ИтоговаяИнформация, Символы.ПС, ТекстОтсутствуютДокументы);
		Элементы.ИтоговаяИнформация.Заголовок = ИтоговаяИнформация;
		
		Возврат;
		
	Иначе
		
		УспешноЗагружено                       = 0;
		ЗагруженоСОшибкойПроведения            = 0;
		НеЗагруженоОтмененоПроведение          = 0;
		НеЗагруженоСтатусПроведенияНеИзменился = 0;
		
		Для Каждого СтрокаТаблицы Из ОбрабатываемыеДокументы Цикл
			
			Если СтрокаТаблицы.НоваяПричинаДобавления = "Загружен" Тогда
				
				УспешноЗагружено = УспешноЗагружено + 1;
				
			ИначеЕсли СтрокаТаблицы.НоваяПричинаДобавления = ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи")
				Или СтрокаТаблицы.НоваяПричинаДобавления = ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи")
				Или СтрокаТаблицы.НоваяПричинаДобавления = ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроведения") Тогда
				
				Если СтрокаТаблицы.НовыйСтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженОбновлен")
					Или СтрокаТаблицы.НовыйСтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженСозданНовый") Тогда
					
					ЗагруженоСОшибкойПроведения = ЗагруженоСОшибкойПроведения + 1;
					
				ИначеЕсли СтрокаТаблицы.НовыйСтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеОбновлен")
					Или СтрокаТаблицы.НовыйСтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеСоздан") Тогда
					
					Если СтрокаТаблицы.ВыполненаОтменаПроведения Тогда
						НеЗагруженоОтмененоПроведение          = НеЗагруженоОтмененоПроведение + 1;
					Иначе
						НеЗагруженоСтатусПроведенияНеИзменился = НеЗагруженоСтатусПроведенияНеИзменился + 1;
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				Если СтрокаТаблицы.ВыполненаОтменаПроведения Тогда
					НеЗагруженоОтмененоПроведение          = НеЗагруженоОтмененоПроведение + 1;
				Иначе
					НеЗагруженоСтатусПроведенияНеИзменился = НеЗагруженоСтатусПроведенияНеИзменился + 1;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ИтоговаяИнформация = Новый ФорматированнаяСтрока(ИтоговаяИнформация, Символы.ПС);
	
	ТекстВсегоКЗагрузке = СтрШаблон(НСтр("ru = 'Всего к загрузке - %1'"), ДокументовКЗагрузке);
	ТекстВсегоКЗагрузке = Новый ФорматированнаяСтрока(ТекстВсегоКЗагрузке, , ЦветПоясняющийТекст);
	ИтоговаяИнформация = Новый ФорматированнаяСтрока(ИтоговаяИнформация, Символы.ПС, ТекстВсегоКЗагрузке, Символы.ПС);
	
	Если УспешноЗагружено > 0 Тогда
		
		ТекстУспешноЗагружен = СтрШаблон(НСтр("ru = 'Успешно загружено и проведено - %1'"), УспешноЗагружено);
		ТекстУспешноЗагружен = Новый ФорматированнаяСтрока(ТекстУспешноЗагружен, , ЦветПоясняющийТекст);
		ИтоговаяИнформация   = Новый ФорматированнаяСтрока(ИтоговаяИнформация, Символы.ПС, ТекстУспешноЗагружен);
		
	КонецЕсли;
	
	Если ЗагруженоСОшибкойПроведения > 0 Тогда
		
		ТекстЗагруженСОшибкойПроведения = СтрШаблон(НСтр("ru = 'Загружено с ошибкой проведения - %1'"), ЗагруженоСОшибкойПроведения);
		ТекстЗагруженСОшибкойПроведения = Новый ФорматированнаяСтрока(ТекстЗагруженСОшибкойПроведения, , ЦветПоясняющийТекст);
		ИтоговаяИнформация          = Новый ФорматированнаяСтрока(ИтоговаяИнформация, Символы.ПС, ТекстЗагруженСОшибкойПроведения);
		
	КонецЕсли;
	
	Если НеЗагруженоОтмененоПроведение > 0 Тогда
		
		ТекстНеЗагруженоОтмененоПроведение = СтрШаблон(НСтр("ru = 'Не загружено, отменено проведение - %1'"), НеЗагруженоОтмененоПроведение);
		ТекстНеЗагруженоОтмененоПроведение = Новый ФорматированнаяСтрока(ТекстНеЗагруженоОтмененоПроведение, , ЦветПоясняющийТекст);
		ИтоговаяИнформация                 = Новый ФорматированнаяСтрока(ИтоговаяИнформация, Символы.ПС, ТекстНеЗагруженоОтмененоПроведение);
		
	КонецЕсли;
	
	Если НеЗагруженоСтатусПроведенияНеИзменился > 0 Тогда
		
		ТекстНеЗагруженоСтатусПроведенияНеИзменился = СтрШаблон(НСтр("ru = 'Не загружено, статус проведения не изменялся - %1'"), НеЗагруженоСтатусПроведенияНеИзменился);
		ТекстНеЗагруженоСтатусПроведенияНеИзменился = Новый ФорматированнаяСтрока(ТекстНеЗагруженоСтатусПроведенияНеИзменился, , ЦветПоясняющийТекст);
		ИтоговаяИнформация                          = Новый ФорматированнаяСтрока(ИтоговаяИнформация, Символы.ПС, ТекстНеЗагруженоСтатусПроведенияНеИзменился);
		
	КонецЕсли;
	
	Элементы.ИтоговаяИнформация.Заголовок = ИтоговаяИнформация;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

