///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПереданныеПараметры(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	СохранитьКомментарий(ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата, УзелПланаОбмена, Комментарий);
	
	Закрыть(Комментарий);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СохранитьКомментарий(ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата, УзелПланаОбмена, Комментарий)
	
	РегистрыСведений.ОбъектыКЗагрузке.ИзменитьКомментарий(ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата, УзелПланаОбмена, Комментарий);
	
КонецПроцедуры 

&НаСервере
Процедура ОбработатьПереданныеПараметры(Отказ)
	
	Если Параметры.КлючЗаписиОбъектКЗагрузке = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'В форму не передана информация о проблеме, для которой указывается комментарий.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;

	ПолученныйОбъект   = Параметры.КлючЗаписиОбъектКЗагрузке.ПолученныйОбъект;
	ПравилоКонвертации = Параметры.КлючЗаписиОбъектКЗагрузке.ПравилоКонвертации;
	ОбъектФормата      = Параметры.КлючЗаписиОбъектКЗагрузке.ОбъектФормата;
	УзелПланаОбмена    = Параметры.КлючЗаписиОбъектКЗагрузке.УзелПланаОбмена;
	Комментарий        = Параметры.Комментарий;

КонецПроцедуры

#КонецОбласти
