///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Обработка события конвертации "ПередЗаписьюПолученныхДанных".
// Событие описывает разработчик правил конвертации в КД.
//
// Параметры:
//  КомпонентыОбмена   - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//  ПравилоКонвертации - СтрокаТаблицыЗначений - см. ОбменДаннымиXDTOСервер.ТаблицаПравилКонвертации().
//  ПолученныеДанные - ДокументОбъект, 
//  					СправочникОбъект,
//  					ПланВидовХарактеристикОбъект,
//  					ПланСчетовОбъект,
//  					ПланВидовРасчетаОбъект,
//  					БизнесПроцессОбъект,
//  					ЗадачаОбъект,
//  					РегистрСведенийНаборЗаписей,
//  					РегистрНакопленияНаборЗаписей,
//  					РегистрБухгалтерииНаборЗаписей,
//  					РегистрРасчетаНаборЗаписей - объект информационной базы, в который происходит загрузка данных.
//  ДанныеИБ - Неопределено,
//  		ДокументОбъект,
//  		СправочникОбъект,
//  		ПланВидовХарактеристикОбъект,
//  		ПланСчетовОбъект,
//  		ПланВидовРасчетаОбъект,
//  		БизнесПроцессОбъект,
//  		ЗадачаОбъект,
//  		РегистрСведенийНаборЗаписей,
//  		РегистрНакопленияНаборЗаписей,
//  		РегистрБухгалтерииНаборЗаписей,
//  		РегистрРасчетаНаборЗаписей - объект информационной базы, который найден при идентификации загружаемых данных.
//                                       Если объект соответствующий загружаемому не найден, ДанныеИБ = Неопределено.
//
//
Процедура ПередЗаписьюПолученныхДанных(КомпонентыОбмена, ПравилоКонвертации, ПолученныеДанные, ДанныеИБ) Экспорт
	
	Если ПравилоКонвертации.ЕстьОбработчикПередЗаписьюПолученныхДанных <> Истина Тогда
		
		Возврат;
		
	КонецЕсли;
	
	КонвертацияСвойств = ПравилоКонвертации.Свойства;
	
	МенеджерОбмена = КомпонентыОбмена.МенеджерОбмена;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	СтруктураПараметров.Вставить("ПолученныеДанные", ПолученныеДанные);
	СтруктураПараметров.Вставить("ДанныеИБ", ДанныеИБ);
	СтруктураПараметров.Вставить("КонвертацияСвойств", КонвертацияСвойств);
	
	Попытка
		
		ВремяНачала = ОбменДаннымиОценкаПроизводительности.НачатьЗамер();
		
		ИмяОбработчика = ПравилоКонвертации.ПередЗаписьюПолученныхДанных;
		МенеджерОбмена.ВыполнитьПроцедуруМодуляМенеджера(ИмяОбработчика, СтруктураПараметров);
		
		ОбменДаннымиОценкаПроизводительности.ЗавершитьЗамер(
			ВремяНачала, ИмяОбработчика, ДанныеИБ, КомпонентыОбмена,
			ОбменДаннымиОценкаПроизводительности.ТипСобытияПравило());
		
	Исключение
		
		ОбъектДляПредставления = ?(ДанныеИБ <> Неопределено, ДанныеИБ, ПолученныеДанные);
		ПредставлениеОбъекта = КонвертацияОбъектноРецепцияСервер.ПредставлениеОбъектаДляПротокола(ОбъектДляПредставления);
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьОшибкуСобытияПередЗаписьюПолученныхДанных(КомпонентыОбмена,
			ПредставлениеОбъекта, ОписаниеОшибки);
		
	КонецПопытки;
	
	КомпонентыОбмена = СтруктураПараметров.КомпонентыОбмена;
	ПолученныеДанные = СтруктураПараметров.ПолученныеДанные;
	ДанныеИБ = СтруктураПараметров.ДанныеИБ;
	ПравилоКонвертации.Свойства = КонвертацияСвойств;
	
КонецПроцедуры

// Обработка события конвертации "ПередКонвертацией".
// Событие описывает разработчик правил конвертации в КД.
//
// Параметры:
//  КомпонентыОбмена   - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//
Процедура ПередКонвертацией(КомпонентыОбмена) Экспорт
	
	// Событие "ПередКонвертацией" не привязано к правилам конвертации,
	// поэтому у механизма нет параметра "ЕстьОбработчикПередКонвертацией",
	// а из-за этого вынуждены использовать Попытку ... Исключение.
	
	Попытка
		
		КомпонентыОбмена.МенеджерОбмена.ПередКонвертацией(КомпонентыОбмена);
		
	Исключение
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьОшибкуОбработчикаПередКонвертацией(КомпонентыОбмена, ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

// Обработка события конвертации "ПослеКонвертацииОбъекта".
// Событие описывает разработчик правил конвертации в КД.
//
// Параметры:
//  КомпонентыОбмена   - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//  ПравилоКонвертации - СтрокаТаблицыЗначений - см. ОбменДаннымиXDTOСервер.ТаблицаПравилКонвертации().
//  ДанныеИБ - Неопределено,
//  		ДокументОбъект,
//  		СправочникОбъект,
//  		ПланВидовХарактеристикОбъект,
//  		ПланСчетовОбъект,
//  		ПланВидовРасчетаОбъект,
//  		БизнесПроцессОбъект,
//  		ЗадачаОбъект,
//  		РегистрСведенийНаборЗаписей,
//  		РегистрНакопленияНаборЗаписей,
//  		РегистрБухгалтерииНаборЗаписей,
//  		РегистрРасчетаНаборЗаписей - объект информационной базы, который найден при идентификации загружаемых данных.
//                                       Если объект соответствующий загружаемому не найден, ДанныеИБ = Неопределено.
//  ЗаписьДанныхВыполнена - Булево - флаг, который хранит признак записи результата конвертации (ДанныеИБ).
//                                   ИСТИНА - если ДанныеИБ были проведены (записаны или сохранены),
//                                   ЛОЖЬ - если ДанныеИБ не записаны (не обновлены). Фактически это означает,
//                                          что конвертация произошла, но результат конвертации в ИБ не сохранен.
//
Процедура ПослеКонвертацииОбъекта(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБ, ЗаписьДанныхВыполнена) Экспорт
	
	Если НЕ ПравилоКонвертации.ЕстьОбработчикПослеКонвертацииОбъекта Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МенеджерОбмена = КомпонентыОбмена.МенеджерОбмена;
	ИсторияПримененияТекущегоПКО = КомпонентыОбмена.ИсторияПримененияТекущегоПКО;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	СтруктураПараметров.Вставить("ВнешняяСсылкаСтрокой", ИсторияПримененияТекущегоПКО.ВнешняяСсылкаСтрокой);
	СтруктураПараметров.Вставить("ДанныеИБ", ДанныеИБ);
	СтруктураПараметров.Вставить("ЗаписьДанныхВыполнена", ЗаписьДанныхВыполнена);
	СтруктураПараметров.Вставить("ПравилоКонвертации", ПравилоКонвертации);
	
	Попытка
		
		ВремяНачала = ОбменДаннымиОценкаПроизводительности.НачатьЗамер();
		
		ИмяОбработчика = СокрЛП(ПравилоКонвертации.ПослеКонвертацииОбъекта);
		МенеджерОбмена.ВыполнитьПроцедуруМодуляМенеджера(ИмяОбработчика, СтруктураПараметров);
		
		ОбменДаннымиОценкаПроизводительности.ЗавершитьЗамер(
			ВремяНачала, ИмяОбработчика, ДанныеИБ, КомпонентыОбмена,
			ОбменДаннымиОценкаПроизводительности.ТипСобытияПравило());
		
	Исключение
		
		ПредставлениеОбъекта = КонвертацияОбъектноРецепцияСервер.ПредставлениеОбъектаДляПротокола(ДанныеИБ);
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьОшибкуСобытияПослеКонвертацииОбъекта(КомпонентыОбмена, ПредставлениеОбъекта, ТекстОшибки);
		
	КонецПопытки;
	
	КомпонентыОбмена = СтруктураПараметров.КомпонентыОбмена;
	ДанныеИБ = СтруктураПараметров.ДанныеИБ;
	ЗаписьДанныхВыполнена = СтруктураПараметров.ЗаписьДанныхВыполнена;
	
КонецПроцедуры

// Обработка события конвертации "ПриКонвертацииДанныхXDTO".
// Событие описывает разработчик правил конвертации в КД.
// 
// Параметры:
//   КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//   ПравилоКонвертации - СтрокаТабличнойЧасти - ОбменДаннымиXDTOСервер.ТаблицаПравилКонвертации().
//   ДанныеXDTO - Структура - Данные из сообщения XDTO.
//   ПолученныеДанные - ДокументОбъект, 
//  					СправочникОбъект,
//  					ПланВидовХарактеристикОбъект,
//  					ПланСчетовОбъект,
//  					ПланВидовРасчетаОбъект,
//  					БизнесПроцессОбъект,
//  					ЗадачаОбъект,
//  					РегистрСведенийНаборЗаписей,
//  					РегистрНакопленияНаборЗаписей,
//  					РегистрБухгалтерииНаборЗаписей,
//  					РегистрРасчетаНаборЗаписей - объект информационной базы, в который происходит загрузка данных.
//
Процедура ПриКонвертацииДанныхXDTO(КомпонентыОбмена, ПравилоКонвертации, ДанныеXDTO, ПолученныеДанные) Экспорт
	
	Если НЕ ПравилоКонвертации.ЕстьОбработчикПриКонвертацииДанныхXDTO Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МенеджерОбмена = КомпонентыОбмена.МенеджерОбмена;
	ИмяОбработчика = СокрЛП(ПравилоКонвертации.ПриКонвертацииДанныхXDTO);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	СтруктураПараметров.Вставить("ДанныеXDTO", ДанныеXDTO);
	СтруктураПараметров.Вставить("ПолученныеДанные", ПолученныеДанные);
	
	ВремяНачала = ОбменДаннымиОценкаПроизводительности.НачатьЗамер();
	
	// Тут "Попытка" не нужна, потому что она открыта выше:
	// см. КонвертацияОбъектноСлужебный.КонвертацияСвойствСтруктурыОбъектаXDTO()
	МенеджерОбмена.ВыполнитьПроцедуруМодуляМенеджера(ИмяОбработчика, СтруктураПараметров);
	
	ОбменДаннымиОценкаПроизводительности.ЗавершитьЗамер(
		ВремяНачала, ИмяОбработчика, ПолученныеДанные, КомпонентыОбмена,
		ОбменДаннымиОценкаПроизводительности.ТипСобытияПравило());
		
	КомпонентыОбмена = СтруктураПараметров.КомпонентыОбмена;
	ДанныеXDTO = СтруктураПараметров.ДанныеXDTO;
	ПолученныеДанные = СтруктураПараметров.ПолученныеДанные;
	
КонецПроцедуры

// Обработка события конвертации "ПриПолученииЗапросаВыгрузкиОбъекта".
// Событие описывает разработчик правил конвертации в КД.
// 
// Параметры:
//   КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//   ПравилоКонвертации - СтрокаТабличнойЧасти - ОбменДаннымиXDTOСервер.ТаблицаПравилКонвертации().
//   ОписаниеСсылкиЗапроса - см. КонвертацияОбъектноСервер.КонструкторСсылкаБлокирующаяКонвертацию.
//   ПодобраннаяОбъектнаяСсылка - Неопределено, СправочникСсылка, ДокументСсылка - подобранная ссылка к регистрации.
//
Процедура ПриПолученииЗапросаВыгрузкиОбъекта(КомпонентыОбмена, ПравилоКонвертации, ОписаниеСсылкиЗапроса, ПодобраннаяОбъектнаяСсылка) Экспорт
	
	МенеджерОбмена = КомпонентыОбмена.МенеджерОбмена;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ОписаниеСсылкиЗапроса", ОписаниеСсылкиЗапроса);
	СтруктураПараметров.Вставить("ПодобраннаяОбъектнаяСсылка", ПодобраннаяОбъектнаяСсылка);
	СтруктураПараметров.Вставить("ПравилоКонвертации", ПравилоКонвертации);
	
	Попытка
		
		ИмяОбработчика = ПравилоКонвертации.ПриПодбореСсылкиДляПовторнойОтправки;
		МенеджерОбмена.ВыполнитьПроцедуруМодуляМенеджера(ИмяОбработчика, СтруктураПараметров);
		
	Исключение
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьОшибкуОбработкиЗапросаВыгрузкиОбъекта(КомпонентыОбмена,
			ПравилоКонвертации, ОписаниеСсылкиЗапроса, ПодобраннаяОбъектнаяСсылка, ТекстОшибки);
		
		
	КонецПопытки;
	
	ОписаниеСсылкиЗапроса = СтруктураПараметров.ОписаниеСсылкиЗапроса;
	ПодобраннаяОбъектнаяСсылка = СтруктураПараметров.ПодобраннаяОбъектнаяСсылка;
	
КонецПроцедуры

// Обработка события конвертации "ПриОбработкеСсылокБлокирующихКонвертацию".
// Событие описывает разработчик правил конвертации в КД.
//
// Параметры:
//   КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//   ПолученныеДанные - ДокументОбъект, 
//  					СправочникОбъект,
//  					ПланВидовХарактеристикОбъект,
//  					ПланСчетовОбъект,
//  					ПланВидовРасчетаОбъект,
//  					БизнесПроцессОбъект,
//  					ЗадачаОбъект,
//  					РегистрСведенийНаборЗаписей,
//  					РегистрНакопленияНаборЗаписей,
//  					РегистрБухгалтерииНаборЗаписей,
//  					РегистрРасчетаНаборЗаписей - объект информационной базы, в который происходит загрузка данных.
//
Процедура ПриОбработкеСсылокБлокирующихКонвертацию(КомпонентыОбмена, ПолученныеДанные) Экспорт
	
	ПравилоКонвертации = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПравилоКонвертации;
	Если НЕ ПравилоКонвертации.ЕстьОбработчикПриОбработкеСсылокБлокирующихКонвертацию Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МенеджерОбмена = КомпонентыОбмена.МенеджерОбмена;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	СтруктураПараметров.Вставить("ПолученныеДанные", ПолученныеДанные);
	СтруктураПараметров.Вставить("СсылкиБлокирующиеКонвертацию", 
			КомпонентыОбмена.ИсторияПримененияТекущегоПКО.СсылкиБлокирующиеКонвертацию);
	
	Попытка
		
		ВремяНачала = ОбменДаннымиОценкаПроизводительности.НачатьЗамер();
		
		ИмяОбработчика = ПравилоКонвертации.ПриОбработкеСсылокБлокирующихКонвертацию;
		МенеджерОбмена.ВыполнитьПроцедуруМодуляМенеджера(ИмяОбработчика, СтруктураПараметров);
		
		ОбменДаннымиОценкаПроизводительности.ЗавершитьЗамер(
			ВремяНачала, ИмяОбработчика, ПолученныеДанные, КомпонентыОбмена,
			ОбменДаннымиОценкаПроизводительности.ТипСобытияПравило());
		
	Исключение
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьОшибкуСобытияПриОбработкеСсылокБлокирующихКонвертацию(КомпонентыОбмена, ПолученныеДанные, ТекстОшибки);
		
	КонецПопытки;
	
	КомпонентыОбмена = СтруктураПараметров.КомпонентыОбмена;
	ПолученныеДанные = СтруктураПараметров.ПолученныеДанные;
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.СсылкиБлокирующиеКонвертацию = 
												СтруктураПараметров.СсылкиБлокирующиеКонвертацию;
	
КонецПроцедуры

// Обработка события конвертации "ПриОбработкеПОД".
// Событие описывает разработчик правил конвертации в КД.
//
// Параметры:
//  КомпонентыОбмена   - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//  ДанныеXDTO       - ОбъектXDTO,
//                     Структура - ссылка на объект, подлежащий обработке либо структура, 
//                     соответствующая объекту XDTO (при загрузке). Либо ссылка на объект ИБ (при выгрузке).
//  ИспользованиеПКО - Структура - определяющая по каким ПКО будет выгружен объект
//                     ключи соответствуют именам ПКО, 
//                     значения - признак использования ПКО для конкретного объекта обработки.
//
Процедура ПриОбработкеПОД(КомпонентыОбмена, Знач ДанныеXDTO, ИспользованиеПКО) Экспорт
	
	ПравилоОбработки = КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЗначениеПОД;
	Если ПустаяСтрока(СокрЛП(ПравилоОбработки.ПриОбработке)) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МенеджерОбмена = КомпонентыОбмена.МенеджерОбмена;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	СтруктураПараметров.Вставить("ОбъектОбработки",  ДанныеXDTO);
	СтруктураПараметров.Вставить("ИспользованиеПКО", ИспользованиеПКО);
	
	Попытка
		
		ВремяНачала = ОбменДаннымиОценкаПроизводительности.НачатьЗамер();
		
		ИмяОбработчика = ПравилоОбработки.ПриОбработке;
		МенеджерОбмена.ВыполнитьПроцедуруМодуляМенеджера(ИмяОбработчика, СтруктураПараметров);
		
		ОбменДаннымиОценкаПроизводительности.ЗавершитьЗамер(
			ВремяНачала, ПравилоОбработки.ПриОбработке, ДанныеXDTO, КомпонентыОбмена,
			ОбменДаннымиОценкаПроизводительности.ТипСобытияПравило());
	
	Исключение
		
		Если КомпонентыОбмена.НаправлениеОбмена = "Получение" Тогда
			
			ПредставлениеОбъекта = ПравилоОбработки.ОбъектВыборкиФормат;
			
		Иначе
			
			ПредставлениеОбъекта = КонвертацияОбъектноРецепцияСервер.ПредставлениеОбъектаДляПротокола(ДанныеXDTO, ПравилоОбработки.ОбъектВыборкиМетаданные);
			
		КонецЕсли;
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьОшибкуСобытияПриОбработкеПОД(КомпонентыОбмена, ПредставлениеОбъекта, ТекстОшибки);
		
	КонецПопытки;
	
	КомпонентыОбмена = СтруктураПараметров.КомпонентыОбмена;
	ДанныеXDTO  = СтруктураПараметров.ОбъектОбработки;
	ИспользованиеПКО = СтруктураПараметров.ИспользованиеПКО;
	
КонецПроцедуры

// Обработка события конвертации "ПриУдаленииОбъектаИБ".
// Событие описывает разработчик правил конвертации в КД.
//
// Параметры:
//   КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//   ДанныеИБ - ДокументОбъект, СправочникОбъект - удаляемый объект.
//   УдалитьНепосредственно - Булево - если ИСТИНА, то объект будет удален непосредственно (подробнее см.
//       метод УдалитьИлиПометитьНаУдалениеОбъектИБ() общего модуля КонвертацияОбъектноСлужебный), иначе будет 
//       установлена пометка удаления. Значение по умолчанию ЛОЖЬ.
//   СтандартнаяОбработка - Булево - если ИСТИНА, то используется стандартный алгоритм удаления объектов,
//       иначе удаление будет ограничено только директивами события ПриУдаленииОбъектаИБ.
//
Процедура ПриУдаленииОбъектаИБ(КомпонентыОбмена, ДанныеИБ, УдалитьНепосредственно, СтандартнаяОбработка) Экспорт
	
	МенеджерОбмена = КомпонентыОбмена.МенеджерОбмена;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДанныеИБ", ДанныеИБ);
	СтруктураПараметров.Вставить("УдалитьНепосредственно", УдалитьНепосредственно);
	СтруктураПараметров.Вставить("СтандартнаяОбработка", СтандартнаяОбработка);
	
	ПравилоКонвертации = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПравилоКонвертации;
	
	Попытка
		
		ИмяОбработчика = ПравилоКонвертации.ПриУдаленииОбъектаИБ;
		МенеджерОбмена.ВыполнитьПроцедуруМодуляМенеджера(ИмяОбработчика, СтруктураПараметров);
		
	Исключение
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьОшибкуОбработкиУдаленияОбъекта(КомпонентыОбмена, ДанныеИБ, ТекстОшибки);
		
	КонецПопытки;
	
	ДанныеИБ = СтруктураПараметров.ДанныеИБ;
	УдалитьНепосредственно = СтруктураПараметров.УдалитьНепосредственно;
	СтандартнаяОбработка = СтруктураПараметров.СтандартнаяОбработка;
	
КонецПроцедуры

#КонецОбласти
