///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСИсторией

// Отражает в истории отбираемых полей результаты выбора исторического значения.
// 
// Параметры:
//  ОтображаемыеПоля           - СписокЗначений Из Произвольный - текущие выбранные поля
//  История                    - СписокЗначений Из Произвольный - история выбора полей
//  ИдентификаторСтрокиИстории - Число - идентификатор выбранной строки истории
//
Процедура ОтразитьИзменениеОтображаемыхПолейПослеВыбораВариантаИзИстории(ОтображаемыеПоля, История, ИдентификаторСтрокиИстории) Экспорт
	
	СтрокаИстории = История.НайтиПоИдентификатору(ИдентификаторСтрокиИстории);
	
	Если СтрокаИстории = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("Выбрано", Истина);
	
	ОтображаемыеПоля.ЗаполнитьПометки(Ложь);
	
	ИндексПредыдущегоЭлемента = Неопределено;
	
	Для Каждого ДанныеИстории Из СтрокаИстории.Значение Цикл
		
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("Идентификатор", ДанныеИстории.Идентификатор);
		
		ЭлементСписка = ОтображаемыеПоля.НайтиПоЗначению(ДанныеИстории.Идентификатор);
		Если ЭлементСписка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементСписка.Пометка = Истина;
		
		ИндексТекущегоЭлемента = ОтображаемыеПоля.Индекс(ЭлементСписка);
		
		Если ИндексПредыдущегоЭлемента <>  Неопределено Тогда
			
			Если ИндексТекущегоЭлемента < ИндексПредыдущегоЭлемента Тогда
				
				НовыйЭлемент = ОтображаемыеПоля.Вставить(ИндексПредыдущегоЭлемента + 1, ЭлементСписка.Значение, ЭлементСписка.Представление, ЭлементСписка.Пометка);
				
				ОтображаемыеПоля.Удалить(ИндексТекущегоЭлемента);
				
				ИндексТекущегоЭлемента = ОтображаемыеПоля.Индекс(НовыйЭлемент);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ИндексПредыдущегоЭлемента = ИндексТекущегоЭлемента;
		
	КонецЦикла

КонецПроцедуры

// Формирует список выбора исторического значения отбора.
// 
// Параметры:
//  История - СписокЗначений Из Произвольный
// 
// Возвращаемое значение:
//  СписокЗначений Из Строка
Функция РанееИспользовавшиесяВариантыОтбора(История) Экспорт

	ИспользовавшиесяВарианты = Новый СписокЗначений;
	
	Для Каждого ИсторическиеДанные Из История Цикл
		
		Если ПустаяСтрока(ИсторическиеДанные.Представление) Тогда
			Продолжить;
		КонецЕсли;
		
		ИспользовавшиесяВарианты.Добавить(История.Индекс(ИсторическиеДанные), ИсторическиеДанные.Представление,, БиблиотекаКартинок.История);
		
	КонецЦикла;
	
	Возврат ИспользовавшиесяВарианты;

КонецФункции

#КонецОбласти

#Область ОткрытиеФорм

// Открыть форму настройки действий при получении данных обмена.
// 
// Параметры:
//  УзелИнформационнойБазы - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, для которого открывается форма
//  ТребующиеПодтверждения - Булево - признак необходимости установки отбора по настройкам, установленным автоматически
//
Процедура ОткрытьФормуДействияПриПолученииДанныхОбмена(УзелИнформационнойБазы, ТребующиеПодтверждения = Ложь) Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("УзелПланаОбмена",        УзелИнформационнойБазы);
	ПараметрыОткрытия.Вставить("ТребующиеПодтверждения", ТребующиеПодтверждения);
	
	ОткрытьФорму("РегистрСведений.ДействияПриПолученииДанныхОбмена.Форма.НастройкаДействий", 
	             ПараметрыОткрытия, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Открывает форму проблемы.
// 
// Параметры:
//  ДанныеЗаписи                 - см. РаботаСРезультатамиОбменаКлиентСервер.НовыйКлючЗаписиОбъектыКЗагрузке
//  ВладелецФормы                - ФормаКлиентскогоПриложения - владелец открываемой формы
//  ПричинаДобавления            - ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке,
//                                 ПеречислениеСсылка.СтатусыОбновленияОбъектаПриПроблемахЗаписи -
//  ОповещениеПослеЗакрытия      - ОписаниеОповещения - Оповещение после закрытия
//  ЭтоПовторноеОткрытиеФормыПроблемы - Булево - признак того, что выполняется повторное открытие формы после изменения
//                                               типа проблемы
Процедура ОткрытьФормуПроблемы(ДанныеЗаписи, ВладелецФормы, ПричинаДобавления, ОповещениеПослеЗакрытия, ЭтоПовторноеОткрытиеФормыПроблемы = Ложь) Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДанныеЗаписиОбъектКЗагрузке",  ДанныеЗаписи);
	ПараметрыОткрытия.Вставить("ЭтоПовторноеОткрытиеФормыПроблемы", ЭтоПовторноеОткрытиеФормыПроблемы);
	
	Если ПричинаДобавления = ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаКонвертации") Тогда
		
		ОткрытьФормуПроблемыОшибкаКонвертации(ПараметрыОткрытия, ВладелецФормы, ОповещениеПослеЗакрытия);
		
	ИначеЕсли ПричинаДобавления = ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПодтверждение") Тогда
		
		ОткрытьФормуПроблемыПодтвердитьЗагрузку(ПараметрыОткрытия, ВладелецФормы, ОповещениеПослеЗакрытия);
		
	ИначеЕсли ПричинаДобавления = ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПоискСоответствия") Тогда
		
		ОткрытьФормуПроблемыУстановитьСоответствие(ПараметрыОткрытия, ВладелецФормы, ОповещениеПослеЗакрытия);
		
	ИначеЕсли ПричинаДобавления = ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетЗагрузкуДругихОбъектов") Тогда
		
		ОткрытьФормуПроблемыОжидаетЗагрузкуДругих(ПараметрыОткрытия, ВладелецФормы, ОповещениеПослеЗакрытия);
		
	ИначеЕсли ПричинаДобавления = ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетсяПолучениеЭтогоОбъекта") Тогда
		
		ОткрытьФормуПроблемыОжидаетсяПолучениеЭтогоОбъекта(ПараметрыОткрытия, ВладелецФормы, ОповещениеПослеЗакрытия);
		
	ИначеЕсли ПричинаДобавления = ПредопределенноеЗначение("Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеОбновлен")
		Или ПричинаДобавления = ПредопределенноеЗначение("Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеСоздан") Тогда
		
		ОткрытьФормуПроблемыНеЗагруженПроблемаПриЗаписи(ПараметрыОткрытия, ВладелецФормы, ОповещениеПослеЗакрытия);
		
	ИначеЕсли ПричинаДобавления = ПредопределенноеЗначение("Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженОбновлен")
		Или ПричинаДобавления = ПредопределенноеЗначение("Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженСозданНовый") Тогда
		
		ОткрытьФормуПроблемыЗагруженПроблемаПриЗаписи(ПараметрыОткрытия, ВладелецФормы, ОповещениеПослеЗакрытия);
		
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму установки множественного отбора списка по типу перечисления или произвольному списку
// 
// Параметры:
//  Форма   - ФормаКлиентскогоПриложения              - форма, из которой вызывается отбор
//  Элемент - ПолеФормы                               - элемент формы, из которого вызывается отбор
//  Значения - СписокЗначений Из Произвольный         - значения отбора
//  ТипПеречисления - Тип                             - если передан тип перечисления, то отбор будет доступен по его значения.
//  Заголовок - Строка                                - заголовок формы выбора
//  ДоступныеЗначения                                 - Неопределено, СписокЗначений Из Произвольный - используется если
//      нужно ограничить значения отбора по типу перечисления
//  ПереопределенныеПредставленияЗначенийПеречисления - Неопределено, Соответствие Из Строка - возможность
//      переопределить стандартные представления значений перечисления
Процедура МножественныйОтборСпискаНачалоВыбора(Форма, Элемент, Значения, ТипПеречисления, Заголовок,
	                                           ДоступныеЗначения = Неопределено, ПереопределенныеПредставленияЗначенийПеречисления = Неопределено) Экспорт

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СписокОтбор",                                       Значения);
	ПараметрыОткрытия.Вставить("ТипПеречисления",                                   ТипПеречисления);
	ПараметрыОткрытия.Вставить("Заголовок",                                         Заголовок);
	ПараметрыОткрытия.Вставить("ДоступныеЗначения",                                 ДоступныеЗначения);
	ПараметрыОткрытия.Вставить("ПереопределенныеПредставленияЗначенийПеречисления", ПереопределенныеПредставленияЗначенийПеречисления);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Элемент", Элемент);
	
	// @skip-warning - обработчик оповещения находится в вызывающих формах.
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ФормаМножественногоОтбораПослеЗакрытия", Форма, ДополнительныеПараметры);
	ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.МножественныйОтборСписка", ПараметрыОткрытия, Элемент,,,, ОповещениеОЗакрытии);

КонецПроцедуры

// Повторно открывает форму проблемы после действия пользователя в случае, если изменилась причина добавления
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения              - форма, из которой открывается форма проблемы
//  РезультатОтработки - см. РаботаСРезультатамиОбменаКлиент.ДанныеЗакрытияФормыПроблемыПослеЗагрузки
Процедура ПереоткрытьФормуПроблемыПослеОтработки(Форма, РезультатОтработки) Экспорт
	
	ДанныеЗаписи = РаботаСРезультатамиОбменаКлиентСервер.НовыйКлючЗаписиОбъектыКЗагрузке();
	
	ДанныеЗаписи.ПолученныйОбъект   = РезультатОтработки.ПолученныйОбъект;
	ДанныеЗаписи.ПравилоКонвертации = РезультатОтработки.ПравилоКонвертации;
	ДанныеЗаписи.ОбъектФормата      = РезультатОтработки.ОбъектФормата;
	ДанныеЗаписи.УзелПланаОбмена    = Форма.УзелИнформационнойБазы;
	
	Если ЗначениеЗаполнено(РезультатОтработки.СтатусОбновленияОбъектаВИБ) Тогда
		ТипПроблемы = РезультатОтработки.СтатусОбновленияОбъектаВИБ;
	Иначе
		ТипПроблемы = РезультатОтработки.ПричинаДобавления;
	КонецЕсли;
	
	// @skip-warning - обработчик оповещения находится в вызывающих формах.
	ОповещениеОЗакрытииФормыПроблемы = Новый ОписаниеОповещения("ПослеЗакрытияФормыПроблемы", Форма);
	
	ОткрытьФормуПроблемы(
		ДанныеЗаписи, Форма,
		ТипПроблемы, ОповещениеОЗакрытииФормыПроблемы, Истина);
		
	ПоказатьОповещениеПользователя(НСтр("ru = 'Изменение типа проблемы'"),,
	                               НСтр("ru = 'При загрузке объекта возникла другая проблема. Форма проблемы была открыта заново.'"),
	                               БиблиотекаКартинок.Информация32);
	
КонецПроцедуры 

// Определяет необходимые действия после загрузки объекта из формы проблемы
// 
// Параметры:
//  Форма   - ФормаКлиентскогоПриложения              - форма проблемы, в которой была выполнена загрузка
//  РезультатЗагрузкиОбъекта - см. РаботаСРезультатамиОбмена.РезультатЗагрузкиОбъектаИзФормыПроблемы
// 
// Возвращаемое значение:
//  Структура - содержит:
// * ТребуетсяПовторноеОткрытиеФормыПроблемы - Булево - признак необходимости переоткрыть форму, так как изменился тип проблемы
// * ТребуетсяОбновлениеЭтойФормы            - Булево - признак того, что нужно обновить эту форму
// * ВыполненаУстановкаСоответствия          - Булево - признак того, что при загрузке было установлено соответствие
// * ОбъектЗагружен                          - Булево - признак того, что объект успешно загружен
// * ТребуетсяВыборНовойПроблемы             - Булево - признак того, что потребуется выбор проблемы
// * ТребуетсяЗакрытиеИВыводПредупреждения   - Булево - признак того, что требуется закрыть форму и показать предупреждение
//
Функция НеобходимыеДействияПослеЗагрузкиОбъекта(Форма, РезультатЗагрузкиОбъекта) Экспорт
	
	НеобходимыеДействия = Новый Структура;
	НеобходимыеДействия.Вставить("ТребуетсяПовторноеОткрытиеФормыПроблемы",    Ложь);
	НеобходимыеДействия.Вставить("ТребуетсяОбновлениеЭтойФормы",          Ложь);
	НеобходимыеДействия.Вставить("ТребуетсяЗакрытиеИВыводПредупреждения", Ложь);
	НеобходимыеДействия.Вставить("ВыполненаУстановкаСоответствия",        Ложь);
	НеобходимыеДействия.Вставить("ОбъектЗагружен",                        Ложь);
	НеобходимыеДействия.Вставить("ТребуетсяВыборНовойПроблемы",           Ложь);
	
	НеобходимыеДействия.ТребуетсяВыборНовойПроблемы           = РезультатЗагрузкиОбъекта.СтатусыЗагрузки.Количество() > 1;
	НеобходимыеДействия.ВыполненаУстановкаСоответствия        = РезультатЗагрузкиОбъекта.УстановленныеСоответствия.Количество() > 0;
	НеобходимыеДействия.ТребуетсяЗакрытиеИВыводПредупреждения = РезультатЗагрузкиОбъекта.РезультатОбработки.Получить("ОтказОтЗагрузкиПослеКонвертации") <> Неопределено;
	
	Если НеобходимыеДействия.ТребуетсяВыборНовойПроблемы
		Или НеобходимыеДействия.ТребуетсяЗакрытиеИВыводПредупреждения Тогда
		
		Возврат НеобходимыеДействия;
		
	КонецЕсли;
	
	НеобходимыеДействия.ТребуетсяПовторноеОткрытиеФормыПроблемы = 
		ТипЗнч(РезультатЗагрузкиОбъекта.РезультатОбработки) = Тип("ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке")
		И РезультатЗагрузкиОбъекта.РезультатОбработки <> Форма.ПричинаДобавления;
	
	НеобходимыеДействия.ТребуетсяОбновлениеЭтойФормы       = РезультатЗагрузкиОбъекта.РезультатОбработки.Получить(Форма.ПричинаДобавления) <> Неопределено;
	НеобходимыеДействия.ОбъектЗагружен                     = РезультатЗагрузкиОбъекта.РезультатОбработки.Получить("Загружен") <> Неопределено;
	НеобходимыеДействия.ТребуетсяПовторноеОткрытиеФормыПроблемы = (Не НеобходимыеДействия.ТребуетсяОбновлениеЭтойФормы)
	                                                          И (Не НеобходимыеДействия.ОбъектЗагружен);
	
	Если РезультатЗагрузкиОбъекта.УстановленныеСоответствия.Количество() > 0 Тогда
		Форма.СоответствиеВИБ = РезультатЗагрузкиОбъекта.УстановленныеСоответствия[0].ОбъектИБ;
	КонецЕсли;
	
	Если НеобходимыеДействия.ОбъектЗагружен Тогда
		
		Оповестить("Запись_ПричинаДобавленияОбъектыКЗагрузке");
		ОповеститьОЗагрузкеОбъекта(Форма.СоответствиеВИБ);
		
	ИначеЕсли НеобходимыеДействия.ТребуетсяПовторноеОткрытиеФормыПроблемы
		Или НеобходимыеДействия.ТребуетсяЗакрытиеИВыводПредупреждения Тогда
		
		Оповестить("Запись_ПричинаДобавленияОбъектыКЗагрузке");
		
	КонецЕсли;
	
	Возврат НеобходимыеДействия;
	
КонецФункции

// Открывает форму выбора объекта для установки соответствия
// 
// Параметры:
//  Форма                      - ФормаКлиентскогоПриложения - форма, из которой вызывается отбор
//  ПолноеИмяОбъектаМетаданных - Строка                     - полное имя объекта метаданных, из элементов которого будет
//                                                            осуществляться выбор
//  ПараметрыВыбора            - Неопределено, Структура - содержит:
//   * ПолученныйОбъект           - Строка                     - идентификатор полученного объекта, для которого
//                                                               выбирается соответствие
//   * ПравилоКонвертации         - Строка                     - правило конвертации полученного объекта
//   * ОбъектФормата              - Строка                     - объект формата полученного объекта
//   * ТекущиеДанные              - ДанныеФормыСтруктура       - строка списка для которой вызывается форма сопоставления
//
Процедура ОткрытьФормуВыбораОбъектаДляУстановкиСоответствия(Форма, ПолноеИмяОбъектаМетаданных, ПараметрыВыбора = Неопределено) Экспорт
	
	Если ПустаяСтрока(ПолноеИмяОбъектаМетаданных) Тогда
		
		ТекстСообщения = НСтр("ru = 'Не определен тип объекта метаданных, который будет сопоставлен загружаемому объекта. Сопоставление объекту ИБ недоступно.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,);
		Возврат;
		
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Действие",                 "ВопросЕслиСоответствиеЕсть");
	Если ПараметрыВыбора <> Неопределено Тогда
		ДополнительныеПараметры.Вставить("ПолученныйОбъект",         ПараметрыВыбора.ПолученныйОбъект);
		ДополнительныеПараметры.Вставить("ПравилоКонвертации",       ПараметрыВыбора.ПравилоКонвертации);
		ДополнительныеПараметры.Вставить("ОбъектФормата",            ПараметрыВыбора.ОбъектФормата);
		ДополнительныеПараметры.Вставить("ТекущиеДанные",            ПараметрыВыбора.ТекущиеДанные);
	Иначе
		ДополнительныеПараметры.Вставить("ПолученныйОбъект",         Форма.ПолученныйОбъект);
		ДополнительныеПараметры.Вставить("ПравилоКонвертации",       Форма.ПравилоКонвертации);
		ДополнительныеПараметры.Вставить("ОбъектФормата",            Форма.ОбъектФормата);
	КонецЕсли;
	
	// @skip-warning - обработчик оповещения находится в вызывающих формах.
	ОповещениеПослеВыбораСопоставляемогоЭлемента = Новый ОписаниеОповещения("ПослеРучногоВыбораСоответствияИБ",
	                                                                        Форма, 
	                                                                        ДополнительныеПараметры);
	
	СтандартнаяОбработка = Истина;
	ОбменДаннымиКлиентПереопределяемый.ПриНачалеВыбораОбъектаДляУстановкиСоответствия(СтандартнаяОбработка, Форма, ПолноеИмяОбъектаМетаданных, ОповещениеПослеВыбораСопоставляемогоЭлемента);
	
	Если СтандартнаяОбработка = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму(ПолноеИмяОбъектаМетаданных + ".ФормаВыбора", ПараметрыОткрытия , ЭтотОбъект,,,,
	             ОповещениеПослеВыбораСопоставляемогоЭлемента, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Открывает форму выбора объекта для установки соответствия в форме списка
// 
// Параметры:
//  Форма                         - ФормаКлиентскогоПриложения - форма, из которой вызывается отбор
//  ИмяСписка                     - Строка               - имя списка на форме, для объекта которого выполняется выбор
//  ИмяРеквизитаПолученныйОбъект  - Строка - Имя реквизита списка, который содержит полученный объект
//  ПолноеИмяОбъектаМетаданных    - Строка     - полное имя объекта метаданных, из элементов которого будет
//                                               осуществляться выбор
//
Процедура ОткрытьФормуВыбораОбъектаДляУстановкиСоответствияВФормеСписка(Форма, ИмяСписка, ИмяРеквизитаПолученныйОбъект = "ПолученныйОбъект", ПолноеИмяОбъектаМетаданных = "") Экспорт
	
	ОчиститьСообщения();
	
	ТекущиеДанные = Форма.Элементы[ИмяСписка].ТекущиеДанные;
	ТекущаяСтрока = Форма.Элементы[ИмяСписка].ТекущаяСтрока;
	
	Если ТекущиеДанные = Неопределено
		Или ТипЗнч(ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Невозможно выполнить команду для указанного объекта'"));
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СоответствиеВИБ) Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Полученному объекту уже установлено соответствие в текущей информационной базе'"));
		Возврат;
		
	КонецЕсли;
	
	Если ПустаяСтрока(ПолноеИмяОбъектаМетаданных) Тогда
		ПолноеИмяОбъектаМетаданных = ТекущиеДанные.ПолноеИмяОбъектаМетаданных;
	КонецЕсли;
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("ПолученныйОбъект",   ТекущиеДанные[ИмяРеквизитаПолученныйОбъект]);
	ПараметрыВыбора.Вставить("ПравилоКонвертации", ТекущиеДанные.ПравилоКонвертации);
	ПараметрыВыбора.Вставить("ОбъектФормата",      ТекущиеДанные.ОбъектФормата);
	ПараметрыВыбора.Вставить("ТекущиеДанные",        ТекущиеДанные);
	
	ОткрытьФормуВыбораОбъектаДляУстановкиСоответствия(
		Форма,
		ПолноеИмяОбъектаМетаданных,
		ПараметрыВыбора);
	
КонецПроцедуры

// Открывает форму предупреждения, что для выбранного объекта уже установлено соответствие
// 
// Параметры:
//  Форма                           - ФормаКлиентскогоПриложения - форма, для которой выполнялся выбор
//  ВыбранныйОбъект                 - Произвольный               - объект ИБ, который выбран как соответствие
//                                                                 полученному объекту
//  УжеСопоставленныеИдентификаторы - Массив Из Строка           - идентификаторы объектов, которые уже сопоставлены
//                                                                 выбранному объекту
//  ДанныеОбъекта                   - Структура                  - содержит:
//    *ПолученныйОбъект                - Строка                  - идентификатор полученного объекта, для которого
//                                                                 выбиралось соответствие
//    *ПравилоКонвертации              - Строка                  - правило конвертации полученного объекта
//    *ОбъектФормата                   - Строка                  - имя объекта формата
//  УзелИнформационнойБазы          - ПланОбменаСсылка           - план обмена приложения-корреспондента
//  ТекущиеДанные                   - ДанныеФормыКоллекция, Неопределено - данные строки таблицы формы, для которой
//                                                                         выполнялся выбор
//
Процедура ОткрытьФормуСоответствиеУжеУстановлено(Форма, ВыбранныйОбъект, УжеСопоставленныеИдентификаторы, ДанныеОбъекта, УзелИнформационнойБазы, ТекущиеДанные = Неопределено) Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВыбранныйОбъект",                 ВыбранныйОбъект);
	ПараметрыОткрытия.Вставить("ПолученныйОбъект",                ДанныеОбъекта.ПолученныйОбъект);
	ПараметрыОткрытия.Вставить("УжеСопоставленныеИдентификаторы", УжеСопоставленныеИдентификаторы);
	ПараметрыОткрытия.Вставить("УзелПланаОбмена",                 УзелИнформационнойБазы);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыбранныйОбъект",    ВыбранныйОбъект);
	ДополнительныеПараметры.Вставить("ПолученныйОбъект",   ДанныеОбъекта.ПолученныйОбъект);
	ДополнительныеПараметры.Вставить("ПравилоКонвертации", ДанныеОбъекта.ПравилоКонвертации);
	ДополнительныеПараметры.Вставить("ОбъектФормата",      ДанныеОбъекта.ОбъектФормата);
	ДополнительныеПараметры.Вставить("Форма",              Форма);
	ДополнительныеПараметры.Вставить("ТекущиеДанные",      ТекущиеДанные);
	
	ОповещениеОВыборе = Новый ОписаниеОповещения("ПослеВыбораВФормеСоответствиеУжеУстановлено", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ПредупреждениеСоответствиеУжеУстановлено", ПараметрыОткрытия, Форма,
	             ,,, ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца) 
	
КонецПроцедуры

// Обработчик принятия решения в форме, предупреждающей пользователя, что для выбранного объекта ИБ уже установлено соответствие.
// 
// Параметры:
//  Результат                 - Булево, Неопределено - признак того, что пользователь подтвердил установку
//  ДополнительныеПараметры   - Структура - содержит:
//   *ПолученныйОбъект        - Строка                     - идентификатор полученного объекта, для которого выбиралось соответствие
//   *ПравилоКонвертации      - Строка                     - правило конвертации полученного объекта
//   *ОбъектФормата           - Строка                     - правило конвертации полученного объекта
//   *ВыбранныйОбъект         - Произвольный               - объект ИБ, который выбран как соответствие полученному объекту
//   *ТекущиеДанные           - ДанныеФормыКоллекция, Неопределено - данные строки таблицы формы, для которой выполнялся
//                                                                   выбор
//
Процедура ПослеВыбораВФормеСоответствиеУжеУстановлено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ПолученныйОбъект",   ДополнительныеПараметры.ПолученныйОбъект);
	ПараметрыОповещения.Вставить("ПравилоКонвертации", ДополнительныеПараметры.ПравилоКонвертации);
	ПараметрыОповещения.Вставить("ОбъектФормата",      ДополнительныеПараметры.ОбъектФормата);
	ПараметрыОповещения.Вставить("Действие",           "УстановитьСоответствие");
	ПараметрыОповещения.Вставить("ТекущиеДанные",      ДополнительныеПараметры.ТекущиеДанные);
	
	// @skip-warning - обработчик оповещения находится в вызывающих формах.
	ОповещениеПослеПодтвержденияСопоставляемогоЭлемента = Новый ОписаниеОповещения("ПослеРучногоВыбораСоответствияИБ",
	                                                                                ДополнительныеПараметры.Форма, 
	                                                                                ПараметрыОповещения);
	
	ВыполнитьОбработкуОповещения(ОповещениеПослеПодтвержденияСопоставляемогоЭлемента, ДополнительныеПараметры.ВыбранныйОбъект);
	
КонецПроцедуры

// Переходит по внешней ссылке из формы списка полученных объектов
// 
// Параметры:
//  Форма      - ФормаКлиентскогоПриложения - форма, в которой выполняется действий
//  ИмяСписка  - Строка               - имя списка на форме, в котором выполняется действие
//
Процедура ПерейтиПоВнешнейСсылкеНаОбъектИзФормыСписка(Форма, ИмяСписка) Экспорт
	
	ТекущиеДанные = Форма.Элементы[ИмяСписка].ТекущиеДанные;
	ТекущаяСтрока = Форма.Элементы[ИмяСписка].ТекущаяСтрока;
	
	Если ТекущиеДанные = Неопределено
		Или ТипЗнч(ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Невозможно выполнить команду для указанного объекта'"));
		Возврат;
	КонецЕсли;
	
	ВнешняяСсылкаНаОбъект = ТекущиеДанные.ВнешняяСсылкаНаОбъект;
	
	Если ЗначениеЗаполнено(ВнешняяСсылкаНаОбъект) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ВнешняяСсылкаНаОбъект);
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Для загружаемого объекта на указана внешняя ссылка на объект'"));
	КонецЕсли;
	
КонецПроцедуры

// Переходит по внешней ссылке из формы проблемы
// 
// Параметры:
//  ВнешняяСсылкаНаОбъект - Строка - форма, в которой выполняется действие
//  ИмяЭлемента           - Строка - имя элемента для которого будет выведено сообщение об ошибке
//
Процедура ПерейтиПоВнешнейСсылкеНаОбъект(ВнешняяСсылкаНаОбъект, ИмяЭлемента) Экспорт

	Если ЗначениеЗаполнено(ВнешняяСсылкаНаОбъект) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ВнешняяСсылкаНаОбъект);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Внешняя ссылка на загружаемый объект отсутствует'"),, ИмяЭлемента,,);
	КонецЕсли;
		
КонецПроцедуры

// Открывает соответствие в ИБ полученному объекту из формы проблемы
// 
// Параметры:
//  СоответствиеВИБ - Неопределено, Произвольный - форма, в которой выполняется действие
//  ИмяЭлемента     - Строка - имя элемента для которого будет выведено сообщение об ошибке
//
Процедура ОткрытьСоответствиеВИБ(СоответствиеВИБ, ИмяЭлемента) Экспорт
	
	Если ЗначениеЗаполнено(СоответствиеВИБ) Тогда
		ПоказатьЗначение(, СоответствиеВИБ);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Соответствие в ИБ загружаемому объекту не задано'"),, ИмяЭлемента,,);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет переход  в форму комментария из формы проблемы
// 
// Параметры:
//  Форма                  - ФормаКлиентскогоПриложения     - форма, в которой выполняется действие
//  УзелПланаОбмена        - ПланОбменаСсылкаИмяПланаОбмена - узел, из которого получено сообщение
//  ПолученныйОбъект       - Строка                         - идентификатор полученного объекта
//  ОбъектФормата          - Строка                         - имя объекта формата полученного объекта
//  ПравилоКонвертации     - Строка                         - 
//  Комментарий            - Строка                         - текущий комментарий
//
Процедура ПерейтиВКомментарий(Форма, УзелПланаОбмена, ПолученныйОбъект, ОбъектФормата, ПравилоКонвертации, Комментарий) Экспорт
	
	ПараметрыОткрытия = НовыйПараметрыОткрытияФормыКомментария();
	ПараметрыОткрытия.КлючЗаписиОбъектКЗагрузке.ПолученныйОбъект   = ПолученныйОбъект;
	ПараметрыОткрытия.КлючЗаписиОбъектКЗагрузке.ПравилоКонвертации = ПравилоКонвертации;
	ПараметрыОткрытия.КлючЗаписиОбъектКЗагрузке.ОбъектФормата      = ОбъектФормата;
	ПараметрыОткрытия.КлючЗаписиОбъектКЗагрузке.УзелПланаОбмена    = УзелПланаОбмена;
	ПараметрыОткрытия.Комментарий                                  = Комментарий;
	
	// @skip-warning - обработчик оповещения находится в вызывающих формах.
	ОповещениеПослеЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияФормыКомментария", Форма);
	
	ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.РедактированиеКомментария", 
	             ПараметрыОткрытия, Форма,,,, ОповещениеПослеЗакрытия,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Открывает форму выбора объекта для установки соответствия в форме проблемы, если соответствие еще не установлено
// 
// Параметры:
//  Форма                         - ФормаКлиентскогоПриложения - форма, из которой вызывается отбор
//  СоответствиеВИБ               - Неопределено, Произвольный - текущее соответствие объекту в ИБ
//  ПолноеИмяОбъектаМетаданных    - Строка - полное имя объекта метаданных, из элементов которого будет осуществляться выбор
//  ИмяЭлемента                   - Строка - Имя элемента формы, для которого будет выведено сообщение об ошибке
//
Процедура УстановитьСоответствиеВИБЕслиОтсутствует(Форма, СоответствиеВИБ, ПолноеИмяОбъектаМетаданных, ИмяЭлемента) Экспорт

	Если Не ЗначениеЗаполнено(СоответствиеВИБ) Тогда
		ОткрытьФормуВыбораОбъектаДляУстановкиСоответствия(Форма, ПолноеИмяОбъектаМетаданных);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Соответствие в ИБ загружаемому объекту уже установлено'"),, ИмяЭлемента,,);
	КонецЕсли;
		
КонецПроцедуры

// Показывает оповещение пользователю в случае если при загрузке тип проблемы не изменился, а форма проблемы была перезаполнена.
//
Процедура ПоказатьОповещениеПроблемаНеИзменилась() Экспорт

	ПоказатьОповещениеПользователя(НСтр("ru = 'Проблема при загрузке'"),, НСтр("ru = 'Загрузка завершилась с такой же проблемой.Форма была перезаполнена'"));

КонецПроцедуры

#КонецОбласти

#Область РедактированиеПериода

// Вызывает диалог редактирования периода.
// 
// Параметры:
//  Объект - Произвольный - Объект, для которого редактируется период
//  ПараметрыПериода - Структура - содержит:
//   * ДатаНачала    - Дата
//   * ДатаОкончания - Дата
//   * Вариант       - ВариантСтандартногоПериода
//  ОповещениеПослеВыбора - ОписаниеОповещения - Оповещение после выбора
//
Процедура РедактироватьПериод(Объект, ПараметрыПериода = Неопределено, ОповещениеПослеВыбора = Неопределено) Экспорт
	
	Если ПараметрыПериода = Неопределено Тогда
		ПараметрыПериода = Новый Структура("ДатаНачала, ДатаОкончания", "ДатаНачала", "ДатаОкончания");
	КонецЕсли;
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Если ПараметрыПериода.Свойство("ДатаНачала") Тогда
		Диалог.Период.ДатаНачала = Объект[ПараметрыПериода.ДатаНачала];
	КонецЕсли; 
	Если ПараметрыПериода.Свойство("ДатаОкончания") Тогда
		Диалог.Период.ДатаОкончания = Объект[ПараметрыПериода.ДатаОкончания];
	КонецЕсли; 
	Если ПараметрыПериода.Свойство("Вариант") Тогда
		Диалог.Период.Вариант = ПараметрыПериода.Вариант;
	КонецЕсли; 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект",           Объект);
	ДополнительныеПараметры.Вставить("ПараметрыПериода", ПараметрыПериода);
	Если ОповещениеПослеВыбора <> Неопределено Тогда
		ДополнительныеПараметры.Вставить("ОповещениеПослеВыбора", ОповещениеПослеВыбора);
	КонецЕсли; 
	
	Оповещение = Новый ОписаниеОповещения(
		"РедактироватьПериодЗавершение", 
		ЭтотОбъект, 
		ДополнительныеПараметры);
	
	Диалог.Показать(Оповещение);

КонецПроцедуры

// Обработчик результата редактирования периода.
// 
// Параметры:
//  Период                  - СтандартныйПериод - 
//  ДополнительныеПараметры - Структура -
//
Процедура РедактироватьПериодЗавершение(Период, ДополнительныеПараметры) Экспорт 

	ПараметрыПериода = ДополнительныеПараметры.ПараметрыПериода;
	Объект           = ДополнительныеПараметры.Объект;
	Если Период <> Неопределено Тогда
		Если ПараметрыПериода.Свойство("ДатаНачала") Тогда
			Объект[ПараметрыПериода.ДатаНачала]= Период.ДатаНачала;
		КонецЕсли; 
		Если ПараметрыПериода.Свойство("ДатаОкончания") Тогда
			Объект[ПараметрыПериода.ДатаОкончания]= Период.ДатаОкончания;
		КонецЕсли; 
		Если ПараметрыПериода.Свойство("Вариант") Тогда
			Объект[ПараметрыПериода.Вариант]= Период.Вариант;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ОповещениеПослеВыбора") Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПослеВыбора, Период);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПриИзмененииВыбраноФормаТриЗначения

// Обрабатывает изменение выбран в форме три значения.
// 
// Параметры:
//  Форма              - ФормаКлиентскогоПриложения - форма, в которой выполняется действие
//  ИмяТаблицы         - Строка - Имя таблицы формы, в которой выполняется изменения
//  ИмяРеквизитаВыбран - Строка - имя колонки формы, в которой находится признак "Выбран"
//
Процедура ПриИзмененииВыбраноФормаТриЗначения(Форма, ИмяТаблицы, ИмяРеквизитаВыбран) Экспорт
	
	ТекущиеДанные = Форма.Элементы[ИмяТаблицы].ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные[ИмяРеквизитаВыбран] = 2 Тогда
			
			ТекущиеДанные[ИмяРеквизитаВыбран] = 0;
			
	КонецЕсли;
	
	РодительскаяСтрока = ТекущиеДанные.ПолучитьРодителя();
	
	Если РодительскаяСтрока = Неопределено Тогда
		
		УстановитьЗначениеПереключателяДляДочернихСтрок(ТекущиеДанные, ИмяРеквизитаВыбран);
		
	Иначе
		
		РаботаСРезультатамиОбменаКлиентСервер.ОпределитьЗначениеПереключателяДляРодительскойСтроки(РодительскаяСтрока, ИмяРеквизитаВыбран);
		
	КонецЕсли;
	
КонецПроцедуры 

// Изменяет значение всех флагов в дереве формы.
// 
// Параметры:
//  ДеревоФормы        - ДанныеФормыДерево - коллекция, в которой выполняется действие
//  Установить         - Булево - устанавливаемое значение флага
//
Процедура ИзменитьЗначениеФлаговВДереве(ДеревоФормы, Установить) Экспорт
	
	Для Каждого СтрокаДерева Из ДеревоФормы.ПолучитьЭлементы() Цикл
		
		СтрокаДерева.Выбран = Установить;
		
		ИзменитьЗначениеФлаговВДереве(СтрокаДерева, Установить);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Отчеты

// Выполняет обработку расшифровки в отчетах.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которую выведен отчет
//  Расшифровка - Структура - содержит:
//   * ПолученныйОбъект    - Строка
//   * ПравилоКонвертации  - Строка
//   * ОбъектФормата       - Строка
//  СтандартнаяОбработка   - Булево - признак переопределения стандартной обработки объекта
//  УзелИнформационнойБазы - ПланОбменаСсылкаИмяПланаОбмена - приложение корреспондент, из которого получены данные
Процедура ОбработкаРасшифровкиОтчетов(Форма, Расшифровка, СтандартнаяОбработка, УзелИнформационнойБазы) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеЗаписи = РаботаСРезультатамиОбменаКлиентСервер.НовыйКлючЗаписиОбъектыКЗагрузке();
	
	ДанныеЗаписи.ПолученныйОбъект   = Расшифровка.ПолученныйОбъект;
	ДанныеЗаписи.ПравилоКонвертации = Расшифровка.ПравилоКонвертации;
	ДанныеЗаписи.ОбъектФормата      = Расшифровка.ОбъектФормата;
	ДанныеЗаписи.УзелПланаОбмена    = УзелИнформационнойБазы;
	
	// @skip-warning - обработчик оповещения находится в вызывающих формах.
	ОповещениеОЗакрытииФормыПроблемы = Новый ОписаниеОповещения("ПослеЗакрытияФормыПроблемы", Форма);
	
	ОткрытьФормуПроблемы(
		ДанныеЗаписи, Форма,
		Расшифровка.ПричинаДляОткрытия, ОповещениеОЗакрытииФормыПроблемы);
	
КонецПроцедуры

// Открывает форму отчета "Блокируемые объекты".
// 
// Параметры:
//  Форма                  - ФормаКлиентскогоПриложения     - форма, из которой открывается отчет
//  ПолученныйОбъект       - Строка                         - идентификатор полученного объекта
//  ОбъектФормата          - Строка                         - имя объекта формата полученного объекта
//  УзелИнформационнойБазы - ПланОбменаСсылкаИмяПланаОбмена - приложение корреспондент, из которого получены данные
//
Процедура ОткрытьФормуБлокируемыеОбъекты(Форма, ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы) Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ОбъектКПолучению",       ПолученныйОбъект);
	ПараметрыОткрытия.Вставить("УзелИнформационнойБазы", УзелИнформационнойБазы);
	ПараметрыОткрытия.Вставить("ОбъектФормата",          ОбъектФормата);
	
	ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.БлокируемыеОбъекты", ПараметрыОткрытия, Форма,
	             ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Открывает форму отчета "Полученные данные".
// 
// Параметры:
//  Форма                  - ФормаКлиентскогоПриложения     - форма, из которой открывается отчет
//  ПолученныйОбъект       - Строка                         - идентификатор полученного объекта
//  ПравилоКонвертации     - Строка
//  ОбъектФормата          - Строка
//  УзелИнформационнойБазы - ПланОбменаСсылкаИмяПланаОбмена - приложение корреспондент, из которого получены данные
Процедура ОткрытьФормуПолученныеДанные(Форма, ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата, УзелИнформационнойБазы) Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ПолученныйОбъект",       ПолученныйОбъект);
	ПараметрыОткрытия.Вставить("УзелИнформационнойБазы", УзелИнформационнойБазы);
	ПараметрыОткрытия.Вставить("ПравилоКонвертации",     ПравилоКонвертации);
	ПараметрыОткрытия.Вставить("ОбъектФормата",          ОбъектФормата);
	
	ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ПолученныеДанные", ПараметрыОткрытия, Форма,
	             ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Выполняет в форме проблемы переход к отчету "Сравнение данных".
// 
// Параметры:
//  СоответствиеВИБ        - Неопределено, Произвольный     - объект в ИБ, соответствующий полученным данным
//  ЭлементыФормы          - ЭлементыФормы                  - коллекция элементов формы, в которой выведен отчет
//  ИмяЭлементаСообщения   - Строка                         - имя элемента формы, к которому будет привязано сообщение
//
Процедура ПерейтиКОтчетуСравнениеДанных(СоответствиеВИБ, ЭлементыФормы, ИмяЭлементаСообщения) Экспорт
	
	Если ЗначениеЗаполнено(СоответствиеВИБ) Тогда
		
		ЭлементыФормы.СтраницыФормы.ТекущаяСтраница                     = ЭлементыФормы.СтраницаОсновное;
		ЭлементыФормы.СтраницыПолученныйОбъектСравнение.ТекущаяСтраница = ЭлементыФормы.СтраницаСравнениеСТекущим;
		
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Соответствие в ИБ загружаемому объекту не задано'"),, ИмяЭлементаСообщения,,);
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет в форме проблемы переход к отчету "Полученные данные".
// 
// Параметры:
//  СоответствиеВИБ        - Неопределено, Произвольный     - объект в ИБ, соответствующий полученным данным
//  ЭлементыФормы          - ЭлементыФормы                  - коллекция элементов формы, в которой выведен отчет
//  ИмяЭлементаСообщения   - Строка                         - имя элемента формы, к которому будет привязано сообщение
//
Процедура ПерейтиКОтчетуПолученныеДанные( ЭлементыФормы, ИмяЭлементаСообщения) Экспорт
	
	ЭлементыФормы.СтраницыФормы.ТекущаяСтраница                     = ЭлементыФормы.СтраницаОсновное;
	ЭлементыФормы.СтраницыПолученныйОбъектСравнение.ТекущаяСтраница = ЭлементыФормы.СтраницаПолученныйОбъект;
	
КонецПроцедуры

// Разворачивает верхний уровень в деревьях выбора отображаемых реквизитов, если только один узел верхнего уровня
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, для которой выполняется действие
//
Процедура ОпределитьНеобходимостьРазворачиванияУзловОтображаемыеРеквизиты(Форма) Экспорт
	
	СтрокиВерхнегоУровня = Форма.ОтображаемыеРеквизиты.ПолучитьЭлементы();
	ЭлементыФормы        = Форма.Элементы;
	
	Если СтрокиВерхнегоУровня.Количество() = 1 Тогда
		
		ЭлементыФормы.ОтображаемыеРеквизитыПолученныйОбъект.Развернуть(СтрокиВерхнегоУровня[0].ПолучитьИдентификатор());
		ЭлементыФормы.ОтображаемыеРеквизитыСравнениеОбъектов.Развернуть(СтрокиВерхнегоУровня[0].ПолучитьИдентификатор());
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормПроблем

Функция НовыйДанныеПроблемыКОбработке() Экспорт
	
	ДанныеПроблемы = Новый Структура;
	ДанныеПроблемы.Вставить("ПолученныйОбъект",                "");
	ДанныеПроблемы.Вставить("ПравилоКонвертации",              "");
	ДанныеПроблемы.Вставить("ОбъектФормата     ",              "");
	ДанныеПроблемы.Вставить("УзелПланаОбмена",                 "");
	ДанныеПроблемы.Вставить("ДатаУстановкиПричиныДобавления",  Дата(1, 1, 1));
	ДанныеПроблемы.Вставить("УстановленноеСоответствие",       Неопределено);
	ДанныеПроблемы.Вставить("СоответствиеВИБ",                 Неопределено);
	ДанныеПроблемы.Вставить("ДатаОбрабатываемойВерсии",        Дата(1, 1, 1));
	ДанныеПроблемы.Вставить("ПричинаДобавления",               ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ПустаяСсылка"));
	ДанныеПроблемы.Вставить("ИгнорироватьНедостающиеСсылки",   Ложь);
	ДанныеПроблемы.Вставить("ИгнорироватьПроблемыПриЗаписи",   Ложь);
	
	Возврат ДанныеПроблемы;
	
КонецФункции

Функция НовыйРезультатОбработкиВФормеПроблемы() Экспорт
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("ПолученныйОбъект",                      "");
	РезультатОбработки.Вставить("ПравилоКонвертации",                    "");
	РезультатОбработки.Вставить("ОбъектФормата",                         "");
	РезультатОбработки.Вставить("ТекстПредупреждения",                   "");
	РезультатОбработки.Вставить("УстановленоСоответствие",               Ложь);
	РезультатОбработки.Вставить("ИдентификаторФоновогоЗадания",          Неопределено);
	РезультатОбработки.Вставить("ОткрытьОбъектИБПослеОбработки",         Ложь);
	РезультатОбработки.Вставить("ОбъектИБ",                              Ложь);
	РезультатОбработки.Вставить("ПереоткрытьФормуПроблему",              Ложь);
	РезультатОбработки.Вставить("ТребуетсяВыборНовойПроблемы",           Ложь);
	РезультатОбработки.Вставить("ТребуетсяЗакрытиеИВыводПредупреждения", Ложь);
	РезультатОбработки.Вставить("СтатусыЗагрузки",                       Неопределено);
	РезультатОбработки.Вставить("ПричинаДобавления",                     ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ПустаяСсылка"));
	РезультатОбработки.Вставить("СтатусОбновленияОбъектаВИБ",            ПредопределенноеЗначение("Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ПустаяСсылка"));
	
	Возврат РезультатОбработки;
	
КонецФункции

Функция ДанныеПроблемыКОбработкеПоДаннымФормы(Форма) Экспорт
	
	ДанныеПроблемы = НовыйДанныеПроблемыКОбработке();
	ДанныеПроблемы.ПолученныйОбъект               = Форма.ПолученныйОбъект;
	ДанныеПроблемы.ПравилоКонвертации             = Форма.ПравилоКонвертации;
	ДанныеПроблемы.ОбъектФормата                  = Форма.ОбъектФормата;
	ДанныеПроблемы.УзелПланаОбмена                = Форма.УзелИнформационнойБазы;
	ДанныеПроблемы.ДатаУстановкиПричиныДобавления = Форма.ДатаВозникновения;
	ДанныеПроблемы.ДатаОбрабатываемойВерсии       = Форма.ДатаОбрабатываемойВерсии;
	ДанныеПроблемы.ПричинаДобавления              = Форма.ПричинаДобавления;
	ДанныеПроблемы.СоответствиеВИБ                = Форма.СоответствиеВИБ;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СоответствиеУстановленоВЭтойФорме")
		И Форма.СоответствиеУстановленоВЭтойФорме 
		И ЗначениеЗаполнено(Форма.СоответствиеВИБ) Тогда
		ДанныеПроблемы.УстановленноеСоответствие = Форма.СоответствиеВИБ;
	КонецЕсли;
	
	Возврат ДанныеПроблемы;
	
КонецФункции

Функция ДанныеЗакрытияФормыПроблемыПослеЗагрузки(Форма, НеобходимыеДействия, ТребуетсяОткрытиеОбъекта, РезультатЗагрузкиОбъекта) Экспорт
	
	ДанныеЗакрытия = НовыйРезультатОбработкиВФормеПроблемы();
	ДанныеЗакрытия.ПолученныйОбъект                      = Форма.ПолученныйОбъект;
	ДанныеЗакрытия.ПравилоКонвертации                    = Форма.ПравилоКонвертации;
	ДанныеЗакрытия.ОбъектФормата                         = Форма.ОбъектФормата;
	ДанныеЗакрытия.УстановленоСоответствие               = НеобходимыеДействия.ВыполненаУстановкаСоответствия;
	ДанныеЗакрытия.ПереоткрытьФормуПроблему              = НеобходимыеДействия.ТребуетсяПовторноеОткрытиеФормыПроблемы;
	ДанныеЗакрытия.ОткрытьОбъектИБПослеОбработки         = ТребуетсяОткрытиеОбъекта;
	ДанныеЗакрытия.ТребуетсяВыборНовойПроблемы           = НеобходимыеДействия.ТребуетсяВыборНовойПроблемы;
	ДанныеЗакрытия.ТребуетсяЗакрытиеИВыводПредупреждения = НеобходимыеДействия.ТребуетсяЗакрытиеИВыводПредупреждения;
	ДанныеЗакрытия.ОбъектИБ                              = Форма.СоответствиеВИБ;
	ДанныеЗакрытия.ИдентификаторФоновогоЗадания          = РезультатЗагрузкиОбъекта.ИдентификаторФоновогоЗадания;
	
	Если ДанныеЗакрытия.ТребуетсяЗакрытиеИВыводПредупреждения Тогда
		
		ДанныеЗакрытия.ТекстПредупреждения = "";
		ЭтоПерваяОшибка     = Истина;
		
		Для Каждого ТекстОшибки Из РезультатЗагрузкиОбъекта.Ошибки Цикл
			
			Если Не ЭтоПерваяОшибка Тогда
				ДанныеЗакрытия.ТекстПредупреждения = ДанныеЗакрытия.ТекстПредупреждения + Символы.ПС;
			КонецЕсли;
			
			ДанныеЗакрытия.ТекстПредупреждения = ДанныеЗакрытия.ТекстПредупреждения + ТекстОшибки;
			
			ЭтоПерваяОшибка = Ложь;
			
		КонецЦикла;

	ИначеЕсли НеобходимыеДействия.ТребуетсяВыборНовойПроблемы Тогда
		
		ДанныеЗакрытия.СтатусыЗагрузки = РезультатЗагрузкиОбъекта.СтатусыЗагрузки;
	
	ИначеЕсли НеобходимыеДействия.ТребуетсяПовторноеОткрытиеФормыПроблемы Тогда
		
		Для Каждого КлючИЗначение Из РезультатЗагрузкиОбъекта.РезультатОбработки Цикл
			
			ДанныеЗакрытия.ПричинаДобавления = КлючИЗначение.Ключ;
			
		КонецЦикла;
		
		Если ДанныеЗакрытия.ПричинаДобавления = ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи")
			Или ДанныеЗакрытия.ПричинаДобавления = ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроведения")
			Или ДанныеЗакрытия.ПричинаДобавления = ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи")
			И РезультатЗагрузкиОбъекта.СтатусыЗагрузки.Количество() > 0 Тогда
			
			ДанныеЗакрытия.СтатусОбновленияОбъектаВИБ    = РезультатЗагрузкиОбъекта.СтатусыЗагрузки[0].СтатусЗагрузки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеЗакрытия;
	
КонецФункции


#КонецОбласти

#Область ОбработкаВыполненияГрупповыхКомандФормСписков

Процедура ОбработатьРезультатыВыполненияГрупповойКомандыВСпискеПроблем(АдресРезультата, ЭтоПроверкаЗагрузки = Ложь) Экспорт

	Если Не ЭтоАдресВременногоХранилища(АдресРезультата) Тогда 
		Возврат;
	КонецЕсли;
	
	РезультатОбработки = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если РезультатОбработки = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипЗнч(РезультатОбработки) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьРезультатыВыполненияКомандыОбработки(РезультатОбработки, ЭтоПроверкаЗагрузки);
	
КонецПроцедуры

Процедура ОповеститьПользователяОРезультатахВыполненияГрупповойКоманды(РезультатОбработки, ЭтоПроверкаЗагрузки) Экспорт
	
	Загружено    = 0;
	НовыеПричины = 0;
	
	Если Не РезультатОбработки.ОповещатьОбИзменении Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ЭтоПроверкаЗагрузки Тогда
		ИмяАнализируемогоСвойства = "ИзмененныеЗаписи";
		ТекстЗаголовка = НСтр("ru = 'Проверка возможности загрузки других объектов'");
	Иначе
		ИмяАнализируемогоСвойства = "НовыеПричины";
		ТекстЗаголовка = НСтр("ru = 'Загрузка объектов'");
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из РезультатОбработки[ИмяАнализируемогоСвойства] Цикл
		
		Если КлючИЗначение.Ключ = "Загружен" Тогда
			
			Загружено = Загружено + КлючИЗначение.Значение;
			
		ИначеЕсли ТипЗнч(КлючИЗначение.Ключ) = Тип("ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке") Тогда
			
			НовыеПричины = НовыеПричины + КлючИЗначение.Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстПояснения = "";
	
	Если Загружено = 0 Тогда
		Если Не ЭтоПроверкаЗагрузки Тогда
			ТекстПояснения = НСтр("ru = 'Ни один объект не загружен.'"); 
		КонецЕсли;
	Иначе
		ТекстПояснения = СтрШаблон(НСтр("ru = 'Загружено объектов - %1.'"), Загружено);
	КонецЕсли;
	
	Если НовыеПричины > 0 Тогда
		
		ТекстНовыеПричины = СтрШаблон(НСтр("ru = 'Объекты, у которых изменилась проблема - %1'"), НовыеПричины);
		ТекстПояснения = ТекстПояснения + ?(ПустаяСтрока(ТекстПояснения), "", Символы.ПС) + ТекстНовыеПричины;
		
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(ТекстЗаголовка, , ТекстПояснения);
	
КонецПроцедуры

Функция КлючиЗаписейВыделенныхСтрокСписка(Форма, ИмяСписка) Экспорт
	
	КлючиЗаписей = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из Форма.Элементы[ИмяСписка].ВыделенныеСтроки Цикл
		
		Если ТипЗнч(ВыделеннаяСтрока) = Тип("РегистрСведенийКлючЗаписи.ОбъектыКЗагрузке") Тогда
			КлючиЗаписей.Добавить(ВыделеннаяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КлючиЗаписей;
	
КонецФункции

Процедура ОповеститьОРезультатахУстановкиПричиныЗагрузкаОтклонена(РезультатИзмененияПричины) Экспорт 
	
	Если РезультатИзмененияПричины.КоличествоОбработано > 0 Тогда
	
		ТекстОповещения = СтрШаблон(НСтр("ru = 'Отклонена загрузка объектов - %1 из %2'"),
		                            РезультатИзмененияПричины.КоличествоОбработано,
		                           РезультатИзмененияПричины.КоличествоКОбработке);
		
		Оповестить("Запись_ПричинаДобавленияОбъектыКЗагрузке");
		
	Иначе
		
		ТекстОповещения = НСтр("ru = 'Ни для одного объекта не удалось выполнить операцию отклонения загрузки'");
		
	КонецЕсли;
		
	ПоказатьОповещениеПользователя(НСтр("ru = 'Отклонение загрузки объектов'") ,, ТекстОповещения, БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

Процедура ОповеститьОРезультатахУстановкиПричиныГотовКЗагрузке(РезультатИзмененияПричины) Экспорт 
	
	Если РезультатИзмененияПричины.КоличествоОбработано > 0 Тогда
	
		ТекстОповещения = СтрШаблон(НСтр("ru = 'Передано на загрузку объектов - %1 из %2'"),
		                            РезультатИзмененияПричины.КоличествоОбработано,
		                           РезультатИзмененияПричины.КоличествоКОбработке);
		
		Оповестить("Запись_ПричинаДобавленияОбъектыКЗагрузке");
		
	Иначе
		
		ТекстОповещения = НСтр("ru = 'Ни для одного объекта не удалось выполнить операцию передачи на загрузку'");
		
	КонецЕсли;
		
	ПоказатьОповещениеПользователя(НСтр("ru = 'Передача объектов на загрузку'") ,, ТекстОповещения, БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

Процедура ОткрытьФормуВыбораПроблемыПоРезультатамЗагрузки(Форма, Результат) Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДанныеЗагрузки", Результат.СтатусыЗагрузки);
	ПараметрыОткрытия.Вставить("УзелПланаОбмена",Форма.УзелИнформационнойБазы);
	
	ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ВыборПроблемыПослеЗагрузки", ПараметрыОткрытия, Форма,
	             ,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ПриОткрытииФормыПроблемы(Форма) Экспорт
	
	Если Форма.ПоказыватьПредупреждениеПриПовторномОткрытииФормыПроблемы Тогда
		
		ОбработкаОповещенияПриЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормыПредупрежденияПовторноеОткрытиеПроблемы", ЭтотОбъект);
		ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ПредупреждениеПослеПовторногоОткрытияФормыПроблемы",,
		             Форма,,,,ОбработкаОповещенияПриЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗакрытияФормыПредупрежденияПовторноеОткрытиеПроблемы(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Истина Тогда
		
		ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("Обработка.РаботаСРезультатамиОбмена", 
		                                                             "НеобходимостьПредупрежденияПриПовторномОткрытииФормыПроблемы",
		                                                             Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОткрытиеФормПроблем

Процедура ОткрытьФормуПроблемыУстановитьСоответствие(ПараметрыОткрытия, ВладелецФормы, ОповещениеПослеЗакрытия)

	ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ФормаПроблемыКУстановкеСоответствия", 
	             ПараметрыОткрытия, ВладелецФормы,,,,ОповещениеПослеЗакрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

Процедура ОткрытьФормуПроблемыОшибкаКонвертации(ПараметрыОткрытия, ВладелецФормы, ОповещениеПослеЗакрытия)

	ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ФормаПроблемыОшибкаКонвертации", 
	             ПараметрыОткрытия, ВладелецФормы,,,,ОповещениеПослеЗакрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

Процедура ОткрытьФормуПроблемыПодтвердитьЗагрузку(ПараметрыОткрытия, ВладелецФормы, ОповещениеПослеЗакрытия)

	ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ФормаПроблемыПодтверждениеЗагрузки", 
	             ПараметрыОткрытия, ВладелецФормы,,,,ОповещениеПослеЗакрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

Процедура ОткрытьФормуПроблемыОжидаетЗагрузкуДругих(ПараметрыОткрытия, ВладелецФормы, ОповещениеПослеЗакрытия)
	
	ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ФормаПроблемыОжидаетЗагрузкуДругих", 
	             ПараметрыОткрытия, ВладелецФормы,,,,ОповещениеПослеЗакрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ОткрытьФормуПроблемыОжидаетсяПолучениеЭтогоОбъекта(ПараметрыОткрытия, ВладелецФормы, ОповещениеПослеЗакрытия)
	
	ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ФормаПроблемыОжидаетсяПолучениеЭтогоОбъекта", 
	             ПараметрыОткрытия, ВладелецФормы,,,,ОповещениеПослеЗакрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ОткрытьФормуПроблемыНеЗагруженПроблемаПриЗаписи(ПараметрыОткрытия, ВладелецФормы, ОповещениеПослеЗакрытия)
	
	ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ФормаПроблемыНезагруженныеСПроблемамиПриЗаписи", 
	             ПараметрыОткрытия, ВладелецФормы,,,,ОповещениеПослеЗакрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ОткрытьФормуПроблемыЗагруженПроблемаПриЗаписи(ПараметрыОткрытия, ВладелецФормы, ОповещениеПослеЗакрытия)
	
	ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ФормаПроблемыЗагруженныеСПроблемамиПриЗаписи", 
	             ПараметрыОткрытия, ВладелецФормы,,,,ОповещениеПослеЗакрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура УстановитьЗначениеПереключателяДляДочернихСтрок(РодительскаяСтрока, ИмяРеквизитаВыбран)

	Для Каждого ПодчиненнаяСтрока Из РодительскаяСтрока.ПолучитьЭлементы() Цикл
		
		ПодчиненнаяСтрока[ИмяРеквизитаВыбран] = РодительскаяСтрока[ИмяРеквизитаВыбран];
		
	КонецЦикла;

КонецПроцедуры

Функция НовыйПараметрыОткрытияФормыКомментария()
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючЗаписиОбъектКЗагрузке", РаботаСРезультатамиОбменаКлиентСервер.НовыйКлючЗаписиОбъектыКЗагрузке()); 
	ПараметрыОткрытия.Вставить("Комментарий",               "");
	
	Возврат ПараметрыОткрытия;
	
КонецФункции

Процедура ОповеститьОЗагрузкеОбъекта(ОбъектИБ)
	
	ТекстОповещения = СтрШаблон(НСтр("ru = 'Успешно загружен объект - %1'"), ОбъектИБ);
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Загрузка объекта'"),
	                               ПолучитьНавигационнуюСсылку(ОбъектИБ),
	                               ТекстОповещения, БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

Процедура ОбработатьРезультатыВыполненияКомандыОбработки(РезультатОбработки, ЭтоПроверкаЗагрузки)

	Если Не РезультатОбработки.Успешно Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатОбработки.ТекстОшибки);
		
	Иначе
		
		ОповеститьПользователяОРезультатахВыполненияГрупповойКоманды(РезультатОбработки, ЭтоПроверкаЗагрузки);
		
		Если РезультатОбработки.ОповещатьОбИзменении Тогда
			Оповестить("Запись_ПричинаДобавленияОбъектыКЗагрузке");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти