///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область КонвертацияОбъектов

// По имени объекта формата EnterpriseData и версии формата формируем массив потенциально доступных типов данных
// при загрузке. Для корректной работы обязательно должен быть заполнен параметр УзелКорреспондента, остальные 
// параметры, если не указаны, могут быть вычислены по свойствам узла.
//
// Параметры:
//   КомпонентыОбмена - Структура - структура компонентов (параметров) обмена:
//    * УзелКорреспондента - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//    * ВерсияФорматаОбмена - Строка - версия формата обмена EnterpriseData, например, "1.17".
//                                     Если не указано вычисляется по настройкам переданного узла плана обмена.
//    * ПравилаКонвертацииОбъектов - см. ОбменДаннымиXDTOСервер.КоллекцияПравилКонвертации.
//   ИмяОбъектаФормата - Строка - имя объекта формата, например, Документ.РеализацияТоваровУслуг
//
// Возвращаемое значение:
//   Массив из Тип
//
Функция ВозможныеТипыМетаданныхПриКонвертацииОбъектаXDTO(КомпонентыОбмена, ИмяОбъектаФормата) Экспорт
	
	ТипыМетаданных = Новый Массив;
	
	Если ПустаяСтрока(ИмяОбъектаФормата) Тогда
		
		Возврат ТипыМетаданных;
		
	КонецЕсли;
	
	УзелКорреспондента = Неопределено;
	Если НЕ КомпонентыОбмена.Свойство("УзелКорреспондента", УзелКорреспондента)
		ИЛИ НЕ ЗначениеЗаполнено(УзелКорреспондента)
		Тогда
		
		Возврат ТипыМетаданных;
		
	КонецЕсли;
	
	ЭтоПланОбменаXDTO = КонвертацияОбъектноРецепцияСервер.ЭтоПланОбменаXDTO(УзелКорреспондента);
	Если НЕ ЭтоПланОбменаXDTO Тогда
		
		Возврат ТипыМетаданных;
		
	КонецЕсли;
	
	ВерсияФорматаОбмена = "";
	Если НЕ КомпонентыОбмена.Свойство("ВерсияФорматаОбмена", ВерсияФорматаОбмена) Тогда
		
		КомпонентыОбмена.Вставить("ВерсияФорматаОбмена", ВерсияФорматаОбмена);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВерсияФорматаОбмена) Тогда
		
		//@skip-check bsl-legacy-check-string-literal
		ВерсияФорматаОбмена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УзелКорреспондента, "ВерсияФорматаОбмена");
		Если НЕ ЗначениеЗаполнено(ВерсияФорматаОбмена) Тогда
			
			Возврат ТипыМетаданных;
			
		КонецЕсли;
		
		КомпонентыОбмена.ВерсияФорматаОбмена = ВерсияФорматаОбмена;
		
	КонецЕсли;
	
	ИмяПланаОбмена = КонвертацияОбъектноРецепцияСервер.ПолучитьИмяПланаОбмена(УзелКорреспондента);
	ФорматОбмена = КонвертацияОбъектноРецепцияСервер.ФорматОбмена(ИмяПланаОбмена, ВерсияФорматаОбмена);
	МенеджерОбмена = КонвертацияОбъектноРецепцияСервер.МенеджерОбменаВерсииФормата(УзелКорреспондента, ВерсияФорматаОбмена);
	РасширенияФормата = КонвертацияОбъектноРецепцияСервер.ДоступныеРасширенияФормата(ВерсияФорматаОбмена);
	
	КомпонентыОбмена.Вставить("НаправлениеОбмена", "Получение");
	КомпонентыОбмена.Вставить("XMLСхема", ФорматОбмена);
	КомпонентыОбмена.Вставить("МенеджерОбмена", МенеджерОбмена);
	КомпонентыОбмена.Вставить("РасширенияФормата", РасширенияФормата);
	
	ПравилаКонвертацииОбъектов = Неопределено;
	Если НЕ КомпонентыОбмена.Свойство("ПравилаКонвертацииОбъектов", ПравилаКонвертацииОбъектов)
		ИЛИ ТипЗнч(ПравилаКонвертацииОбъектов) <> Тип("ТаблицаЗначений")
		Тогда
		
		КонвертацияОбъектноРецепцияСервер.ИнициализироватьТаблицыПравилОбмена(КомпонентыОбмена, Истина);
		
	КонецЕсли;
	
	Если ТипЗнч(КомпонентыОбмена.ПравилаКонвертацииОбъектов) <> Тип("ТаблицаЗначений")
		ИЛИ КомпонентыОбмена.ПравилаКонвертацииОбъектов.Количество() < 1
		Тогда
		
		Возврат ТипыМетаданных;
		
	КонецЕсли;
	
	ОтборСтрок = Новый Структура("ОбъектФормата", ИмяОбъектаФормата);
	СтрокиУказанногоТипа = КомпонентыОбмена.ПравилаКонвертацииОбъектов.НайтиСтроки(ОтборСтрок);
	Для каждого НайденнаяСтрока Из СтрокиУказанногоТипа Цикл
		
		Если ТипыМетаданных.Найти(НайденнаяСтрока.ТипДанных) = Неопределено Тогда 
			
			ТипыМетаданных.Добавить(НайденнаяСтрока.ТипДанных);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТипыМетаданных;
	
КонецФункции

// Конвертирует полученные данные и возвращает описание результата конвертации
//
// Параметры:
//   КомпонентыОбмена - Структура - структура компонентов (параметров) обмена:
//    * УзелКорреспондента - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//    * ВерсияФорматаОбмена - Строка - версия формата обмена EnterpriseData, например, "1.17".
//                                     Если не указано вычисляется по настройкам переданного узла плана обмена.
//    * ПравилаКонвертацииОбъектов - см. ОбменДаннымиXDTOСервер.КоллекцияПравилКонвертации
//   ВыборкаДанныхДляОбработки - ВыборкаИзРезультатаЗапроса - выборка из регистра сведений ПрочитанныеДанныеСообщенийОбмена.
//
// Возвращаемое значение:
//   ТаблицаЗначений - результат конвертации полученных данных:
//     * ПолученныйОбъект          - Строка - идентификатор прочитанных данных.
//     * ПравилоКонвертации        - Строка - ПКО.
//     * ОбъектФормата             - Строка - имя объекта формата.
//     * ИсторияКонвертацииОбъекта - см. КонвертацияОбъектноРезультатыСлужебный.КонструкторИсторииПримененияПОД.
//     * ИсторияПримененияПКО      - см. КонвертацияОбъектноРезультатыСлужебный.КонструкторИсторииПримененияПКО.
//
Функция КонвертироватьЗачитанныеДанныеСОтчетом(КомпонентыОбмена, ВыборкаДанныхДляОбработки) Экспорт
	
	РезультатИнтерактивнойКонвертации = Новый ТаблицаЗначений;
	РезультатИнтерактивнойКонвертации.Колонки.Добавить("ПолученныйОбъект");
	РезультатИнтерактивнойКонвертации.Колонки.Добавить("ПравилоКонвертации");
	РезультатИнтерактивнойКонвертации.Колонки.Добавить("ОбъектФормата");
	РезультатИнтерактивнойКонвертации.Колонки.Добавить("ИсторияКонвертацииОбъекта");
	РезультатИнтерактивнойКонвертации.Колонки.Добавить("ИсторияПримененияПКО");
	
	ПеремененныеКонвертации = Новый Структура;
	ПеремененныеКонвертации.Вставить("МассивОбъектовКУдалению", Новый Массив);
	ПеремененныеКонвертации.Вставить("МассивЗагруженныхОбъектов", Новый Массив);
	
	ПередКонвертациейОбъектовXDTO(КомпонентыОбмена);
	Если КомпонентыОбмена.ИсторияКонвертацииДанных.ЕстьОшибкаСобытияПередКонвертацией = Истина Тогда
		
		Возврат РезультатИнтерактивнойКонвертации;
		
	КонецЕсли;
	
	ВыборкаДанныхДляОбработки.Сбросить();
	Пока ВыборкаДанныхДляОбработки.Следующий() Цикл
		
		ИнициироватьИсториюКонвертацииОбъектаXDTO(КомпонентыОбмена, ВыборкаДанныхДляОбработки);
		
		ПриОпределенииПравилаОбработкиДанных(КомпонентыОбмена, ВыборкаДанныхДляОбработки);
		Если НЕ КонвертацияОбъектноРезультатыСлужебный.ЕстьОшибкиПОД(КомпонентыОбмена.ИсторияКонвертацииОбъекта) Тогда
			
			// Если нет ошибок подбора ПОД и типа объектаXDTO, то выполняем обработку
			ОбъектXDTO = СформироватьПоТипуОбъектXDTO(КомпонентыОбмена, ВыборкаДанныхДляОбработки);
			Если КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЕстьОшибкаДесериализацииПоТипуXDTO <> ИСТИНА Тогда
				
				КонвертироватьДанныеОбъектаXDTO(КомпонентыОбмена, ОбъектXDTO, ПеремененныеКонвертации);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Результат по объектуXDTO фиксируем в любом случае (даже если были ошибки)
		ПриОкончанииОбработкиОбъектаXDTO(КомпонентыОбмена, ВыборкаДанныхДляОбработки);
		
		РезультатКонвертацииДанныхВТаблицу(КомпонентыОбмена, ВыборкаДанныхДляОбработки, РезультатИнтерактивнойКонвертации);
		
	КонецЦикла;
	
	ПриОкончанииКонвертацииОбъектовXDTO(КомпонентыОбмена);
	
	Возврат РезультатИнтерактивнойКонвертации;
	
КонецФункции

// Конвертирует структуру прочитанных данных (ДанныеXDTO), которые были получены из объекта XDTO.
//
// Параметры:
//   КомпонентыОбмена - Структура - ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//   ПравилоКонвертации - СтрокаТаблицыЗначений - 
//   ДанныеXDTO - Структура - 
//   Отказ - Булево - 
//
// Возвращаемое значение:
//   Неопределено, ЛюбаяСсылка - если конвертация завершена безуспешно, то Неопределено
//
Функция КонвертироватьСтруктуруОбъектаXDTOВОбъектИБ(КомпонентыОбмена, ПравилоКонвертации, ДанныеXDTO, Отказ = Ложь) Экспорт
	
	// Перед началом конвертации по данным ДанныеXDTO вычислим:
	// - Внешнюю ссылку
	// - Навигационную ссылку (внешнюю)
	// - Ссылку на объект в ИБ (если есть)
	НачальныеДанныеКонвертацииОбъекта(КомпонентыОбмена, ПравилоКонвертации, ДанныеXDTO);
	
	// Создаем новый объект-контейнер для хранения промежуточных результатов конвертации.
	ПолученныеДанные = КонвертацияОбъектноРецепцияСервер.ИнициализироватьПолученныеДанные(ПравилоКонвертации);
	
	// Конвертация свойств:
	// 1. Маппинг
	// 2. Событие "ПриКонвертацииДанныхXDTO"
	// 3. Дополнительные свойства
	КонвертацияСвойствСтруктурыОбъектаXDTO(КомпонентыОбмена, ДанныеXDTO, ПолученныеДанные);
	Если КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьОшибкаКонвертацииСтруктурыXDTO = Истина Тогда
		
		Возврат ПрерватьВыполнениеКонвертацииПоОшибке(КомпонентыОбмена, ПолученныеДанные);
		
	КонецЕсли;
	
	// Если мы не смогли идентифицировать все пришедшие ссылки,
	// то конвертацию можно далее не продолжать...
	// Но если ИгнорироватьНедостающиеСсылки = Истина, то считаем,
	// что пользователь подтверждает загрузку "как есть"
	// и отсутствующие ссылки не являются препятствием...
	ОтразитьБлокирующиеСсылкиКонвертацииОбъекта(КомпонентыОбмена, ПолученныеДанные);
	Если КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьПредупреждениеБлокировкиОбъектаДругимиОбъектами = Истина Тогда
		
		Возврат ПрерватьВыполнениеКонвертацииПоОшибке(КомпонентыОбмена, ПолученныеДанные);
		
	КонецЕсли;
	
	// Поиск по значениям реквизитов (ключевым)
	ПодборОбъектаПоКлючевымПолям(КомпонентыОбмена, ПравилоКонвертации, ПолученныеДанные);
	
	// Создаем объект ИБ для существующей ссылки
	ДанныеИБ = Неопределено;
	ПриПолученииОбъектаИБ(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБ);
	
	ЗаблокироватьОбъектИБ(КомпонентыОбмена, ДанныеИБ);
	
	// Обработчик события "ПередЗаписьюПолученныхДанных" (описывает разработчик в КД)
	ПередЗаписьюПолученныхДанных(КомпонентыОбмена, ПравилоКонвертации, ПолученныеДанные, ДанныеИБ);
	Если КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьОшибкаСобытияПередЗаписьюПолученныхДанных = Истина
		ИЛИ (ПолученныеДанные = Неопределено
			И ДанныеИБ = Неопределено) Тогда
		
		ПолученныеДанные = Неопределено;
		Возврат Неопределено;
		
	КонецЕсли;
	
	// Копируем данные
	ЗаполнитьДанныеИБПоПолученнымДанным(КомпонентыОбмена, ПравилоКонвертации, ПолученныеДанные, ДанныеИБ);
	
	// Вызов API других библиотек и подписок, дозаполнение объекта
	ПредварительнаяОбработкаОбъектаПередЗаписью(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБ);
	
	// Запись результата конвертации (полученного/обновленного объекта)
	ЗаписьДанныхВыполнена = Ложь;
	ЗаписатьДанныеИБ(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБ, ЗаписьДанныхВыполнена);
	
	// Новое событие КД: ПриОкончанииКонвертацииОбъекта
	ПослеКонвертацииПрочитанногоОбъектаXDTO(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБ, ЗаписьДанныхВыполнена);
	
	Если ПравилоКонвертации.ЭтоСсылочныйТип Тогда
		
		Возврат ДанныеИБ.Ссылка;
		
	КонецЕсли;
	
	Возврат ДанныеИБ; // Например, при конвертации регистра сведений
	
КонецФункции

// Конвертирует полученные данные и возвращает описание результата конвертации
//
// Параметры:
//   КомпонентыОбмена - Структура - структура компонентов (параметров) обмена:
//    * УзелКорреспондента - ПланОбменаСсылка - узел плана обмена EnterpriseData.
//    * ВерсияФорматаОбмена - Строка - версия формата обмена EnterpriseData, например, "1.17".
//                                     Если не указано вычисляется по настройкам переданного узла плана обмена.
//    * ПравилаКонвертацииОбъектов - см. ОбменДаннымиXDTOСервер.КоллекцияПравилКонвертации
//
Процедура КонвертироватьЗачитанныеДанные(КомпонентыОбмена) Экспорт
	
	ПеремененныеКонвертации = Новый Структура;
	ПеремененныеКонвертации.Вставить("МассивОбъектовКУдалению", Новый Массив);
	ПеремененныеКонвертации.Вставить("МассивЗагруженныхОбъектов", Новый Массив);
	
	// В каждой порции до 100 объектов. Рассчитываем, что каждый млн объектов будем прерываться
	ЗащитаОтБесконечнойРекурсии = 10000;
	
	ВыборкаДанныхДляОбработки = ВыбранныеДанныеДляОбработки(КомпонентыОбмена);
	Пока ВыборкаДанныхДляОбработки.Количество() > 0
		И ЗащитаОтБесконечнойРекурсии > 0 Цикл
		
		// Функция вернет отчет с результатами конвертации, но в этом сценарии он не нужен
		КонвертироватьЗачитанныеДанныеСОтчетом(КомпонентыОбмена, ВыборкаДанныхДляОбработки);
		Если КомпонентыОбмена.ИсторияКонвертацииДанных.ЕстьОшибкаСобытияПередКонвертацией = Истина Тогда
			
			Прервать; // Если есть глобальная ошибка, то нет смысла продолжать
			
		КонецЕсли;
		
		ВыборкаДанныхДляОбработки = ВыбранныеДанныеДляОбработки(КомпонентыОбмена);
		ЗащитаОтБесконечнойРекурсии = ЗащитаОтБесконечнойРекурсии - 1;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область КонвертацияЗапросовНаВыгрузку

Процедура ЗапросыНаВыгрузкуВДанныеИБ(КомпонентыОбмена, ОбъектXDTO) Экспорт
	
	КонвертироватьЗапросНаВыгрузку(КомпонентыОбмена, ОбъектXDTO)
	
КонецПроцедуры

Процедура ЗапросыНаВыгрузкуДанныхВXML(КомпонентыОбмена) Экспорт
	
	ПространствоИмен = КомпонентыОбмена.XMLСхема;
	
	ЗапросНаВыгрузкуОбъектXDTO = ОбъектФорматаЗапросНаВыгрузку(ПространствоИмен);
	Если ЗапросНаВыгрузкуОбъектXDTO = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбъектнаяКонвертацияXDTO = КонвертацияОбъектноРецепцияСервер.СпособКонвертацииОбъектовXDTO(КомпонентыОбмена.УзелКорреспондента);
	Если ОбъектнаяКонвертацияXDTO <> Истина Тогда
		
		Возврат;
		
	КонецЕсли;
	
	НедостающиеСсылки = РегистрыСведений.ОбъектыКЗагрузке.ОжидаетсяПолучениеДанных(КомпонентыОбмена.УзелКорреспондента);
	Если НедостающиеСсылки.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для каждого ОписаниеОтсутствующегоОбъекта Из НедостающиеСсылки Цикл
		
		ВнестиЗаписьОтсутствующейСсылки(КомпонентыОбмена, ПространствоИмен, ЗапросНаВыгрузкуОбъектXDTO, ОписаниеОтсутствующегоОбъекта);
		
	КонецЦикла;
	
	ФабрикаXDTO.ЗаписатьXML(КомпонентыОбмена.ФайлОбмена, ЗапросНаВыгрузкуОбъектXDTO);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КонвертироватьЗачитанныеДанные

#Область ЗапросыНаВыгрузкуДанных

Функция ОбъектФорматаЗапросНаВыгрузку(XMLСхема)
	
	Если ПустаяСтрока(XMLСхема) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Если ФабрикаXDTO.Пакеты.Получить(XMLСхема) = Неопределено Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	КлассФорматаЗапросНаВыгрузку = КонвертацияОбъектноРецепцияСервер.КлассФорматаЗапросНаВыгрузку();
	ЗапросНаВыгрузкуТипXDTO = ФабрикаXDTO.Тип(XMLСхема, КлассФорматаЗапросНаВыгрузку);
	Если ЗапросНаВыгрузкуТипXDTO = Неопределено Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат ФабрикаXDTO.Создать(ЗапросНаВыгрузкуТипXDTO);
	
КонецФункции

Функция ПравилаКонвертацииЗапросаНаВыгрузку(Знач КомпонентыОбмена, ПространствоИменОбъектовФормата)
	
	КомпонентыОбменаОтправка = ОбщегоНазначения.СкопироватьРекурсивно(КомпонентыОбмена, Ложь);
	КомпонентыОбменаОтправка.НаправлениеОбмена = "Отправка";
	Если СтрНайти(ПространствоИменОбъектовФормата, "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/") <> 0 Тогда
		
		ПравилаКонвертацииОтправка = ПравилКонвертацииЗапросаНаВыгрузкуБазовые(КомпонентыОбменаОтправка, ПространствоИменОбъектовФормата);
		
	Иначе
		
		ПравилаКонвертацииОтправка = ПравилКонвертацииЗапросаНаВыгрузкуРасширенные(КомпонентыОбменаОтправка, ПространствоИменОбъектовФормата);
		
	КонецЕсли;
	
	Возврат ПравилаКонвертацииОтправка;
	
КонецФункции

Функция ПравилКонвертацииЗапросаНаВыгрузкуБазовые(КомпонентыОбменаОтправка, ПространствоИменОбъектовФормата)
	
	ВерсияФорматаОбмена = СтрЗаменить(ПространствоИменОбъектовФормата, "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/", "");
	Если ПустаяСтрока(ВерсияФорматаОбмена) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	КомпонентыОбменаОтправка.XMLСхема = ПространствоИменОбъектовФормата;
	КомпонентыОбменаОтправка.БазовыеСхемыФормата.Вставить(ПространствоИменОбъектовФормата, Истина);
	КомпонентыОбменаОтправка.МенеджерОбмена =
		КонвертацияОбъектноРецепцияСервер.МенеджерОбменаВерсииФормата(КомпонентыОбменаОтправка.УзелКорреспондента, ВерсияФорматаОбмена);
	
	Возврат КонвертацияОбъектноРецепцияСервер.ТаблицаПравилКонвертации(КомпонентыОбменаОтправка, Истина);
	
КонецФункции

Функция ПравилКонвертацииЗапросаНаВыгрузкуРасширенные(КомпонентыОбменаОтправка, ПространствоИменОбъектовФормата)
	
	ПравилаКонвертацииОтправка = Неопределено;
	
	РасширенияФормата = Новый Соответствие;
	ОбменДаннымиПереопределяемый.ПриПолученииДоступныхРасширенийФормата(РасширенияФормата);
	
	Для каждого ОписаниеРасширенияФормата Из РасширенияФормата Цикл
		
		Если ОписаниеРасширенияФормата.Ключ <> ПространствоИменОбъектовФормата Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ВерсияФорматаОбмена = ОписаниеРасширенияФормата.Значение;
		БазоваяXMLСхема = "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/" + ВерсияФорматаОбмена;
		
		КомпонентыОбменаОтправка.XMLСхема = БазоваяXMLСхема;
		КомпонентыОбменаОтправка.БазовыеСхемыФормата.Вставить(БазоваяXMLСхема, Истина);
		КомпонентыОбменаОтправка.МенеджерОбмена =
			КонвертацияОбъектноРецепцияСервер.МенеджерОбменаВерсииФормата(КомпонентыОбменаОтправка.УзелКорреспондента, ВерсияФорматаОбмена);
		
		ВсеПравилаКонвертацииОтправка = КонвертацияОбъектноРецепцияСервер.ТаблицаПравилКонвертации(КомпонентыОбменаОтправка, Истина);
		
		ОтборСтрокПКО = Новый Структура;
		ОтборСтрокПКО.Вставить("ПространствоИмен", ПространствоИменОбъектовФормата);
		
		НайденныеСтроки = ВсеПравилаКонвертацииОтправка.НайтиСтроки(ОтборСтрокПКО);
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если ПравилаКонвертацииОтправка = Неопределено Тогда
			
			ПравилаКонвертацииОтправка = ВсеПравилаКонвертацииОтправка.Скопировать(НайденныеСтроки);
			
		Иначе
			
			Для каждого СтрокаПКО Из НайденныеСтроки Цикл
				
				ЗаполнитьЗначенияСвойств(ПравилаКонвертацииОтправка.Добавить(), СтрокаПКО);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПравилаКонвертацииОтправка;
	
КонецФункции

Функция ПрочитатьЗапросНаВыгрузку(КомпонентыОбмена, ОбъектXDTO)
	
	ОписаниеОтсутствующихСсылок = Новый ТаблицаЗначений;
	ОписаниеОтсутствующихСсылок.Колонки.Добавить("СсылкаЗапросаНаВыгрузку", Новый ОписаниеТипов("Строка"));
	ОписаниеОтсутствующихСсылок.Колонки.Добавить("СсылкаВнешняяНавигационная", Новый ОписаниеТипов("Строка"));
	ОписаниеОтсутствующихСсылок.Колонки.Добавить("ИмяОбъектаФорматаПолученного", Новый ОписаниеТипов("Строка"));
	ОписаниеОтсутствующихСсылок.Колонки.Добавить("ПространствоИменОбъектаФормата", Новый ОписаниеТипов("Строка"));
	ОписаниеОтсутствующихСсылок.Колонки.Добавить("СсылкаНайденаИЗарегистрированаКОтправке", Новый ОписаниеТипов("Булево"));
	
	Для каждого ОтсутствующаяСсылка Из ОбъектXDTO.Строка Цикл
		
		Если ПустаяСтрока(ОтсутствующаяСсылка.ИмяОбъектаФорматаПолученного)
			ИЛИ ПустаяСтрока(ОтсутствующаяСсылка.ПространствоИменОбъектаФормата)
			ИЛИ ПустаяСтрока(ОтсутствующаяСсылка.СсылкаЗапросаНаВыгрузку)
			ИЛИ НЕ СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ОтсутствующаяСсылка.СсылкаЗапросаНаВыгрузку)
			Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = ОписаниеОтсутствующихСсылок.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОтсутствующаяСсылка);
		НоваяСтрока.СсылкаНайденаИЗарегистрированаКОтправке = Ложь;
		
	КонецЦикла;
	
	Возврат ОписаниеОтсутствующихСсылок;
	
КонецФункции

Процедура ВнестиЗаписьОтсутствующейСсылки(КомпонентыОбмена, ПространствоИмен, ЗапросНаВыгрузкуОбъектXDTO, ОписаниеОтсутствующегоОбъекта)
	
	ИмяОбъектаФормата = ОписаниеОтсутствующегоОбъекта.ОбъектФормата;
	ПространствоИменОбъектаФормата = ОписаниеОтсутствующегоОбъекта.ПространствоИменОбъектаФормата;
	
	// Проверка, что обязательные поля заполнены
	Если ПустаяСтрока(ОписаниеОтсутствующегоОбъекта.ПолученныйОбъект)
		ИЛИ ПустаяСтрока(ИмяОбъектаФормата) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ЗапрашиваемыйТипXDTO = ФабрикаXDTO.Тип(ПространствоИменОбъектаФормата, ИмяОбъектаФормата);
	Если ЗапрашиваемыйТипXDTO = Неопределено Тогда
		
		// Предупредим, продолжим выполнение
		СтекВызова = "{см. КонвертацияОбъектноСлужебный.ВнестиЗаписьОтсутствующейСсылки()}";
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьПредупреждениеНеизвестныйОбъектФормата(
			КомпонентыОбмена, ПространствоИменОбъектаФормата, ИмяОбъектаФормата, СтекВызова);
		
	КонецЕсли;
	
	// Добавим вложенный элемент в список XDTO "ЗапросНаВыгрузку.Строка" и заполним его свойства
	ТипXDTO_ЗапросНаВыгрузкуСтрока = ЗапросНаВыгрузкуОбъектXDTO.Строка.ВладеющееСвойство.Тип; // {http://v8.1c.ru/edi/edi_stnd/EnterpriseData/*}ЗапросНаВыгрузку.Строка
	
	ОбъектXDTO_ЗапросНаВыгрузкуСтрока = ФабрикаXDTO.Создать(ТипXDTO_ЗапросНаВыгрузкуСтрока);
	ОбъектXDTO_ЗапросНаВыгрузкуСтрока.Установить("СсылкаЗапросаНаВыгрузку", ОписаниеОтсутствующегоОбъекта.ПолученныйОбъект);
	ОбъектXDTO_ЗапросНаВыгрузкуСтрока.Установить("ИмяОбъектаФорматаПолученного", ИмяОбъектаФормата);
	ОбъектXDTO_ЗапросНаВыгрузкуСтрока.Установить("ПространствоИменОбъектаФормата", ПространствоИменОбъектаФормата);
	
	Если НЕ ПустаяСтрока(ОписаниеОтсутствующегоОбъекта.ВнешняяСсылкаНаОбъект) Тогда
		
		ОбъектXDTO_ЗапросНаВыгрузкуСтрока.Установить("СсылкаВнешняяНавигационная", ОписаниеОтсутствующегоОбъекта.ВнешняяСсылкаНаОбъект);
		
	КонецЕсли;
	
	ЗапросНаВыгрузкуОбъектXDTO.Строка.Добавить(ОбъектXDTO_ЗапросНаВыгрузкуСтрока);
	
	РегистрыСведений.ОбъектыКЗагрузке.ОтметитьВыполнениеЗапросаНаВыгрузку(ОписаниеОтсутствующегоОбъекта, КомпонентыОбмена.УзелКорреспондента);
	
КонецПроцедуры

Процедура ЗарегистрироватьСсылкиЗапросаПоНавигации(КомпонентыОбмена, ОтсутствующиеСсылки)
	
	УзелКорреспондента = КомпонентыОбмена.УзелКорреспондента;
	Если НЕ ЗначениеЗаполнено(УзелКорреспондента) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбъектыПовторнойВыгрузки = Новый Массив;
	СоставПланаОбмена = УзелКорреспондента.Метаданные().Состав;
	
	Для каждого ОписаниеСсылкиЗапроса Из ОтсутствующиеСсылки Цикл
		
		НавигационнаяСсылка = СокрЛП(ОписаниеСсылкиЗапроса.СсылкаВнешняяНавигационная);
		
		ПозицияИБ = СтрНайти(НавигационнаяСсылка, "e1cib/data/");
		ПозицияСсылка = СтрНайти(НавигационнаяСсылка, "?ref=");
		
		Если ПозицияИБ = 0
			ИЛИ ПозицияСсылка = 0 Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ПолноеИмяМетаданного = Сред(НавигационнаяСсылка, ПозицияИБ + 11, ПозицияСсылка - ПозицияИБ - 11);
		Если Метаданные.НайтиПоПолномуИмени(ПолноеИмяМетаданного) = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		СистемноеПредставление = ЗначениеВСтрокуВнутр(ПредопределенноеЗначение(ПолноеИмяМетаданного + ".ПустаяСсылка"));
		
		ИдентификаторСтрокой = Сред(НавигационнаяСсылка, ПозицияСсылка + 5);
		ЗначениеСсылкиСтрокой = СтрЗаменить(СистемноеПредставление, "00000000000000000000000000000000", ИдентификаторСтрокой);
		ПодобраннаяОбъектнаяСсылка = ЗначениеИзСтрокиВнутр(ЗначениеСсылкиСтрокой);
		
		Если ПодобраннаяОбъектнаяСсылка.ПолучитьОбъект() <> Неопределено
			И ОбъектыПовторнойВыгрузки.Найти(ПодобраннаяОбъектнаяСсылка) = Неопределено 
			И СоставПланаОбмена.Найти(ПодобраннаяОбъектнаяСсылка.Метаданные()) <> Неопределено Тогда
			
			ОбъектыПовторнойВыгрузки.Добавить(ПодобраннаяОбъектнаяСсылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
	РегистрироватьПодобранныеСсылки(КомпонентыОбмена, ОбъектыПовторнойВыгрузки, ОписаниеСсылкиЗапроса);
	УдалитьСтрокиЗарегистрированныхСсылок(ОтсутствующиеСсылки);
	
КонецПроцедуры

Процедура ЗарегистрироватьСсылкиЗапросаПоПространствуИмен(КомпонентыОбмена, ОтсутствующиеСсылки, ПространствоИменОбъектовФормата)
	
	Если НЕ ЗначениеЗаполнено(КомпонентыОбмена.УзелКорреспондента) Тогда
		
		Возврат; // Если нет узла, то зарегистрировать не получиться
		
	КонецЕсли;
	
	Если ФабрикаXDTO.Пакеты.Получить(ПространствоИменОбъектовФормата) = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПравилаКонвертацииОтправка = ПравилаКонвертацииЗапросаНаВыгрузку(КомпонентыОбмена, ПространствоИменОбъектовФормата);
	Если ПравилаКонвертацииОтправка = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ПространствоИменОбъектаФормата", ПространствоИменОбъектовФормата);
	
	СсылкиЗапросаНаВыгрузку = ОтсутствующиеСсылки.НайтиСтроки(ПараметрыОтбора);
	Для каждого ОписаниеСсылкиЗапроса Из СсылкиЗапросаНаВыгрузку Цикл
		
		НайтиСсылкуНаОтправкуПоКоллекцииПравил(КомпонентыОбмена, ПравилаКонвертацииОтправка, ОписаниеСсылкиЗапроса);
		Если НЕ ОписаниеСсылкиЗапроса.СсылкаНайденаИЗарегистрированаКОтправке Тогда
			
			КонвертацияОбъектноРезультатыСлужебный.ФиксироватьПредупреждениеЗапросаНаВыгрузкуСсылкаНеНайдена(КомпонентыОбмена, ОписаниеСсылкиЗапроса);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НайтиСсылкуНаОтправкуПоКоллекцииПравил(КомпонентыОбмена, ПравилаКонвертацииОтправка, ОписаниеСсылкиЗапроса)
	
	ИдентификаторДляПоиска = Новый УникальныйИдентификатор(ОписаниеСсылкиЗапроса.СсылкаЗапросаНаВыгрузку);
	Если ИдентификаторДляПоиска = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбъектыПовторнойВыгрузки = Новый Массив;
	СоставПланаОбмена = КомпонентыОбмена.УзелКорреспондента.Метаданные().Состав;
	
	ОтборСтрокПКО = Новый Структура;
	ОтборСтрокПКО.Вставить("ОбъектФормата", ОписаниеСсылкиЗапроса.ИмяОбъектаФорматаПолученного);
	
	НайденныеПКО = ПравилаКонвертацииОтправка.НайтиСтроки(ОтборСтрокПКО);
	Для каждого ПравилоКонвертации Из НайденныеПКО Цикл
		
		Если ПравилоКонвертации.ЭтоСсылочныйТип <> Истина Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		МенеджерОбъектаМетаданных = ПравилоКонвертации.МенеджерОбъекта;
		
		// У нас может быть несколько ПКО, которые относятся к разным таблицам метаданных.
		// При этом допустимо, что в этих таблицах могут быть одинаковые идентификаторы.
		ПодобраннаяОбъектнаяСсылка = МенеджерОбъектаМетаданных.ПолучитьСсылку(ИдентификаторДляПоиска);
		Если НЕ ОбщегоНазначения.СсылкаСуществует(ПодобраннаяОбъектнаяСсылка) Тогда
			
			ПодобраннаяОбъектнаяСсылка = Неопределено;
			
		КонецЕсли;
		
		Если ПравилоКонвертации.ЕстьОбработчикПриПолученииЗапросаВыгрузкиОбъекта Тогда
			
			КонвертацияОбъектноСобытияКД.ПриПолученииЗапросаВыгрузкиОбъекта(КомпонентыОбмена, ПравилоКонвертации,
				ОписаниеСсылкиЗапроса, ПодобраннаяОбъектнаяСсылка);
			
		КонецЕсли;
		
		Если ПодобраннаяОбъектнаяСсылка <> Неопределено
			И ОбъектыПовторнойВыгрузки.Найти(ПодобраннаяОбъектнаяСсылка) = Неопределено
			И СоставПланаОбмена.Найти(ПодобраннаяОбъектнаяСсылка.Метаданные()) <> Неопределено Тогда
			
			ОбъектыПовторнойВыгрузки.Добавить(ПодобраннаяОбъектнаяСсылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
	РегистрироватьПодобранныеСсылки(КомпонентыОбмена, ОбъектыПовторнойВыгрузки, ОписаниеСсылкиЗапроса);
	
КонецПроцедуры

Процедура ПриОтправкеДанныхКорреспонденту(УзелКорреспондента, ОтправкаЭлемента, ПодобраннаяОбъектнаяСсылка)
	
	ЭтоНачальнаяВыгрузкаДанных = Ложь;
	ЭтоАнализДанных = Истина; // отключим работу с приоритетными данными РИБ
	
	КонвертацияОбъектноРецепцияСервер.ПриОтправкеДанныхКорреспонденту(УзелКорреспондента, ОтправкаЭлемента,
		ПодобраннаяОбъектнаяСсылка, ЭтоНачальнаяВыгрузкаДанных, ЭтоАнализДанных);
	
КонецПроцедуры

Процедура РегистрироватьПодобранныеСсылки(КомпонентыОбмена, ОбъектыПовторнойВыгрузки, ОписаниеСсылкиЗапроса)
	
	Если ОбъектыПовторнойВыгрузки.Количество() < 1 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	УзелКорреспондента = КомпонентыОбмена.УзелКорреспондента;
	
	Для каждого ПодобраннаяОбъектнаяСсылка Из ОбъектыПовторнойВыгрузки Цикл
		
		Если ОбщегоНазначения.ЭтоРегистр(ПодобраннаяОбъектнаяСсылка.Метаданные()) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если Не КонвертацияОбъектноРецепцияСервер.ЕстьВДанныхОбъектовДляРегистрацииВОбменах(УзелКорреспондента, ПодобраннаяОбъектнаяСсылка) Тогда
			
			КонвертацияОбъектноРецепцияСервер.ДобавитьОбъектВФильтрРазрешенныхОбъектов(УзелКорреспондента, ПодобраннаяОбъектнаяСсылка);
			
		КонецЕсли;
		
		ПодобранныйОбъект = ПодобраннаяОбъектнаяСсылка.ПолучитьОбъект();
		
		ОтправкаЭлемента = ОтправкаЭлементаДанных.Авто;
		ПриОтправкеДанныхКорреспонденту(УзелКорреспондента, ОтправкаЭлемента, ПодобранныйОбъект);
		
		Если ОтправкаЭлемента = ОтправкаЭлементаДанных.Авто Тогда
			
			ПланыОбмена.ЗарегистрироватьИзменения(УзелКорреспондента, ПодобраннаяОбъектнаяСсылка);
			ОписаниеСсылкиЗапроса.СсылкаНайденаИЗарегистрированаКОтправке = Истина;
			
		Иначе
			
			КонвертацияОбъектноРезультатыСлужебный.ФиксироватьПредупреждениеЗапросаНаВыгрузкуСсылкаНеПроходитФильтр(
				КомпонентыОбмена, ОписаниеСсылкиЗапроса, ПодобраннаяОбъектнаяСсылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьСтрокиЗарегистрированныхСсылок(ОтсутствующиеСсылки)
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("СсылкаНайденаИЗарегистрированаКОтправке", Ложь);
	
	ОтсутствующиеСсылки = ОтсутствующиеСсылки.Скопировать(ОтборСтрок);
	
КонецПроцедуры

#КонецОбласти

#Область УдалениеОбъекта

Процедура НачальныеДанныеУдаленияОбъекта(КомпонентыОбмена, ПравилоКонвертации, ВнешняяСсылкаСтрокой)
	
	ИсторияПримененияТекущегоПКО = КонвертацияОбъектноРезультатыСлужебный.КонструкторИсторииПримененияПКО();
	
	ИсторияПримененияТекущегоПКО.ВнешняяСсылкаСтрокой = ВнешняяСсылкаСтрокой;
	ИсторияПримененияТекущегоПКО.ДанныеИБСсылка = ОбъектнаяСсылкаПоВнешней(КомпонентыОбмена, ПравилоКонвертации, ВнешняяСсылкаСтрокой);
	ИсторияПримененияТекущегоПКО.НавигационнаяСсылка = "";
	ИсторияПримененияТекущегоПКО.ПравилоКонвертации = ПравилоКонвертации;
	
	КомпонентыОбмена.Вставить("ИсторияПримененияТекущегоПКО", ИсторияПримененияТекущегоПКО);
	
	Если НЕ КомпонентыОбмена.Свойство("ПараметрыИнтерактивнойКонвертации") Тогда
		
		ПараметрыИнтерактивнойКонвертации = РаботаСРезультатамиОбмена.НовыйПараметрыПередачиОбъектовНаЗагрузку();
		КомпонентыОбмена.Вставить("ПараметрыИнтерактивнойКонвертации", ПараметрыИнтерактивнойКонвертации);
		
	КонецЕсли;
	
	ДобавитьДействияПриПолученииДанных(КомпонентыОбмена, ПравилоКонвертации);
	
КонецПроцедуры

Процедура ПрименитьУдалениеОбъекта(КомпонентыОбмена, ДанныеИБ)
	
	Если КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьОшибкаОбработкиУдаленияОбъекта = Истина Тогда
		
		Возврат;
		
	КонецЕсли;
	
	УдалитьНепосредственно = Ложь;
	СтандартнаяОбработка = Истина;
	
	ПравилоКонвертации = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПравилоКонвертации;
	Если ПравилоКонвертации.ЕстьОбработчикПриУдаленииОбъектаИБ Тогда
		
		КонвертацияОбъектноСобытияКД.ПриУдаленииОбъектаИБ(КомпонентыОбмена, ДанныеИБ, УдалитьНепосредственно, СтандартнаяОбработка);
		
	КонецЕсли;
	
	Если СтандартнаяОбработка = Ложь Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПриУдаленииОбъектаИБ(КомпонентыОбмена, ДанныеИБ, УдалитьНепосредственно);
	
КонецПроцедуры

Процедура ПриУдаленииОбъектаИБ(КомпонентыОбмена, ДанныеИБ, УдалитьНепосредственно)
	
	УзелКорреспондента = Неопределено;
	Если КомпонентыОбмена.ЭтоОбменЧерезПланОбмена Тогда
		
		УзелКорреспондента = КомпонентыОбмена.УзелКорреспондента;
		
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		КонвертацияОбъектноРецепцияСервер.УстановитьОбменДаннымиЗагрузка(УзелКорреспондента, ДанныеИБ, Ложь);
		
		РегистрыСведений.РезультатыОбменаДанными.ЗарегистрироватьУстранениеПроблемы(ДанныеИБ, Перечисления.ТипыПроблемОбменаДанными.НепроведенныйДокумент);
		
		ПравилоКонвертации = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПравилоКонвертации;
		УдалитьИлиПометитьНаУдалениеОбъектИБ(ПравилоКонвертации, ДанныеИБ, УдалитьНепосредственно);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьОшибкуОбработкиУдаленияОбъекта(КомпонентыОбмена, ДанныеИБ, ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура СтандартныеПроверкиПередУдаленииОбъектаИБ(КомпонентыОбмена, ДанныеИБ)
	
	ПриПроверкеРазрешенийЗаписиОбъекта(КомпонентыОбмена, ДанныеИБ);
	Если КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьПредупреждениеИзмененияНеразделенныхДанных = Истина Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПравилоКонвертации.ЭтоСправочник = Истина
		ИЛИ КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПравилоКонвертации.ЭтоПланВидовХарактеристик = Истина
		ИЛИ КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПравилоКонвертации.ЭтоБизнесПроцесс = Истина
		Тогда
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеИБ, "Предопределенный")
			И ДанныеИБ.Предопределенный = Истина Тогда
			
			ШаблонТекста = НСтр("ru ='Запрещено удаление предопределенных объектов <%1>.'", ОбщегоНазначения.КодОсновногоЯзыка());
			ТекстОшибки = СтрШаблон(ШаблонТекста, ДанныеИБ);
			
			КонвертацияОбъектноРезультатыСлужебный.ФиксироватьОшибкуОбработкиУдаленияОбъекта(КомпонентыОбмена, ДанныеИБ, ТекстОшибки);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ КомпонентыОбмена.ЭтоОбменЧерезПланОбмена Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если КонвертацияОбъектноРецепцияСервер.ЗапретЗагрузкиДанных(КомпонентыОбмена.УзелКорреспондентаОбъект, ДанныеИБ) Тогда
		
		ШаблонТекста = НСтр("ru ='Удаление объекта <%1> ограничено датой запрета изменения данных.'", ОбщегоНазначения.КодОсновногоЯзыка());
		ТекстОшибки = СтрШаблон(ШаблонТекста, ДанныеИБ);
		
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьОшибкуОбработкиУдаленияОбъекта(КомпонентыОбмена, ДанныеИБ, ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалениеОбъектаПоПравилуКонвертации(КомпонентыОбмена, ПравилоКонвертации, ОписаниеУдаленияОбъекта)
	
	Если НЕ КонвертацияОбъектноРецепцияСервер.ОбъектФорматаПроходитПоФильтруXDTO(КомпонентыОбмена, ПравилоКонвертации.ОбъектФормата)
		ИЛИ НЕ ПравилоПредписываетСопоставлениеПоУникальномуИдентификатору(ПравилоКонвертации) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ВнешняяСсылкаСтрокой = ОписаниеУдаленияОбъекта.СсылкаНаОбъект.Значение;
	НачальныеДанныеУдаленияОбъекта(КомпонентыОбмена, ПравилоКонвертации, ВнешняяСсылкаСтрокой);
	
	ДанныеИБСсылка = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ДанныеИБСсылка;
	Если ДанныеИБСсылка = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// Добавим JSON слепок
	ПрерватьВыполнениеКонвертацииПоОшибке(КомпонентыОбмена, ДанныеИБСсылка);
	
	Если КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЗагрузкаДанныхТребуетПодтверждения = Истина Тогда
		
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьНеобходимостьПодтвержденияЗагрузкиДанных(КомпонентыОбмена, ДанныеИБСсылка, Истина);
		Возврат;
		
	КонецЕсли;
	
	ДанныеИБ = ДанныеИБСсылка.ПолучитьОбъект();
	Если ДанныеИБ = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтандартныеПроверкиПередУдаленииОбъектаИБ(КомпонентыОбмена, ДанныеИБ);
	
	ПрименитьУдалениеОбъекта(КомпонентыОбмена, ДанныеИБ);
	
КонецПроцедуры

Процедура УдалитьИлиПометитьНаУдалениеОбъектИБ(ПравилоКонвертации, ДанныеИБ, УдалитьНепосредственно)
	
	Если УдалитьНепосредственно Тогда
		
		ДанныеИБ.Удалить();
		
	ИначеЕсли ПравилоКонвертации.ЭтоСправочник
		ИЛИ ПравилоКонвертации.ЭтоПланВидовХарактеристик
		ИЛИ ПравилоКонвертации.ЭтоПланСчетов
		Тогда
		
		// Справочник приходит сюда не модифицированным;
		// Пометка удаления только для ссылки, а вложенную иерархию исключаем.
		ДанныеИБ.УстановитьПометкуУдаления(Истина, Ложь);
		
	Иначе
		
		// Тут документ, второй параметр отсутствует
		ДанныеИБ.УстановитьПометкуУдаления(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ВыбранныеДанныеДляОбработки(КомпонентыОбмена)
	
	ПараметрыОбработки = РегистрыСведений.ПрочитанныеДанныеСообщенийОбмена.НовыйПараметрыВыборкиДанных();
	ПараметрыОбработки.КлючОбрабатывающегоЗадания = КомпонентыОбмена.КлючОбрабатывающегоЗадания;
	ПараметрыОбработки.УзелПланаОбмена            = КомпонентыОбмена.УзелКорреспондента;
	
	Возврат РегистрыСведений.ПрочитанныеДанныеСообщенийОбмена.ВыбранныеДанныеДляОбработки(ПараметрыОбработки, КомпонентыОбмена);
	
КонецФункции

Функция КомпонентыОбмена(УзелОбмена, НаправлениеОбмена, РасширенноеПространствоИмен) Экспорт
	
	КомпонентыОбмена = КонвертацияОбъектноРецепцияСервер.ИнициализироватьКомпонентыОбмена(НаправлениеОбмена);
	
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		
		КомпонентыОбмена.УзелКорреспондента = УзелОбмена;
		
	Иначе
		
		КомпонентыОбмена.ЭтоОбменЧерезПланОбмена = Ложь;
		КомпонентыОбмена.ОбменЧерезОбработкуВыгрузкаЗагрузкаED = Истина;
		
	КонецЕсли;
	
	КомпонентыОбмена.ВедениеПротоколаДанных.ВыводВПротоколИнформационныхСообщений = Ложь;
	КомпонентыОбмена.СостояниеОбменаДанными.ДатаНачала = ТекущаяДатаСеанса();
	КомпонентыОбмена.ИспользоватьТранзакции = Ложь;
	
	Если КомпонентыОбмена.ЭтоОбменЧерезПланОбмена = Истина Тогда
		
		ИмяПланаОбмена = КонвертацияОбъектноРецепцияСервер.ПолучитьИмяПланаОбмена(УзелОбмена);
		КлючСобытия = КонвертацияОбъектноРезультатыСлужебный.СобытиеЖурналаРегистрацииИнтерактивногоЗапускаОбъектнойКонвертации();
		
		КомпонентыОбмена.КлючСообщенияЖурналаРегистрации = КлючСобытия;
		КомпонентыОбмена.ВерсияФорматаОбмена = КонвертацияОбъектноРецепцияСервер.ВерсияФорматаОбменаПриВыгрузке(КомпонентыОбмена.УзелКорреспондента);
		КомпонентыОбмена.XMLСхема = КонвертацияОбъектноРецепцияСервер.ФорматОбмена(ИмяПланаОбмена, КомпонентыОбмена.ВерсияФорматаОбмена);
		КомпонентыОбмена.МенеджерОбмена = КонвертацияОбъектноРецепцияСервер.МенеджерОбменаВерсииФормата(КомпонентыОбмена.УзелКорреспондента, КомпонентыОбмена.ВерсияФорматаОбмена);
		
		Если НаправлениеОбмена = "Получение" Тогда
			
			КомпонентыОбмена.ИспользоватьКешПубличныхИдентификаторов = Ложь; // в объектной модели кэш не нужен
			КомпонентыОбмена.ОбъектнаяКонвертацияXDTO = КонвертацияОбъектноРецепцияСервер.СпособКонвертацииОбъектовXDTO(КомпонентыОбмена.УзелКорреспондента);
			
			КонвертацияОбъектноРецепцияСервер.ВключитьПространствоИмен(КомпонентыОбмена, РасширенноеПространствоИмен);
			
		Иначе
			
			КомпонентыОбмена.СвойстваУзлаПланаОбмена = КонвертацияОбъектноРецепцияСервер.СвойстваУзлаПланаОбмена(КомпонентыОбмена.УзелКорреспондента);
			КомпонентыОбмена.ТаблицаПравилаРегистрацииОбъектов = КонвертацияОбъектноРецепцияСервер.ПравилаРегистрацииОбъектов(КомпонентыОбмена.УзелКорреспондента);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если КомпонентыОбмена.МенеджерОбмена = Неопределено Тогда
		
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не поддерживается версия формата обмена: <%1>.'"), КомпонентыОбмена.ВерсияФорматаОбмена);
		
	Иначе
		
		КонвертацияОбъектноРецепцияСервер.ИнициализироватьТаблицыПравилОбмена(КомпонентыОбмена);
		
	КонецЕсли;
	
	Если КомпонентыОбмена.ЭтоОбменЧерезПланОбмена = Истина Тогда
		
		КонвертацияОбъектноРецепцияСервер.ЗаполнитьСтруктуруНастроекXDTO(КомпонентыОбмена);
		КонвертацияОбъектноРецепцияСервер.ЗаполнитьПоддерживаемыеОбъектыXDTO(КомпонентыОбмена);
		
	КонецЕсли;
	
	КонвертацияОбъектноРецепцияСервер.ПослеИнициализацииКомпонентыОбмена(КомпонентыОбмена);
	
	//@skip-check empty-except-statement
	Попытка
		
		// Выполняем через попытку, так как разработчик правил мог не описать событие "ПередКонвертацией" в КД
		КомпонентыОбмена.МенеджерОбмена.ПередКонвертацией(КомпонентыОбмена);
		
	Исключение
		// Каких либо действий не требуется.
	КонецПопытки;
	
	Возврат КомпонентыОбмена;
	
КонецФункции

Функция ПравилаКонвертацииИзПравилаОбработки(КомпонентыОбмена)
	
	ИспользованиеПКО = Новый Структура;
	
	ПОД = КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЗначениеПОД;
	Для Каждого ИмяПКО Из ПОД.ИспользуемыеПКО Цикл
		
		ИспользованиеПКО.Вставить(ИмяПКО, Истина);
		
		// Правило, которое не выполнялось (история добавится позже)
		КомпонентыОбмена.ИсторияПримененияПКО.Вставить(ИмяПКО, Неопределено);
		
	КонецЦикла;
	
	Возврат ИспользованиеПКО;
	
КонецФункции

Функция СформироватьПоТипуОбъектXDTO(КомпонентыОбмена, ВыборкаДанныхДляОбработки)
	
	СодержимоеЗаписи = ВыборкаДанныхДляОбработки.СодержимоеЗаписи;
	ТипОбъектаXDTO = КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЗначениеТипОбъектаXDTO;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СодержимоеЗаписи);
	
	Попытка
		
		ПрочитанныйОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
		
	Исключение
		
		ПрочитанныйОбъектXDTO = Неопределено;
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьОшибкуДесериализацииПоТипуXDTO(КомпонентыОбмена, ТипОбъектаXDTO, СодержимоеЗаписи, ТекстОшибки);
		
	КонецПопытки;
	
	Возврат ПрочитанныйОбъектXDTO;
	
КонецФункции

Функция ЭтоУспешнаяКонвертацияОбъектаXDTO(КомпонентыОбмена)
	
	ЕстьОшибкиПримененияПКО = Ложь;
	Для каждого ЭлементСоответствия Из КомпонентыОбмена.ИсторияПримененияПКО Цикл
		
		ИсторияПримененияПКО = ЭлементСоответствия.Значение;
		Если ИсторияПримененияПКО = Неопределено Тогда
			
			Продолжить; // ПКО не использовалось
			
		КонецЕсли;
		
		ЕстьОшибкиПримененияПКО = ЕстьОшибкиПримененияПКО
			ИЛИ КонвертацияОбъектноРезультатыСлужебный.ЕстьОшибкиПКО(ИсторияПримененияПКО);
		
	КонецЦикла;
	
	Возврат НЕ КонвертацияОбъектноРезультатыСлужебный.ЕстьОшибкиПОД(КомпонентыОбмена.ИсторияКонвертацииОбъекта)
		И НЕ ЕстьОшибкиПримененияПКО;
	
КонецФункции

Процедура ПриБезуспешнойОбработкеОбъектаXDTO(КомпонентыОбмена, ВыборкаДанныхДляОбработки)
	
	КонвертацияОбъектноРезультатыСлужебный.ОтразитьОшибкиПредупрежденияПослеКонвертации(КомпонентыОбмена, ВыборкаДанныхДляОбработки);
	
КонецПроцедуры

Процедура ВыполнитьИспользуемыеПКО(КомпонентыОбмена, ПеремененныеКонвертации, ИспользованиеПКО, ДанныеXDTO)
	
	Если ИспользованиеПКО.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого ТекущееПКО Из ИспользованиеПКО Цикл
		
		Если Не ТекущееПКО.Значение Тогда // Отключили использование для текущего ПКО
			
			Продолжить;
			
		КонецЕсли;
		
		ИмяПКО = ТекущееПКО.Ключ;
		
		Если НЕ ПустаяСтрока(КомпонентыОбмена.ИсторияКонвертацииОбъекта.УказанноеИмяПКО)
			И КомпонентыОбмена.ИсторияКонвертацииОбъекта.УказанноеИмяПКО <> ИмяПКО Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		КомпонентыОбмена.Вставить("ИсторияПримененияТекущегоПКО",
					КонвертацияОбъектноРезультатыСлужебный.КонструкторИсторииПримененияПКО());
		
		ОпределитьПравилоКонвертацииОбъектаПоИмени(КомпонентыОбмена, ИмяПКО);
		Если КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьОшибкаОпределенияПКО = Ложь Тогда
			
			ПередКонвертациейОбъектаXDTO(КомпонентыОбмена);
			Если КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьОшибкаПоддерживаемыхОбъектовXDTO = Ложь Тогда
				
				ВыполнитьПКО(КомпонентыОбмена, ПеремененныеКонвертации, ДанныеXDTO);
				
			КонецЕсли;
			
		КонецЕсли;
		
		КомпонентыОбмена.ИсторияПримененияПКО[ИмяПКО] = КомпонентыОбмена.ИсторияПримененияТекущегоПКО;
		КомпонентыОбмена.Удалить("ИсторияПримененияТекущегоПКО");
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьПКО(КомпонентыОбмена, ПеремененныеКонвертации, ДанныеXDTO)
	
	ПравилоКонвертации = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПравилоКонвертации;
	
	// Применение ПКО к ДанныеXDTO (структура, которую получили из объектаXDTO)
	ДанныеИБ = КонвертироватьСтруктуруОбъектаXDTOВОбъектИБ(КомпонентыОбмена, ПравилоКонвертации, ДанныеXDTO);
	Если ДанныеИБ <> Неопределено
		И ПеремененныеКонвертации.МассивЗагруженныхОбъектов.Найти(ДанныеИБ) = Неопределено Тогда
		
		ПеремененныеКонвертации.МассивЗагруженныхОбъектов.Добавить(ДанныеИБ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициироватьИсториюКонвертацииОбъектаXDTO(КомпонентыОбмена, ВыборкаДанныхДляОбработки)
	
	ИсторияКонвертацииОбъекта = КонвертацияОбъектноРезультатыСлужебный.КонструкторИсторииПримененияПОД();
	ИсторияПримененияПКО = Новый Соответствие; // Ключ - имя ПКО, значение - история
	
	КомпонентыОбмена.Вставить("ИсторияКонвертацииОбъекта", ИсторияКонвертацииОбъекта);
	КомпонентыОбмена.Вставить("ИсторияПримененияПКО", ИсторияПримененияПКО);
	
	КомпонентыОбмена.ИсторияКонвертацииОбъекта.ПолученныйОбъект = ВыборкаДанныхДляОбработки.ПолученныйОбъект;
	КомпонентыОбмена.ИсторияКонвертацииОбъекта.ОбъектФормата    = ВыборкаДанныхДляОбработки.ОбъектФормата;
	КомпонентыОбмена.ИсторияКонвертацииОбъекта.УказанноеИмяПКО  = ВыборкаДанныхДляОбработки.ПравилоКонвертации;
	
КонецПроцедуры

// По типу объекта XDTO определяет ветвь алгоритма конвертации.
//
Процедура КонвертироватьДанныеОбъектаXDTO(КомпонентыОбмена, ОбъектXDTO, ПеремененныеКонвертации)
	
	ТипОбъектаXDTO = КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЗначениеТипОбъектаXDTO;
	Если ТипОбъектаXDTO.Имя = КонвертацияОбъектноРецепцияСервер.КлассФорматаЗапросНаВыгрузку() Тогда
		
		КонвертироватьЗапросНаВыгрузку(КомпонентыОбмена, ОбъектXDTO);
		
	ИначеЕсли ТипОбъектаXDTO.Имя = КонвертацияОбъектноРецепцияСервер.КлассФорматаУдалениеОбъекта() Тогда
		
		КонвертироватьУдалениеОбъекта(КомпонентыОбмена, ОбъектXDTO);
		
	Иначе
		
		КонвертироватьОбъектИнформационнойБазы(КомпонентыОбмена, ОбъектXDTO, ПеремененныеКонвертации);
		
	КонецЕсли;
	
КонецПроцедуры

// Конвертирует запросы на повторную выгрузку ссылочных данных.
// Фактически происходит регистрация к выгрузке найденных ссылок.
//
// Описание назначения (сценария):
// В ИБ-корреспондент текущая ИБ передала вложенную ссылку, которой не смогли подобрать соответствие.
// Поэтому сюда отправлен запрос, содержащий имя объекта формата, полученный UID и, возможно, навигационную ссылку.
// Ожидается, что по этим данным приложение подберет ссылку, зарегистрирует его к отправке.
//
// Алгоритм обработки.
// Операция формирования таблицы правил - ресурсоемкая, 
// поэтому конвертацию разбиваем на след этапы:
//   1. Чтение всех строк запроса на выгрузку;
//   2. Группировка по пространству имен;
//   3. Формирование таблиц ПКО на отправку;
//   4. Десериализация.
//
// Десериализация.
// Чтобы понять, какие данные надо отправить повторно:
// - выбираем все ПКО, которые работают с указанным объектом формата, учитываем переданное URI.
//   Обходим все метаданные (менеджеры), которые указаны в найденных ПКО,
//   т.к. мы не знаем, по какому правилу конвертации ссылка выгружалась.
//
// Надо помнить, что сейчас идет процесс получения данных, поэтому в Компонентах
// ПКО на получение, но правильнее искать в ПКО на отправку.
// Для этого отдельно сформируем таблицы правил отправки и будем изначально искать там,
// и только если результат пустой, добавим в поиск ПКО на получение данных.
//
// Пример отрывка XML с запросом на повторную выгрузку:
// <ЗапросНаВыгрузку>
//    <Строка>
//       <ИмяОбъектаФорматаПолученного>Справочник.ВидыНоменклатуры</ИмяОбъектаФорматаПолученного>
//       <СсылкаЗапросаНаВыгрузку>c3314ae6-6899-11e8-8780-b06ebf2faaf6</СсылкаЗапросаНаВыгрузку>
//       <СсылкаВнешняяНавигационная>e1c://filev/E/[Path_for_DB]/#e1cib/data/Справочник.ВидыНоменклатуры?ref=8780b06ebf2faaf611e86899c3314ae6</СсылкаВнешняяНавигационная>
//    </Строка>
// </ЗапросНаВыгрузку>
//
Процедура КонвертироватьЗапросНаВыгрузку(КомпонентыОбмена, ОбъектXDTO)
	
	Если ОбъектXDTO = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(ОбъектXDTO.Строка) <> Тип("СписокXDTO") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОтсутствующихСсылок = ПрочитатьЗапросНаВыгрузку(КомпонентыОбмена, ОбъектXDTO);
	
	ЗарегистрироватьСсылкиЗапросаПоНавигации(КомпонентыОбмена, ОписаниеОтсутствующихСсылок);
	Если ОписаниеОтсутствующихСсылок.Количество() > 0 Тогда
		
		ТаблицаПространствИмен = ОписаниеОтсутствующихСсылок.Скопировать(, "ПространствоИменОбъектаФормата");
		ТаблицаПространствИмен.Свернуть("ПространствоИменОбъектаФормата");
		
		Для каждого СтрокаТаблицыПространстваИмен Из ТаблицаПространствИмен Цикл
			
			ПространствоИменОбъектовФормата = СтрокаТаблицыПространстваИмен.ПространствоИменОбъектаФормата;
			ЗарегистрироватьСсылкиЗапросаПоПространствуИмен(КомпонентыОбмена, ОписаниеОтсутствующихСсылок, ПространствоИменОбъектовФормата);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура КонвертироватьОбъектИнформационнойБазы(КомпонентыОбмена, ОбъектXDTO, ПеремененныеКонвертации)
	
	// Добавим все ПКО из ПОД, которые описаны в КД.
	ИспользованиеПКО = ПравилаКонвертацииИзПравилаОбработки(КомпонентыОбмена);
	
	// Конвертируем ОбъектXDTO в ДанныеXDTO, где ДанныеXDTO - это структура.
	ДанныеXDTO = КонвертацияОбъектноРецепцияСервер.ОбъектXDTOВСтруктуру(КомпонентыОбмена, ОбъектXDTO);
	
	// Алгоритмы ПОД
	ПриОбработкеПОД(КомпонентыОбмена, ДанныеXDTO, ИспользованиеПКО);
	Если КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЕстьОшибкаСобытияПриОбработкеПОД = Истина Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// Выполним ПКО
	ВыполнитьИспользуемыеПКО(КомпонентыОбмена, ПеремененныеКонвертации, ИспользованиеПКО, ДанныеXDTO);
	
КонецПроцедуры

Процедура КонвертироватьУдалениеОбъекта(КомпонентыОбмена, ОбъектXDTO)
	
	Если ОбъектXDTO = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОписаниеУдаленияОбъекта = КонвертацияОбъектноРецепцияСервер.ОбъектXDTOВСтруктуру(КомпонентыОбмена, ОбъектXDTO);
	Если ТипЗнч(ОписаниеУдаленияОбъекта) <> Тип("Структура")
		ИЛИ НЕ ОписаниеУдаленияОбъекта.Свойство("СсылкаНаОбъект")                 //     НЕ прочитали УдалениеОбъекта
		ИЛИ ПустаяСтрока(ОписаниеУдаленияОбъекта.СсылкаНаОбъект.Значение)         // ИЛИ НЕ передан УИД
		ИЛИ ОписаниеУдаленияОбъекта.СсылкаНаОбъект.ТипЗначенияXDTO = Неопределено // ИЛИ НЕ определен тип объекта в пакете XDTO
		Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПОД = КонвертацияОбъектноРецепцияСервер.ПОДПоТипуОбъектаXDTO(КомпонентыОбмена, ОписаниеУдаленияОбъекта.СсылкаНаОбъект.ТипЗначенияXDTO, Истина);
	Если НЕ ЗначениеЗаполнено(ПОД) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого ИмяПравилаКонвертации Из ПОД.ИспользуемыеПКО Цикл
		
		Если ЗначениеЗаполнено(КомпонентыОбмена.ИсторияКонвертацииОбъекта.УказанноеИмяПКО)
			И КомпонентыОбмена.ИсторияКонвертацииОбъекта.УказанноеИмяПКО <> ИмяПравилаКонвертации Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ПравилоКонвертации = КомпонентыОбмена.ПравилаКонвертацииОбъектов.Найти(ИмяПравилаКонвертации, "ИмяПКО");
		Если ПравилоКонвертации = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		УдалениеОбъектаПоПравилуКонвертации(КомпонентыОбмена, ПравилоКонвертации, ОписаниеУдаленияОбъекта);
		
		КомпонентыОбмена.ИсторияПримененияПКО[ИмяПравилаКонвертации] = КомпонентыОбмена.ИсторияПримененияТекущегоПКО;
		КомпонентыОбмена.Удалить("ИсторияПримененияТекущегоПКО");
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОпределитьПравилоКонвертацииОбъектаПоИмени(КомпонентыОбмена, ИмяПКО)
	
	Попытка
		
		ПравилоКонвертации = КонвертацияОбъектноРецепцияСервер.ПКОПоИмени(КомпонентыОбмена, ИмяПКО);
		КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПравилоКонвертации = ПравилоКонвертации;
		
	Исключение
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьОшибкуОпределенияПКО(КомпонентыОбмена, ИмяПКО, ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ПередКонвертациейОбъектаXDTO(КомпонентыОбмена)
	
	ПравилоКонвертации = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПравилоКонвертации;
	
	ОбъектПроходитПоФильтру = КонвертацияОбъектноРецепцияСервер.ОбъектФорматаПроходитПоФильтруXDTO(КомпонентыОбмена, ПравилоКонвертации.ОбъектФормата);
	Если Не ОбъектПроходитПоФильтру Тогда
		
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьОшибкуОтсутствияПоддержкиОбъектаXDTO(КомпонентыОбмена);
		
	КонецЕсли;
	
КонецПроцедуры

// Событие вызывается до того, как будет получена порция конвертации.
// Рекомендуется использовать для инициализации переменных конвертации (параметров),
// подготовки данных (кэширование) и прочих сервисных операций.
//
Процедура ПередКонвертациейОбъектовXDTO(КомпонентыОбмена)
	
	Если НЕ КомпонентыОбмена.Свойство("ИсторияКонвертацииДанных") Тогда
		
		КомпонентыОбмена.Вставить("ИсторияКонвертацииДанных", КонвертацияОбъектноРезультатыСлужебный.КонструкторИсторииКонвертацииДанных());
		
	КонецЕсли;
	
	КонвертацияОбъектноСобытияКД.ПередКонвертацией(КомпонентыОбмена);
	Если КомпонентыОбмена.ИсторияКонвертацииДанных.ЕстьОшибкаСобытияПередКонвертацией = Истина Тогда
		
		ПриВнеплановомЗавершенииКонвертации(КомпонентыОбмена);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриВнеплановомЗавершенииКонвертации(КомпонентыОбмена)
	
	ОписаниеОшибки = КомпонентыОбмена.ИсторияКонвертацииДанных["ТекстыОшибок"]["ОшибкаСобытияПередКонвертацией"];
	ТипПроблемы = Перечисления.ТипыПроблемОбменаДанными.ОшибкаВыполненияКодаОбработчиковПриПолученииДанных;
	
	ЗначениеЗаписиНабора = Новый Структура;
	ЗначениеЗаписиНабора.Вставить("ТипПроблемы", ТипПроблемы);
	ЗначениеЗаписиНабора.Вставить("УзелИнформационнойБазы", КомпонентыОбмена.УзелКорреспондента);
	ЗначениеЗаписиНабора.Вставить("ДатаВозникновения", ТекущаяДатаСеанса());
	ЗначениеЗаписиНабора.Вставить("Причина", ОписаниеОшибки);
	ЗначениеЗаписиНабора.Вставить("Пропущена", Ложь);
	
	РегистрыСведений.РезультатыОбменаДанными.ДобавитьЗаписьОРезультатахОбмена(ЗначениеЗаписиНабора);
	
КонецПроцедуры

Процедура ПриОбработкеПОД(КомпонентыОбмена, ДанныеXDTO, ИспользованиеПКО)
	
	// Событие КД "ПриОбработкеПОД".
	КонвертацияОбъектноСобытияКД.ПриОбработкеПОД(КомпонентыОбмена, ДанныеXDTO, ИспользованиеПКО);
	
	// Если отрывок пришел с ПКО, а в "ПриОбработкеПОД" его отключили,
	// то возможна бесконечная рекурсия, потому что данные надо конвертировать по ПКО,
	// а ПКО до конвертации не доходит.
	//
	// Сценарий редкий, возможен если обновление ИБ изменило состав правил конвертации.
	// При этом ПКО вообще может отсутствовать, но лучше мы "ударимся" в ошибку и 
	// ниже по стеку сообщим об отсутствующем ПКО. Тогда пользователь сможет удалить отрывок,
	// а механизмы обмена не будут бесконечно нагружать конвертацию.
	ОтборПоИмениПКО = КомпонентыОбмена.ИсторияКонвертацииОбъекта.УказанноеИмяПКО;
	Если НЕ ПустаяСтрока(ОтборПоИмениПКО) Тогда
		
		Если НЕ ИспользованиеПКО.Свойство(ОтборПоИмениПКО)
			ИЛИ ИспользованиеПКО[ОтборПоИмениПКО] = Ложь Тогда
			
			ИспользованиеПКО.Вставить(ОтборПоИмениПКО, Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОкончанииОбработкиОбъектаXDTO(КомпонентыОбмена, ВыборкаДанныхДляОбработки)
	
	ЭтоУспешнаяКонвертацияОбъектаXDTO = ЭтоУспешнаяКонвертацияОбъектаXDTO(КомпонентыОбмена);
	Если ЭтоУспешнаяКонвертацияОбъектаXDTO Тогда
		
		// После обработки объекта XDTO (отрывка XML) надо снять блокировку, если такая есть,
		// и отметить отрывок сообщения обработанным.
		// 
		ПриУспешнойОбработкеОбъектаXDTO(КомпонентыОбмена, ВыборкаДанныхДляОбработки);
		
	Иначе
		
		// Отдельная логика, если были ошибки обработки объекта XDTO:
		// - может так случиться, что объект успешно обработан одним из нескольких правил.
		//   В этом случае необходимо сделать записи об ошибках,
		//   и отметить отрывок не обработанным с уточнением сбойного ПКО.
		//
		ПриБезуспешнойОбработкеОбъектаXDTO(КомпонентыОбмена, ВыборкаДанныхДляОбработки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОпределенииПравилаОбработкиДанных(КомпонентыОбмена, ВыборкаДанныхДляОбработки)
	
	ТипОбъектаXDTO = ФабрикаXDTO.Тип(ВыборкаДанныхДляОбработки.ПространствоИменURI, ВыборкаДанныхДляОбработки.ОбъектФормата);
	Если ТипОбъектаXDTO = Неопределено Тогда
		
		// Если не смогли получить тип объекта по URI + лок. имя, то переходим к чтению след порции данных xml.
		// Такое может произойти, если объект был выгружен в URI, который отсутствует в приемнике, например, 
		// объект в источнике добавлен расширением, а в приемнике есть одноименный объект в рамках базового пакета XDTO.
		// Отрывок XML отмечаем как ошибку.
		
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьОшибкуОпределенияТипаОбъектаXDTO(КомпонентыОбмена,
			ВыборкаДанныхДляОбработки.ОбъектФормата, ВыборкаДанныхДляОбработки.ПространствоИменURI, ВыборкаДанныхДляОбработки.СодержимоеЗаписи);
		Возврат;
		
	КонецЕсли;
	
	КлассФорматаУдалениеОбъекта = КонвертацияОбъектноРецепцияСервер.КлассФорматаУдалениеОбъекта();
	КлассФорматаЗапросНаВыгрузку = КонвертацияОбъектноРецепцияСервер.КлассФорматаЗапросНаВыгрузку();
	
	КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЗначениеТипОбъектаXDTO = ТипОбъектаXDTO;
	Если КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЗначениеТипОбъектаXDTO.Имя = КлассФорматаУдалениеОбъекта
		ИЛИ КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЗначениеТипОбъектаXDTO.Имя = КлассФорматаЗапросНаВыгрузку
		Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// Подбор ПОД по имени объекта формата EnterpriseData
	ИмяТипаОбъектаXDTO = КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЗначениеТипОбъектаXDTO.Имя;
	ПравилоОбработки = КонвертацияОбъектноРецепцияСервер.ПОДПоИмениОбъектаФорматаXDTO(КомпонентыОбмена, ИмяТипаОбъектаXDTO, Истина);
	Если ЗначениеЗаполнено(ПравилоОбработки) Тогда
		
		КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЗначениеПОД = ПравилоОбработки;
		
	Иначе
		
		СтекВызова = "{см. КонвертацияОбъектноСлужебный.ПриОпределенииПравилаОбработкиДанных()}";
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьОшибкуОпределенияПОД(КомпонентыОбмена, ИмяТипаОбъектаXDTO, СтекВызова);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОкончанииКонвертацииОбъектовXDTO(КомпонентыОбмена)
	
	Попытка
		
		// В объектной модели надо учитывать, что ошибка одного объекта не должна
		// блокировать загрузку других.
		//
		// Следовательно это событие, тоже вызываем даже если "КомпонентыОбмена.ФлагОшибки = Истина",
		// т.к. оно стартует после обработки всех доступных кусочков xml, в т.ч. тех,
		// чья конвертация прошла успешно.
		КомпонентыОбмена.МенеджерОбмена.ПослеКонвертации(КомпонентыОбмена);
		
	Исключение
		
		// Ошибки события ПослеКонвертации() пишем в журнал, работу продолжаем без вызова исключения...
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьОшибкуСобытияПослеКонвертации(КомпонентыОбмена, ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ПриУспешнойОбработкеОбъектаXDTO(КомпонентыОбмена, ВыборкаДанныхДляОбработки)
	
	ВремяНачала = ОбменДаннымиОценкаПроизводительности.НачатьЗамер();
	
	КомпонентыОбмена.СчетчикЗагруженныхОбъектов = КомпонентыОбмена.СчетчикЗагруженныхОбъектов + 1;
	
	ДанныеУспешнойОбработки = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеУспешнойОбработкиОбъекта();
	ДанныеУспешнойОбработки.УзелПланаОбмена = КомпонентыОбмена.УзелКорреспондента;
	ДанныеУспешнойОбработки.ПолученныйОбъект = ВыборкаДанныхДляОбработки.ПолученныйОбъект;
	ДанныеУспешнойОбработки.ОбъектФормата = ВыборкаДанныхДляОбработки.ОбъектФормата;
	ДанныеУспешнойОбработки.ДатаОбрабатываемойВерсии = ВыборкаДанныхДляОбработки.ДатаДобавления;
	
	РегистрыСведений.ОбъектыКЗагрузке.ОтразитьУспешнуюОбработкуОбъекта(ДанныеУспешнойОбработки);
	
	ОбменДаннымиОценкаПроизводительности.ЗавершитьЗамер(
			ВремяНачала, "ОтражениеУспешнойКонвертацииОбъекта", "", КомпонентыОбмена, 
			ОбменДаннымиОценкаПроизводительности.ТипСобытияБиблиотека());
	
КонецПроцедуры

Процедура РезультатКонвертацииДанныхВТаблицу(КомпонентыОбмена, ВыборкаДанныхДляОбработки, РезультатИнтерактивнойКонвертации)
	
	РезультатКонвертации = РезультатИнтерактивнойКонвертации.Добавить();
	ЗаполнитьЗначенияСвойств(РезультатКонвертации, ВыборкаДанныхДляОбработки);
	
	РезультатКонвертации.ИсторияКонвертацииОбъекта = КомпонентыОбмена.ИсторияКонвертацииОбъекта;
	РезультатКонвертации.ИсторияПримененияПКО = КомпонентыОбмена.ИсторияПримененияПКО;
	
КонецПроцедуры

#КонецОбласти

#Область КонвертироватьСтруктуруОбъектаXDTOВОбъектИБ

#Область ЗаписьОбъектаИБ

Функция ИмяСтратегииПроведения() Экспорт
	
	Возврат "_Проведение";
	
КонецФункции

Функция ИмяСтратегииЗаписи() Экспорт
	
	Возврат "_Запись"; // ОбменДанными.Загрузка = Ложь
	
КонецФункции

Функция ИмяСтратегииСохранения() Экспорт
	
	Возврат "_Сохранение"; // ОбменДанными.Загрузка = Истина
	
КонецФункции

Функция ПолучитьТекстыСообщенийПриЗаписи(Стек, СообщенияОПроблемеЗаписи)
	
	Если ТипЗнч(СообщенияОПроблемеЗаписи) <> Тип("ФиксированныйМассив") Тогда
		
		Возврат НСтр("ru ='Непредвиденная ошибка при записи объекта'", ОбщегоНазначения.КодОсновногоЯзыка());
		
	КонецЕсли;
	
	ТекстОшибки = Стек + Символы.ПС;
	Для Каждого ПользовательскоеСообщение Из СообщенияОПроблемеЗаписи Цикл
		
		Если ПустаяСтрока(ТекстОшибки) Тогда
			
			ТекстОшибки = ПользовательскоеСообщение.Текст;
			
		Иначе
			
			ТекстОшибки = ТекстОшибки + Символы.ПС + ПользовательскоеСообщение.Текст;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СокрЛП(ТекстОшибки);
	
КонецФункции

Процедура ЗаблокироватьОбъектИБ(КомпонентыОбмена, ДанныеИБ)
	
	Если ДанныеИБ = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ДанныеИБ.Заблокирован() = Истина Тогда
		
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьПредупреждениеБлокировкиОбъекта(КомпонентыОбмена, ДанныеИБ);
		
	Иначе
		
		// Выполнить блокировку объекта от изменения другими режимами или пользователями.
		ДанныеИБ.Заблокировать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьДанныеИБ(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБ, ЗаписьДанныхВыполнена)
	
	ПриПроверкеРазрешенийЗаписиОбъекта(КомпонентыОбмена, ДанныеИБ);
	Если КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьПредупреждениеИзмененияНеразделенныхДанных = Истина Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// Определение стратегии записи объектов исходит из правила,
	// что загрузка данных не должна допускать ухудшения состояния ИБ после конвертации данных.
	ОпределитьСтратегиюЗаписиОбъектаИБ(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБ);
	
	КонвертацияОбъектноРецепцияСервер.ОтключитьОбновлениеКлючейДоступа(Истина); // Отключили
	СтратегияЗаписиИПроведенияОбъекта(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБ, ЗаписьДанныхВыполнена);
	КонвертацияОбъектноРецепцияСервер.ОтключитьОбновлениеКлючейДоступа(Ложь); // Включили
	
	// Если работаем с новым объектом, то ссылка появиться только после записи.
	// При этом запись могла пройти с проблемами, например, проведения.
	// Для привязки проблем/предупреждений заполним ссылку записанного объекта в историю, если ее там не было.
	Если ПравилоКонвертации.ЭтоСсылочныйТип = ИСТИНА
		И НЕ ЗначениеЗаполнено(КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ДанныеИБСсылка)
		И ЗначениеЗаполнено(ДанныеИБ.Ссылка) Тогда
		
		КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ДанныеИБСсылка = ДанныеИБ.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьОбъектСПроведение(КомпонентыОбмена, ДанныеИБ, ЗаписьДанныхВыполнена)
	
	Стек = НСтр("ru ='См. КонвертацияОбъектноСлужебный.ЗаписатьОбъектСПроведение()'");
	
	НачатьТранзакцию();
	Попытка
		
		Если ДанныеИБ.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
			
			ДанныеИБ.ДополнительныеСвойства.Удалить("ОтключитьМеханизмРегистрацииОбъектов");
			
		КонецЕсли;
		
		Если ДанныеИБ.ДополнительныеСвойства.ПолучениеЭлементаДанных = ПолучениеЭлементаДанных.Игнорировать Тогда
			
			ТекстОшибки = НСтр("ru ='Отказано в проведении документа из-за запрета загрузки данных.'");
			ТекстОшибки = Стек + Символы.ПС + ТекстОшибки; // Фикс проблемы ниже
			
		ИначеЕсли ДанныеИБ.ПроверитьЗаполнение() Тогда
			
			ДанныеИБ.ОбменДанными.Загрузка = Ложь;
			ДанныеИБ.Проведен = Ложь;
			ДанныеИБ.Записать(РежимЗаписиДокумента.Проведение);
			ЗаписьДанныхВыполнена = ДанныеИБ.Проведен;
			
		Иначе
			
			СообщенияОПроблемеЗаписи = ПолучитьСообщенияПользователю(Истина);
			ТекстОшибки = ПолучитьТекстыСообщенийПриЗаписи(Стек, СообщенияОПроблемеЗаписи); // Фикс проблемы ниже
			
		КонецЕсли;
		
		Если ЗаписьДанныхВыполнена = Истина Тогда
			
			ЗафиксироватьТранзакцию();
			
		Иначе
			
			ОтменитьТранзакцию();
			
		КонецЕсли;
		
	Исключение
		
		ОтменитьТранзакцию(); // Фикс проблемы ниже
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Если ЗаписьДанныхВыполнена <> Истина Тогда
		
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьПредупреждениеПриПроведении(КомпонентыОбмена, ДанныеИБ, ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьОбъектСБизнесЛогикой(КомпонентыОбмена, ДанныеИБ, ЗаписьДанныхВыполнена)
	
	ЭтоДокумент = (КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПравилоКонвертации.ЭтоДокумент = Истина);
	СообщенияОПроблемеЗаписи = Неопределено;
	
	НачатьТранзакцию();
	Попытка
		
		Если ДанныеИБ.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
			
			ДанныеИБ.ДополнительныеСвойства.Удалить("ОтключитьМеханизмРегистрацииОбъектов");
			
		КонецЕсли;
		
		ДанныеИБ.ОбменДанными.Загрузка = Ложь;
		Если ДанныеИБ.ПроверитьЗаполнение() Тогда
			
			Если ЭтоДокумент Тогда
				
				ДанныеИБ.Записать(РежимЗаписиДокумента.Запись);
				ЗаписьДанныхВыполнена = Истина;
				
			Иначе
				
				ДанныеИБ.Записать();
				ЗаписьДанныхВыполнена = Истина;
				
			КонецЕсли;
			
		Иначе
			
			Стек = НСтр("ru ='См. КонвертацияОбъектноСлужебный.ЗаписатьОбъектСБизнесЛогикой()'");
			СообщенияОПроблемеЗаписи = ПолучитьСообщенияПользователю(Истина);
			ТекстОшибки = ПолучитьТекстыСообщенийПриЗаписи(Стек, СообщенияОПроблемеЗаписи); // Фикс проблемы ниже
			
		КонецЕсли;
		
		Если ЗаписьДанныхВыполнена = Истина Тогда
			
			ЗафиксироватьТранзакцию();
			
		Иначе
			
			ОтменитьТранзакцию();
			
		КонецЕсли;
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); // Фикс проблемы ниже
		
	КонецПопытки;
	
	Если ЗаписьДанныхВыполнена <> Истина Тогда
		
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьПредупреждениеПриЗаписиОбъекта(КомпонентыОбмена, ДанныеИБ, ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьОбъектСВыключеннойБизнесЛогикой(КомпонентыОбмена, ДанныеИБ, ЗаписьДанныхВыполнена)
	
	ЭтоДокумент = (КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПравилоКонвертации.ЭтоДокумент = Истина);
	
	НачатьТранзакцию();
	Попытка
		
		Если ДанныеИБ.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
			
			ДанныеИБ.ДополнительныеСвойства.Удалить("ОтключитьМеханизмРегистрацииОбъектов");
			
		КонецЕсли;
		
		ДанныеИБ.ОбменДанными.Загрузка = Истина;
		Если ЭтоДокумент Тогда
			
			ДанныеИБ.Записать(РежимЗаписиДокумента.Запись);
			
		Иначе
			
			ДанныеИБ.Записать();
			
		КонецЕсли;
		
		ЗаписьДанныхВыполнена = Истина;
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьПредупреждениеПриСохраненииОбъекта(КомпонентыОбмена, ДанныеИБ, ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

// Определение этапов, которые возможны при сохранении (записи) полученных данных.
// Руководствуемся тем, что не должны допустить ухудшения состояния ИБ после конвертации данных.
//
// Исходя из этого возможные стратегии записи;
// 1. Новый объект можно попытаться (строго в указанном порядке):
//   - провести;
//   - в случае неудачи, записать (ОбменДанными.Загрузка = Ложь);
//   - в случае неудачи, сохранить (ОбменДанными.Загрузка = Истина);
//
// 2. Существующий проведенный объект (документ):
//   - провести;
//   - в случае неудачи, записать предупреждение;
//
// 3. Существующий не проведенный объект (документ, справочник и т.д.):
//   - провести;
//   - в случае неудачи, записать (ОбменДанными.Загрузка = Ложь);
//   - в случае неудачи, если есть отметка об ошибке загрузки, сохранить (ОбменДанными.Загрузка = Истина);
//
Процедура ОпределитьСтратегиюЗаписиОбъектаИБ(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБ)
	
	СтратегияЗаписиОбъекта = КонвертацияОбъектноСервер.ВозможныеСтратегияЗаписиОбъекта();
	
	ИсторияПримененияТекущегоПКО = КомпонентыОбмена.ИсторияПримененияТекущегоПКО;
	МетаданныеОбъекта = ПравилоКонвертации.ОбъектДанных;
	
	// Для нового документа или справочника
	Если ИсторияПримененияТекущегоПКО.ЭтоНовыйОбъект = Истина Тогда
		
		Если ПравилоКонвертации.ЭтоДокумент
			И МетаданныеОбъекта.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить
			Тогда
			
			// Максимально не строгая стратегия, которая разрешает Проведение, Запись и Сохранение
			ИсторияПримененияТекущегоПКО.СтратегияЗаписиОбъекта = СтратегияЗаписиОбъекта[2];
			
		Иначе
			
			// Максимально не строгая стратегия, которая разрешает Запись и Сохранение
			ИсторияПримененияТекущегоПКО.СтратегияЗаписиОбъекта = СтратегияЗаписиОбъекта[4];
			
		КонецЕсли;
		
	// Для существующего документа с проведением
	ИначеЕсли ПравилоКонвертации.ЭтоДокумент
		И МетаданныеОбъекта.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
		
		Если ДанныеИБ.Проведен Тогда
			
			// Для документов, которые проведены разрешена запись только в режиме Проведение.
			ИсторияПримененияТекущегоПКО.СтратегияЗаписиОбъекта = СтратегияЗаписиОбъекта[0];
			
		ИначеЕсли КонвертацияОбъектноРезультатыСлужебный.ЕстьОтметкаОПроблемеЗаписиОбъекта()
			ИЛИ ИсторияПримененияТекущегоПКО.ИгнорироватьПроблемыПриЗаписи
			Тогда
			
			// Считаем, что если документ может проводиться, но в момент загрузки
			// есть не решенная проблема прошлой конвертации, то хуже мы не сделаем,
			// если выберем стратегию Проведение, Запись и Сохранение.
			ИсторияПримененияТекущегоПКО.СтратегияЗаписиОбъекта = СтратегияЗаписиОбъекта[2];
			
		Иначе
			
			// Если это документ, который может проводиться, но не проведен и записи о
			// проблемах прошлой конвертации отсутствуют, то используем стратегию Проведение, Запись
			ИсторияПримененияТекущегоПКО.СтратегияЗаписиОбъекта = СтратегияЗаписиОбъекта[1];
			
		КонецЕсли;
		
	// Для существующего справочника или существующего документа без проведения
	Иначе
		
		Если КонвертацияОбъектноРезультатыСлужебный.ЕстьОтметкаОПроблемеЗаписиОбъекта()
			ИЛИ ИсторияПримененияТекущегоПКО.ИгнорироватьПроблемыПриЗаписи
			Тогда
			
			// Считаем, что если есть не решенная проблема записи объекта,
			// то можно использовать стратегию Запись и Сохранение.
			ИсторияПримененияТекущегоПКО.СтратегияЗаписиОбъекта = СтратегияЗаписиОбъекта[4];
			
		Иначе
			
			// Для всех остальных существующих объектов разрешена только Запись (режим "ОбменДанными.Загрузка = Ложь")
			ИсторияПримененияТекущегоПКО.СтратегияЗаписиОбъекта = СтратегияЗаписиОбъекта[3];
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеКонвертацииПрочитанногоОбъектаXDTO(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБ, ЗаписьДанныхВыполнена)
	
	КонвертацияОбъектноСобытияКД.ПослеКонвертацииОбъекта(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБ, ЗаписьДанныхВыполнена);
	
	Если КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ДобавленоНовоеСоответствиеПИСО = ИСТИНА
		И КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЭтоНовыйОбъект = ИСТИНА
		И ЗаписьДанныхВыполнена = ЛОЖЬ Тогда
		
		СтруктураЗаписи = Новый Структура;
		СтруктураЗаписи.Вставить("УзелИнформационнойБазы", КомпонентыОбмена.УзелКорреспондента);
		СтруктураЗаписи.Вставить("Ссылка", КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ДанныеИБСсылка);
		СтруктураЗаписи.Вставить("Идентификатор", КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ВнешняяСсылкаСтрокой);
		
		КонвертацияОбъектноРецепцияСервер.УдалитьЗаписьПИСО(СтруктураЗаписи, Истина);
		КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ДобавленоНовоеСоответствиеПИСО = Ложь;
		КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ДанныеИБСсылка = Неопределено;
		
	КонецЕсли;
	
	Если ПравилоКонвертации.ЭтоСсылочныйТип = Истина Тогда
		
		СнятьБлокировкуОбъектаИБ(ДанныеИБ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПредварительнаяОбработкаОбъектаПередЗаписью(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБ)
	
	Если НЕ ПравилоКонвертации.ЭтоСсылочныйТип Тогда
		
		Возврат
		
	КонецЕсли;
	
	ВнешняяСсылкаСтрокой = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ВнешняяСсылкаСтрокой;
	Если НЕ ПустаяСтрока(ВнешняяСсылкаСтрокой) 
		И КомпонентыОбмена.ЭтоОбменЧерезПланОбмена // Когда делаем загрузку обработкой "ЛОЖЬ"
		Тогда
		
		Если ДанныеИБ.ЭтоНовый() Тогда
			
			УстановитьИдентификаторНовогоОбъектаИБ(КомпонентыОбмена, ДанныеИБ, ВнешняяСсылкаСтрокой);
			
		КонецЕсли;
		
		ДанныеИБСсылка = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ДанныеИБСсылка;
		НавигационнаяСсылка = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.НавигационнаяСсылка;
		ДобавитьПубличныйИдентификатор(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБСсылка, ВнешняяСсылкаСтрокой, НавигационнаяСсылка);
		
	КонецЕсли;
	
	КонвертацияОбъектноРецепцияСервер.ПровестиГенерациюКодаНомераПриНеобходимости(ДанныеИБ);
	
	Если КомпонентыОбмена.ЭтоОбменЧерезПланОбмена Тогда // Когда делаем загрузку обработкой "ЛОЖЬ"
		
		ПолучениеЭлемента = ПолучениеЭлементаДанных.Авто;
		СтандартныеПодсистемыСервер.ПриПолученииДанныхОтГлавного(ДанныеИБ, ПолучениеЭлемента, Ложь, КомпонентыОбмена.УзелКорреспондентаОбъект);
		
		ДанныеИБ.ДополнительныеСвойства.Вставить("ПолучениеЭлементаДанных", ПолучениеЭлемента);
		Если ПолучениеЭлемента = ПолучениеЭлементаДанных.Игнорировать Тогда
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеИБ.ПометкаУдаления Тогда
		
		Если ДанныеИБ.Предопределенный Тогда
			
			КонвертацияОбъектноРецепцияСервер.СнятьПометкуУдаленияСПредопределенногоЭлемента(КомпонентыОбмена, ПравилоКонвертации.ТипДанных, ДанныеИБ);
			
		Иначе
			
			ДанныеИБ.ПометкаУдаления = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриПроверкеРазрешенийЗаписиОбъекта(КомпонентыОбмена, ДанныеИБ)
	
	РазрешенаЗаписьОбъектаВРазделеннойИБ(КомпонентыОбмена, ДанныеИБ);
	
КонецПроцедуры

Процедура РазрешенаЗаписьОбъектаВРазделеннойИБ(КомпонентыОбмена, ДанныеИБ)
	
	Если КонвертацияОбъектноРецепцияСервер.РазрешенаЗаписьОбъекта(КомпонентыОбмена, ДанныеИБ) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	КонвертацияОбъектноРезультатыСлужебный.ФиксироватьПредупреждениеИзмененияНеразделенныхДанных(КомпонентыОбмена, ДанныеИБ);
	
КонецПроцедуры

Процедура СлитьСвойстваОтсутствующиеИСвойстваИсключенные(ПолученныеДанные, РеквизитыОбъектаКопия, СвойстваИсключенныеИзКонвертации)
	
	Если НЕ ПолученныеДанные.ДополнительныеСвойства.Свойство("СвойстваОтсутствующиеВПолученныхДанных") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СвойстваОтсутствующиеВПолученныхДанных = СтрРазделить(ПолученныеДанные.ДополнительныеСвойства.СвойстваОтсутствующиеВПолученныхДанных, ",", Ложь);
	УбратьПробелыВИменахПолей(СвойстваОтсутствующиеВПолученныхДанных);
	
	Для НомерОтсутствующегоПоля = 0 По СвойстваОтсутствующиеВПолученныхДанных.ВГраница() Цикл
		
		ПолеИсключенное = СвойстваИсключенныеИзКонвертации.Найти(СвойстваОтсутствующиеВПолученныхДанных[НомерОтсутствующегоПоля]);
		Если ПолеИсключенное = Неопределено Тогда
			
			СвойстваИсключенныеИзКонвертации.Добавить(СвойстваОтсутствующиеВПолученныхДанных[НомерОтсутствующегоПоля]);
			
		КонецЕсли;
		
		ИндексОтсутствующегоПоля = РеквизитыОбъектаКопия.Найти(СвойстваОтсутствующиеВПолученныхДанных[НомерОтсутствующегоПоля]);
		Если ИндексОтсутствующегоПоля <> Неопределено Тогда
			
			РеквизитыОбъектаКопия.Удалить(ИндексОтсутствующегоПоля);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СнятьБлокировкуОбъектаИБ(ДанныеИБ)
	
	Если НЕ ДанныеИБ.Заблокирован() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеИБ.Разблокировать();
	
КонецПроцедуры

Процедура СтратегияЗаписиИПроведенияОбъекта(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБ, УспешноеВыполнениеПКО)
	Перем УзелКорреспондента;
	
	ИсторияПримененияТекущегоПКО = КомпонентыОбмена.ИсторияПримененияТекущегоПКО;
	
	Если КомпонентыОбмена.ЭтоОбменЧерезПланОбмена Тогда
		
		УзелКорреспондента = КомпонентыОбмена.УзелКорреспондента;
		
	КонецЕсли;
	
	КонвертацияОбъектноРецепцияСервер.УстановитьОбменДаннымиЗагрузка(УзелКорреспондента, ДанныеИБ, Ложь, Ложь);
	
	// Пробуем провести документ, если стратегия разрешает
	РазрешеноПроведениеОбъекта = (СтрНайти(ИсторияПримененияТекущегоПКО.СтратегияЗаписиОбъекта, ИмяСтратегииПроведения()) > 0);
	Если РазрешеноПроведениеОбъекта Тогда
		
		ЗаписатьОбъектСПроведение(КомпонентыОбмена, ДанныеИБ, УспешноеВыполнениеПКО);
		Если УспешноеВыполнениеПКО = Истина Тогда
			
			Возврат; // Успешное проведение
			
		КонецЕсли;
		
		// Обработку ошибки проведения можно выполнить в событии КД <ПослеКонвертацииОбъекта>.
		// См. флаг ИсторияПримененияТекущегоПКО.ЕстьПредупреждениеПриПроведении.
	КонецЕсли;
	
	// Если не смогли провести и стратегия разрешает запись, то далее работаем в режиме ОбменДанными.Загрузка = Ложь;
	РазрешенаЗаписьОбъекта = (СтрНайти(ИсторияПримененияТекущегоПКО.СтратегияЗаписиОбъекта, ИмяСтратегииЗаписи()) > 0);
	Если РазрешенаЗаписьОбъекта Тогда
		
		ЗаписатьОбъектСБизнесЛогикой(КомпонентыОбмена, ДанныеИБ, УспешноеВыполнениеПКО);
		Если УспешноеВыполнениеПКО = Истина Тогда
			
			Возврат;
			
		КонецЕсли;
		
		// Обработку ошибки записи можно выполнить в событии КД <ПослеКонвертацииОбъекта>.
		// См. флаг ИсторияПримененияТекущегоПКО.ЕстьПредупреждениеПриЗаписи.
	КонецЕсли;
	
	// Если не смогли провести, записать и стратегия разрешает сохранение, то далее работаем в режиме
	// ОбменДанными.Загрузка = Истина;
	РазрешеноСохранениеОбъекта = (СтрНайти(ИсторияПримененияТекущегоПКО.СтратегияЗаписиОбъекта, ИмяСтратегииСохранения()) > 0);
	Если РазрешеноСохранениеОбъекта Тогда
		
		// Если не смогли провести и записать, пробуем сохранить в режиме ОбменДанными.Загрузка = Истина;
		ЗаписатьОбъектСВыключеннойБизнесЛогикой(КомпонентыОбмена, ДанныеИБ, УспешноеВыполнениеПКО);
		Если УспешноеВыполнениеПКО Тогда
			
			Возврат;
			
		КонецЕсли;
		
		// Обработку ошибки сохранения можно выполнить в событии КД <ПослеКонвертацииОбъекта>.
		// См. флаг ИсторияПримененияТекущегоПКО.ЕстьПредупреждениеПриСохранении.
	КонецЕсли;
	
КонецПроцедуры

Процедура УбратьПробелыВИменахПолей(МассивИменПолей)
	
	Если МассивИменПолей.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// Убираем пробелы (могли быть оставлены разработчиками правил)
	Для НомерПоля = 0 По МассивИменПолей.ВГраница() Цикл
		
		МассивИменПолей[НомерПоля] = СокрЛП(МассивИменПолей[НомерПоля]);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьИдентификаторНовогоОбъектаИБ(КомпонентыОбмена, ДанныеИБ, ВнешняяСсылкаСтрокой)
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ДанныеИБ.Ссылка);
	СсылкаПоВнешнемуИдентификатору = МенеджерОбъекта.ПолучитьСсылку(Новый УникальныйИдентификатор(ВнешняяСсылкаСтрокой));
	
	Если СсылкаПоВнешнемуИдентификатору.Пустая()
		ИЛИ НЕ ОбщегоНазначения.СсылкаСуществует(СсылкаПоВнешнемуИдентификатору) Тогда
		
		// Если входящий UID свободен
		ДанныеИБ.УстановитьСсылкуНового(СсылкаПоВнешнемуИдентификатору);
		
	Иначе
		
		ДанныеИБ.УстановитьСсылкуНового(МенеджерОбъекта.ПолучитьСсылку(Новый УникальныйИдентификатор));
		
	КонецЕсли;
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ДанныеИБСсылка = ДанныеИБ.ПолучитьСсылкуНового();
	
КонецПроцедуры

#КонецОбласти

Функция ВнешняяНавигационнаяСсылкаИзДанныхXDTO(ПравилоКонвертации, ДанныеXDTO)
	
	НавигационнаяСсылка = "";
	Если НЕ ПравилоКонвертации.ЭтоСсылочныйТип Тогда
		
		Возврат НавигационнаяСсылка;
		
	КонецЕсли;
	
	КлассНавигационнаяСсылка = КонвертацияОбъектноРецепцияСервер.КлассФорматаСсылкаВнешняяНавигационная();
	Если НЕ ДанныеXDTO.Свойство(КлассНавигационнаяСсылка) Тогда
		
		Возврат НавигационнаяСсылка;
		
	КонецЕсли;
	
	ДанныеXDTO.Свойство(КлассНавигационнаяСсылка, НавигационнаяСсылка);
	Возврат СокрЛП(НавигационнаяСсылка);
	
КонецФункции

Функция ВнешняяСсылкаИзДанныхXDTO(ПравилоКонвертации, ДанныеXDTO)
	
	ВнешняяСсылкаСтрокой = "";
	Если НЕ ПравилоКонвертации.ЭтоСсылочныйТип Тогда
		
		Возврат ВнешняяСсылкаСтрокой;
		
	КонецЕсли;
	
	КлассСсылка = КонвертацияОбъектноРецепцияСервер.КлассСсылка();
	Если НЕ ДанныеXDTO.Свойство(КлассСсылка) Тогда
		
		Возврат ВнешняяСсылкаСтрокой;
		
	КонецЕсли;
	
	ВнешняяСсылкаСтрокой = СокрЛП(ДанныеXDTO[КлассСсылка].Значение);
	Возврат ВнешняяСсылкаСтрокой;
	
КонецФункции

Функция ДействияПриПолученииДанныхОбменаДляОбъекта(КомпонентыОбмена, ПравилоКонвертации)
	
	УзелПланаОбмена = КомпонентыОбмена.УзелКорреспондента;
	ОбъектМетаданных = ПравилоКонвертации.ОбъектДанных;
	
	ДействияПриПолучении = РегистрыСведений.ДействияПриПолученииДанныхОбмена.ДействияПриПолученииДанныхОбменаДляОбъекта(
		УзелПланаОбмена,
		ОбъектМетаданных);
	
	Если КомпонентыОбмена.ПараметрыИнтерактивнойКонвертации.ИспользоватьПереданныеДействияПриПолучении Тогда
		
		ДействияПриПолучении.Загружать = Истина;
		
		ИменаПолей = "УстанавливатьСоответствия, КакЗагружать";
		ЗаполнитьЗначенияСвойств(ДействияПриПолучении, КомпонентыОбмена.ПараметрыИнтерактивнойКонвертации.ДействияПриПолучении, ИменаПолей);
		
	КонецЕсли;
	
	Возврат ДействияПриПолучении;
	
КонецФункции

Функция ЗначениеСвойстваДляКонвертации(ИсточникДанных, ПКС, ИмяСвойстваФормата, ПолученныеДанные)
	Перем ЗначениеСвойства;
	
	ЭтоВложенноеСвойство = (СтрНайти(ИмяСвойстваФормата, ".") > 0);
	Если ЭтоВложенноеСвойство Тогда
		
		ВложенныеСвойства = СтрРазделить(ИмяСвойстваФормата, ".", Ложь);
		КонвертацияОбъектноРецепцияСервер.ПолучитьЗначениеВложенныхСвойств(ИсточникДанных, ВложенныеСвойства, ЗначениеСвойства);
		
	Иначе
		
		// Проверим и получим значение свойство из структуры
		СвойствоНайдено = ИсточникДанных.Свойство(ИмяСвойстваФормата, ЗначениеСвойства);
		
		Если НЕ СвойствоНайдено
			И НЕ ПКС.ОбработкаКлючевогоСвойства Тогда
			
			ДобавитьЗаписьОтсутствующихСвойств(ПолученныеДанные, ИмяСвойстваФормата);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЗначениеСвойства;
	
КонецФункции

// Поддержка конвертации объектов, которые переданы произвольной структурой
//
// В объектной модели отказываемся от конвертации вложенных ссылок по ключевым свойствам,
// т.к. ожидаем получение полного объекта или ручное сопоставление,
// но этот код сохранен для поддержки обратной совместимости.
// Сценарий:
// - конвертация объектов переданных структурой (без УИД).
// ЗначениеСвойства - это ДанныеXDTO, где имена полей могут не совпадать с именами реквизитов объектов ИБ,
//
// Параметры:
//   КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена.
//   ПКС - СтрокаТаблицыЗначений - правило конвертации свойства.
//   ПКОИзПКС - СтрокаТаблицыЗначений - правило конвертации объекта.
//   ЗначениеСвойства - Структура - данные, полученные из зачитанного объекта XDTO.
//
// Возвращаемое значение:
//   Неопределено,
//   ДокументСсылка,
//   СправочникСсылка - объектная ссылка, которая получена в результате поиска.
//                      Если поиск не дал результата, то Неопределено.
Функция ЗначениеСложногоСвойстваБезУникальногоИдентификатора(КомпонентыОбмена, ПКС, ПКОИзПКС, ЗначениеСвойства)
	
	ВложеннаяСсылка = Неопределено;
	ВнешняяСсылкаСтрокой = "";
	НавигационнаяСсылка = "";
	
	ПКОДляСвойства = КонвертацияОбъектноРецепцияСервер.ПКОПоИмени(КомпонентыОбмена, ПКС.ПравилоКонвертацииСвойства);
	СсылкаДляПоиска = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, ЗначениеСвойства, ПКОДляСвойства, "ПолучитьСсылку");
	Если СсылкаДляПоиска <> Неопределено Тогда
		
		ВложеннаяСсылка = СопоставитьОбъектПоПолямПоискаИлиАлгоритмом(КомпонентыОбмена, ПКОИзПКС, СсылкаДляПоиска, ВнешняяСсылкаСтрокой, НавигационнаяСсылка);
		
		УдалятьСозданныеПоКлючевымСвойствам = КомпонентыОбмена.УдалятьСозданныеПоКлючевымСвойствам;
		Если ТипЗнч(ПКОДляСвойства) = Тип("Структура")
			И ПКОДляСвойства.Свойство("УдалятьСозданныеПоКлючевымСвойствам") Тогда
			
			УдалятьСозданныеПоКлючевымСвойствам = ПКОДляСвойства.УдалятьСозданныеПоКлючевымСвойствам;
			
		КонецЕсли;
		
		Если УдалятьСозданныеПоКлючевымСвойствам
			ИЛИ (ВложеннаяСсылка <> Неопределено
				И СсылкаДляПоиска <> Неопределено
				И СсылкаДляПоиска <> ВложеннаяСсылка) Тогда
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(СсылкаДляПоиска.Метаданные().ПолноеИмя());
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("Ссылка", СсылкаДляПоиска);
			
			НачатьТранзакцию();
			Попытка
				
				Блокировка.Заблокировать();
				УдаляемыйОбъект = СсылкаДляПоиска.ПолучитьОбъект();
				УдаляемыйОбъект.Удалить();
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				ВызватьИсключение;
				
			КонецПопытки;
			
		ИначеЕсли ВложеннаяСсылка = Неопределено
			И ЗначениеЗаполнено(СсылкаДляПоиска) Тогда
			
			// Если разрешено оставить объект и поиском не нашли соответствие, то предварительная конвертация будет результатом
			ВложеннаяСсылка = СсылкаДляПоиска;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВложеннаяСсылка;
	
КонецФункции

Функция ОбъектнаяСсылкаПоВнешней(КомпонентыОбмена, ПравилоКонвертации, ВнешняяСсылкаСтрокой)
	
	ДанныеИБСсылка = Неопределено;
	
	Если ПустаяСтрока(ВнешняяСсылкаСтрокой)
		ИЛИ НЕ ПравилоКонвертации.ЭтоСсылочныйТип Тогда
		
		Возврат ДанныеИБСсылка;
		
	КонецЕсли;
	
	ДанныеИБСсылка = СсылкаПоПолученнымРаннееДанным(КомпонентыОбмена, ПравилоКонвертации, ВнешняяСсылкаСтрокой);
	Если ДанныеИБСсылка = Неопределено Тогда
		
		ДанныеИБСсылка = СсылкаИзТаблицыИБПоУникальномуИдентификатору(ПравилоКонвертации, ВнешняяСсылкаСтрокой);
		
	КонецЕсли;
	
	Возврат ДанныеИБСсылка;
	
КонецФункции

Функция ОпределитьТипСвойстваПоЗначениюСвойства(КомпонентыОбмена, ЗначениеСвойства, ПКС, ПравилоИзПКС)
	Перем ИмяПКО;
	
	ТипСвойства = "Простое";
	Если ТипЗнч(ЗначениеСвойства) = Тип("Структура") Тогда
		
		// Разработчик может создать предписание, конвертировать значение XDTO по правилу.
		// Для этого передаем структуру с полями ИмяПКО, Значение
		Если ЗначениеСвойства.Свойство("ИмяПКО")
			И ЗначениеСвойства.Свойство("Значение") Тогда
			
			ИмяПКО = ЗначениеСвойства.ИмяПКО;
			ЗначениеСвойства = ЗначениеСвойства.Значение;
			
		Иначе
			
			ИмяПКО = ПКС.ПравилоКонвертацииСвойства;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяПКО) Тогда
			
			ПравилоИзПКС = КомпонентыОбмена.ПравилаКонвертацииПредопределенныхДанных.Найти(ИмяПКО, "ИмяПКПД");
			Если ПравилоИзПКС <> Неопределено Тогда
				
				ТипСвойства = "ПКПД";
				
			Иначе
				
				
				ПравилоИзПКС = КонвертацияОбъектноРецепцияСервер.ПКОПоИмени(КомпонентыОбмена, ИмяПКО);
				ТипСвойства = "Сложное";
				
			КонецЕсли;
			
		Иначе
			
			ШаблонТекста = НСтр("ru = 'Ошибка конвертации свойства объекта XDTO:
				|- Не указано имя правила конвертации сложного свойства. 
				|Проверьте ПКС %1 в ПКО %2.'",ОбщегоНазначения.КодОсновногоЯзыка());
			
			ВызватьИсключение СтрШаблон(ШаблонТекста, ПКС.ИмяПКО, "");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТипСвойства
	
КонецФункции

Функция ПоляПоискаПоНаборуВариантаПоиска(ПравилоКонвертации, ПолученныеДанные, НаборВариантаПоиска)
	
	ПоляПоиска = Новый Структура(НаборВариантаПоиска);
	ЗаполнитьЗначенияСвойств(ПоляПоиска, ПолученныеДанные);
	
	// Вариант поиска является полноценным, если заполнены все ключевые поля.
	//
	// Исключение:
	// - справочники и планы видов характеристик. Тут допустимо незаполненное поле поиска "Родитель".
	ЭтоСправочникИлиПВХ = (ПравилоКонвертации.ЭтоСправочник Или ПравилоКонвертации.ЭтоПланВидовХарактеристик);
	
	ЕстьНезаполненныеПоля = Ложь;
	Для Каждого ПолеПоиска Из ПоляПоиска Цикл
		
		Если НЕ ЗначениеЗаполнено(ПолеПоиска.Значение) Тогда
			
			Если (ЭтоСправочникИлиПВХ
				И ПолеПоиска.Ключ = "Родитель") Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ЕстьНезаполненныеПоля = Истина;
			Прервать;
			
		ИначеЕсли ТипЗнч(ПолеПоиска.Значение) = Тип("Структура") Тогда
			
			ЕстьНезаполненныеПоля = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ?(ЕстьНезаполненныеПоля, Неопределено, ПоляПоиска);
	
КонецФункции

Функция ПравилоПредписываетСопоставлениеПоУникальномуИдентификатору(ПравилоКонвертации)
	
	ВариантИдентификации = СокрЛП(ПравилоКонвертации.ВариантИдентификации);
	Возврат (ВариантИдентификации = "ПоУникальномуИдентификатору") Или (ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска");
	
КонецФункции

Функция ПравилоПредписываетСопоставлениеПоКлючевымПолям(ПравилоКонвертации)
	
	ВариантИдентификации = СокрЛП(ПравилоКонвертации.ВариантИдентификации);
	Возврат (ВариантИдентификации = "ПоПолямПоиска") Или (ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска");
	
КонецФункции

Функция ПрерватьВыполнениеКонвертацииПоОшибке(КомпонентыОбмена, ПолученныеДанные)
	
	Если ПолученныеДанные = Неопределено Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, ПолученныеДанные, НазначениеТипаXML.Явное);
	ПолученныеДанныеJSON = ЗаписьJSON.Закрыть();
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПолученныеДанныеJSON = ПолученныеДанныеJSON;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПространствоИменСвойстваКонвертации(КомпонентыОбмена, ПКС)
	
	ПространствоИменПКС = "";
	Если НЕ ПустаяСтрока(ПКС.ПространствоИмен)
		И ФабрикаXDTO.Пакеты.Получить(ПКС.ПространствоИмен) <> Неопределено
		Тогда
		
		ПространствоИменПКС = ПКС.ПространствоИмен;
		
	Иначе
		
		ПространствоИменПКС = КомпонентыОбмена.XMLСхема;
		
	КонецЕсли;
	
	Возврат ПространствоИменПКС;
	
КонецФункции

Функция СопоставитьОбъектПоПолямПоискаИлиАлгоритмом(КомпонентыОбмена, ПравилоКонвертации, ПолученныеДанные, ВнешняяСсылкаСтрокой, НавигационнаяСсылка)
	
	ДанныеИБСсылка = Неопределено;
	Если НЕ ПравилоПредписываетСопоставлениеПоКлючевымПолям(ПравилоКонвертации)
		ИЛИ ПравилоКонвертации.ПоляПоиска = Неопределено
		ИЛИ ТипЗнч(ПравилоКонвертации.ПоляПоиска) <> Тип("Массив")
		Тогда
		
		Возврат ДанныеИБСсылка;
		
	КонецЕсли;
	
	Для Каждого НаборВариантаПоиска Из ПравилоКонвертации.ПоляПоиска Цикл
		
		ПоляПоиска = ПоляПоискаПоНаборуВариантаПоиска(ПравилоКонвертации, ПолученныеДанные, НаборВариантаПоиска);
		Если ПоляПоиска = Неопределено Тогда
			
			// Переход к следующему варианту поиска.
			Продолжить;
			
		КонецЕсли;
		
		//@skip-check query-in-loop
		ПоискПоПолямПоиска(КомпонентыОбмена, ПравилоКонвертации, ПоляПоиска, ВнешняяСсылкаСтрокой, ДанныеИБСсылка);
		Если ЗначениеЗаполнено(ДанныеИБСсылка) Тогда
			
			ДобавитьПубличныйИдентификатор(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБСсылка, ВнешняяСсылкаСтрокой, НавигационнаяСсылка);
			Прервать;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ДанныеИБСсылка;
	
КонецФункции

Функция СсылкаИзПодобранныхПубличныхИдентификаторов(КомпонентыОбмена, ПравилоКонвертации, ВнешняяСсылкаСтрокой)
	
	НайденнаяРаннееСсылка = Неопределено;
	Если НЕ КомпонентыОбмена.Свойство("ПодобранныеПубличныеИдентификаторы") Тогда
		
		Возврат НайденнаяРаннееСсылка;
		
	КонецЕсли;
	
	НайденнаяРаннееСсылка = КомпонентыОбмена.ПодобранныеПубличныеИдентификаторы[ВнешняяСсылкаСтрокой];
	Если НайденнаяРаннееСсылка <> Неопределено Тогда
		
		ТипОбъектаИБ = ПравилоКонвертации.ТипДанных;
		Если ТипЗнч(НайденнаяРаннееСсылка) <> ТипОбъектаИБ Тогда
			
			// Ситуация, когда в разных метаданных есть объекты, которые соответствуют
			// одному УИД возникает при конвертации одного объекта в два.
			// Например, приходная накладная конвертируется в ПТиУ и Акт.
			// В таких случае кэш не поможет, но считаем, 
			// что затраты на автоматизацию такого сценария не окупят работу с таблицей значений.
			НайденнаяРаннееСсылка = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НайденнаяРаннееСсылка;
	
КонецФункции

Функция СсылкаИзПубличныхИдентификаторов(КомпонентыОбмена, ПравилоКонвертации, ВнешняяСсылка)
	
	УзелКорреспондента = КомпонентыОбмена.УзелКорреспондента;
	Если Не ЗначениеЗаполнено(УзелКорреспондента) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	НайденнаяСсылка = Неопределено;
	ВремяНачала = ОбменДаннымиОценкаПроизводительности.НачатьЗамер();
	
	ОбъектФормата = ПравилоКонвертации.ОбъектФормата;
	НайденныеСсылки = КонвертацияОбъектноРецепцияСервер.СсылкаНаОбъектПоПубличномуИдентификатору(УзелКорреспондента, ВнешняяСсылка, ОбъектФормата);
	Если НайденныеСсылки = Неопределено
		ИЛИ НайденныеСсылки.Количество() < 1 Тогда
		
		Возврат НайденнаяСсылка;
		
	КонецЕсли;
	
	ДублиСопоставлений = Новый Массив; // Проблема: когда одной внешней ссылке соответствует 2 объекта в ИБ из одной таблицы метаданных.
	
	ТипОбъектаИБ = ПравилоКонвертации.ТипДанных;
	Для Каждого СсылкаИзРегистра Из НайденныеСсылки Цикл
		
		Если ТипЗнч(СсылкаИзРегистра) <> ТипОбъектаИБ Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НайденнаяСсылка = СсылкаИзРегистра;
		
		ДублиСопоставлений.Добавить(СсылкаИзРегистра);
		
	КонецЦикла;
	
	Если ДублиСопоставлений.Количество() > 1 Тогда
		
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьПредупреждениеДублейСопоставлений(КомпонентыОбмена, ДублиСопоставлений, ВнешняяСсылка);
		
	КонецЕсли;
	
	ТипСобытияБиблиотека = КонвертацияОбъектноРецепцияСервер.ТипСобытияБиблиотека();
	КонвертацияОбъектноРецепцияСервер.ЗавершитьЗамер(ВремяНачала, "ПоискСсылок", "", КомпонентыОбмена, ТипСобытияБиблиотека);
	
	Возврат НайденнаяСсылка;
	
КонецФункции

Функция СсылкаИзТаблицыИБПоУникальномуИдентификатору(ПравилоКонвертации, ВнешняяСсылкаСтрокой)
	
	Если НЕ СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ВнешняяСсылкаСтрокой) Тогда
		
		Возврат Неопределено; // Без уникального идентификатора подбор не возможен
		
	КонецЕсли;
	
	ВнешняяСсылка = Новый УникальныйИдентификатор(ВнешняяСсылкаСтрокой);
	
	ДанныеИБСсылка = ПравилоКонвертации.МенеджерОбъекта.ПолучитьСсылку(ВнешняяСсылка);
	Если ДанныеИБСсылка.ПолучитьОбъект() = Неопределено Тогда
		
		Возврат Неопределено; // Объект не найден
		
	КонецЕсли;
	
	Возврат ДанныеИБСсылка; // Объект подобран
	
КонецФункции

Функция СсылкаПоПолученнымРаннееДанным(КомпонентыОбмена, ПравилоКонвертации, ВнешняяСсылкаСтрокой)
	
	// Даже в случае, когда ПравилоПредписываетСопоставлениеПоУникальномуИдентификатору() = Ложь
	// необходимо искать по УИД, потому что раннее могли сопоставить по ключевым полям и запомнить входящий 
	// идентификатор в ПИСО.
	
	ДанныеИБСсылка = СсылкаИзПодобранныхПубличныхИдентификаторов(КомпонентыОбмена, ПравилоКонвертации, ВнешняяСсылкаСтрокой);
	Если ДанныеИБСсылка = Неопределено Тогда
		
		ДанныеИБСсылка = СсылкаИзПубличныхИдентификаторов(КомпонентыОбмена, ПравилоКонвертации, ВнешняяСсылкаСтрокой);
		
	КонецЕсли;
	
	Возврат ДанныеИБСсылка;
	
КонецФункции

Процедура ДобавитьДействияПриПолученииДанных(КомпонентыОбмена, ПравилоКонвертации)
	
	ИсторияПримененияТекущегоПКО = КомпонентыОбмена.ИсторияПримененияТекущегоПКО;
	
	ДействиеПриОбмене = ДействияПриПолученииДанныхОбменаДляОбъекта(КомпонентыОбмена, ПравилоКонвертации);
	Если ДействиеПриОбмене <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(ДействиеПриОбмене.СтратегияПоискаПоКлючам) Тогда
			
			ИсторияПримененияТекущегоПКО.СтратегияПоискаПоКлючам = ДействиеПриОбмене.СтратегияПоискаПоКлючам;
			
		КонецЕсли;
		
		Если КомпонентыОбмена.ПараметрыИнтерактивнойКонвертации.ПодтверждениеЗагрузкиВыполнено Тогда
			
			// Если конвертация запущена по интерактивному действию, где пользователь уже подтвердил загрузку,
			// то настройки подтверждения и установки соответствий игнорируем
			ИсторияПримененияТекущегоПКО.ЗагрузкаДанныхТребуетПодтверждения = Ложь;
			
			ИсторияПримененияТекущегоПКО.ЕслиНетСоответствияСоздаватьНовый = Истина;
			ИсторияПримененияТекущегоПКО.ЕслиНетСоответствияИскатьПоКлючам = Ложь;
			ИсторияПримененияТекущегоПКО.ЕслиНетСоответствияУстанавливатьВручную = Ложь;
			
		Иначе
			
			ПеречислениеКакЗагружать = Перечисления.ВариантыДействийПриПолученииДанныхОбмена;
			ИсторияПримененияТекущегоПКО.ЗагрузкаДанныхТребуетПодтверждения = (ДействиеПриОбмене.КакЗагружать = ПеречислениеКакЗагружать.ПослеПодтверждения);
			
			// ДействиеПриОбмене.УстанавливатьСоответствия
			ПеречислениеСоответствий = Перечисления.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных;
			ИсторияПримененияТекущегоПКО.ЕслиНетСоответствияСоздаватьНовый = (ДействиеПриОбмене.УстанавливатьСоответствия = ПеречислениеСоответствий.НеУстанавливать);
			ИсторияПримененияТекущегоПКО.ЕслиНетСоответствияИскатьПоКлючам = (ДействиеПриОбмене.УстанавливатьСоответствия = ПеречислениеСоответствий.Автоматически);
			ИсторияПримененияТекущегоПКО.ЕслиНетСоответствияУстанавливатьВручную = (ДействиеПриОбмене.УстанавливатьСоответствия = ПеречислениеСоответствий.Помощником);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Разрешить ухудшать состояние загружаемого объекта может:
	// - разработчик правила конвертации;
	// - пользователь (интерактивно).
	// Под ухудшением понимаем отказ от проведения документов или загрузку данных в режиме "ОбменДанными.Загрузка = Истина".
	Если ПравилоКонвертации.ИгнорироватьПроблемыПриЗаписи = Истина
		ИЛИ КомпонентыОбмена.ПараметрыИнтерактивнойКонвертации.ИгнорироватьПроблемыПриЗаписи = Истина Тогда
		
		ИсторияПримененияТекущегоПКО.ИгнорироватьПроблемыПриЗаписи = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьЗаписьОтсутствующихСвойств(ПолученныеДанные, ИмяСвойстваФормата)
	
	ИмяСвойства = "СвойстваОтсутствующиеВПолученныхДанных";
	
	Если ПолученныеДанные.ДополнительныеСвойства.Свойство(ИмяСвойства) Тогда
		
		ПолученныеДанные.ДополнительныеСвойства[ИмяСвойства] = ПолученныеДанные.ДополнительныеСвойства[ИмяСвойства] + "," + ИмяСвойстваФормата;
		
	Иначе
		
		ПолученныеДанные.ДополнительныеСвойства.Вставить(ИмяСвойства, ИмяСвойстваФормата);
		
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьСвойствоИсключенноеИзКонвертации(КомпонентыОбмена, ИмяСвойстваФормата, ИмяТЧ = "")
	
	КлючЭлемента = ИмяТЧ; // В ключе будет имя табличной части или предопределенное слово "Шапка"
	Если ПустаяСтрока(КлючЭлемента) Тогда
		
		КлючЭлемента = КонвертацияОбъектноРезультатыСлужебный.КлючЭлементаСоответствияСвойствШапки();
		
	КонецЕсли;
	
	СвойстваИсключенныеИзКонвертации = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.СвойстваИсключенныеИзКонвертации;
	Если СвойстваИсключенныеИзКонвертации.Получить(КлючЭлемента) = Неопределено Тогда
		
		СвойстваИсключенныеИзКонвертации[КлючЭлемента] = "";
		
	КонецЕсли;
	
	СвойстваИсключенныеИзКонвертации[КлючЭлемента] = СвойстваИсключенныеИзКонвертации[КлючЭлемента] + ИмяСвойстваФормата + ",";
	
КонецПроцедуры

Процедура ДобавитьПоляПоискаВВыбранныеИИндексСхемыЗапроса(ПравилоКонвертации, ПоляПоиска, СхемаЗапроса, НомерКолонки)
	
	ЗапросНесопоставленных = СхемаЗапроса.ПакетЗапросов[0];
	ОператорЗапроса = ЗапросНесопоставленных.Операторы[0];
	
	Для Каждого ПолеПоиска Из ПоляПоиска Цикл
		
		НомерКолонки = НомерКолонки + 1;
		Если КонвертацияОбъектноРецепцияСервер.ЭтоСтроковыйРеквизитНеограниченнойДлины(ПравилоКонвертации.ПолноеИмя, ПолеПоиска.Ключ) Тогда
			
			ПолеСтрокой = "ВЫРАЗИТЬ(ТаблицаНесопоставленных.[Ключ] КАК СТРОКА([ДлинаСтроки]))";
			ПолеСтрокой = СтрЗаменить(ПолеСтрокой, "[Ключ]", ПолеПоиска.Ключ);
			ПолеСтрокой = СтрЗаменить(ПолеСтрокой, "[ДлинаСтроки]", Формат(СтрДлина(ПолеПоиска.Значение), "ЧГ=0"));
			ОператорЗапроса.ВыбираемыеПоля.Добавить(ПолеСтрокой, НомерКолонки);
			
		Иначе
			
			ПолеСтрокой = СтрЗаменить("ТаблицаНесопоставленных.[Ключ]", "[Ключ]", ПолеПоиска.Ключ);
			ОператорЗапроса.ВыбираемыеПоля.Добавить(ПолеСтрокой, НомерКолонки);
			
		КонецЕсли;
		
		ЗапросНесопоставленных.Колонки[НомерКолонки].Псевдоним = ПолеПоиска.Ключ;
		ЗапросНесопоставленных.Индекс.Добавить(ПолеПоиска.Ключ);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьПоляПоискаВОтборЗапроса(ПравилоКонвертации, ПоляПоиска, Запрос, Отбор)
	
	Для Каждого ПолеПоиска Из ПоляПоиска Цикл
		
		Если КонвертацияОбъектноРецепцияСервер.ЭтоСтроковыйРеквизитНеограниченнойДлины(ПравилоКонвертации.ПолноеИмя, ПолеПоиска.Ключ) Тогда
			
			ОтборСтрокой = "ВЫРАЗИТЬ(Таблица.[Ключ] КАК СТРОКА([ДлинаСтроки])) = &[Ключ]";
			ОтборСтрокой = СтрЗаменить(ОтборСтрокой, "[Ключ]", ПолеПоиска.Ключ);
			ОтборСтрокой = СтрЗаменить(ОтборСтрокой, "[ДлинаСтроки]", Формат(СтрДлина(ПолеПоиска.Значение), "ЧГ=0"));
			Отбор.Добавить(ОтборСтрокой);
			
		Иначе
			
			Отбор.Добавить(СтрЗаменить("Таблица.[Ключ] = &[Ключ]", "[Ключ]", ПолеПоиска.Ключ));
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр(ПолеПоиска.Ключ, ПолеПоиска.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьПубличныйИдентификатор(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБСсылка, ВнешняяСсылкаСтрокой, НавигационнаяСсылка)
	
	УзелОбмена = КомпонентыОбмена.УзелКорреспондента;
	Если НЕ ЗначениеЗаполнено(УзелОбмена)
		ИЛИ НЕ ЗначениеЗаполнено(ДанныеИБСсылка) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПубличныйИдентификатор = СокрЛП(ВнешняяСсылкаСтрокой);
	Если ПустаяСтрока(ПубличныйИдентификатор) Тогда
		
		ПубличныйИдентификатор = СокрЛП(ДанныеИБСсылка.УникальныйИдентификатор());
		
	КонецЕсли;
	
	Если ПустаяСтрока(ПубличныйИдентификатор) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("УзелИнформационнойБазы", УзелОбмена);
	СтруктураЗаписи.Вставить("Ссылка", ДанныеИБСсылка);
	СтруктураЗаписи.Вставить("Идентификатор", ПубличныйИдентификатор);
	СтруктураЗаписи.Вставить("ОбъектФормата", ПравилоКонвертации.ОбъектФормата);
	СтруктураЗаписи.Вставить("СсылкаВнешняяНавигационная", НавигационнаяСсылка);
	
	// Когда команда конвертации запущена интерактивно, из карточки проблемы
	// все проверки связанные с появлением сопоставления будут выполнены пакетно (отложено)
	// По этому отключаем логику проверки при добавлении записи.
	ДополнительныеСвойства = Новый Структура;
	Если КомпонентыОбмена.Свойство("ПараметрыИнтерактивнойКонвертации")
		И КомпонентыОбмена.ПараметрыИнтерактивнойКонвертации.НеПроверятьОсвободившиесяОбъектыПриЗаписиВПИСО = Истина
		Тогда
		
		ДополнительныеСвойства.Вставить("НеОпределятьИзменениеОбъектыБлокирующиеЗагрузку", Истина);
		
	КонецЕсли;
	
	Если КомпонентыОбмена.Свойство("КлючОбрабатывающегоЗадания") 
		И Не ПустаяСтрока(КомпонентыОбмена.КлючОбрабатывающегоЗадания) Тогда
		
		ДополнительныеСвойства.Вставить("КлючОбрабатывающегоЗадания", КомпонентыОбмена.КлючОбрабатывающегоЗадания);
		
	КонецЕсли;
	
	КонвертацияОбъектноРецепцияСервер.ДобавитьЗаписьПИСО(СтруктураЗаписи, Истина, ДополнительныеСвойства);
	ЗапомнитьПодобранныйПубличныйИдентификатор(КомпонентыОбмена, ПубличныйИдентификатор, ДанныеИБСсылка);
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ДобавленоНовоеСоответствиеПИСО = Истина;
	
КонецПроцедуры

Процедура ДобавитьСсылкуБлокирующуюКонвертацию(КомпонентыОбмена, ПКС, ПравилоКонвертации, БлокирующийИдентификатор, НавигационнаяСсылка)
	
	// Защиты от ссылки на самого себя
	Если КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ВнешняяСсылкаСтрокой = БлокирующийИдентификатор Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// Заполним СсылкиБлокирующиеКонвертацию
	СсылкаБлокирующая = КонвертацияОбъектноСервер.КонструкторСсылкаБлокирующаяКонвертацию();
	СсылкаБлокирующая.БлокирующийИдентификатор = БлокирующийИдентификатор;
	СсылкаБлокирующая.ИмяРеквизита = ПКС.СвойствоКонфигурации;
	СсылкаБлокирующая.ПространствоИменОбъектаФормата = ПространствоИменСвойстваКонвертации(КомпонентыОбмена, ПКС);
	СсылкаБлокирующая.ВнешняяНавигационнаяСсылка = НавигационнаяСсылка;
	
	Если ПравилоКонвертации <> Неопределено Тогда
		
		СсылкаБлокирующая.ОписаниеТипа = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПравилоКонвертации.ОбъектДанных, Ложь);
		СсылкаБлокирующая.ОбъектФормата = ПравилоКонвертации.ОбъектФормата;
		СсылкаБлокирующая.ПравилоКонвертации = ПравилоКонвертации.ИмяПКО;
		
	КонецЕсли;
	
	КонвертацияОбъектноСервер.ДобавитьБлокирующуюСсылку(КомпонентыОбмена, СсылкаБлокирующая, Ложь);
	
КонецПроцедуры

Процедура ДобавитьУспешнуюКонвертацию(КомпонентыОбмена, ИмяСвойстваКонфигурации, ИмяТЧ = "")
	
	КлючЭлемента = ИмяТЧ; // В ключе будет имя табличной части или предопределенное слово "Шапка"
	Если ПустаяСтрока(КлючЭлемента) Тогда
		
		КлючЭлемента = КонвертацияОбъектноРезультатыСлужебный.КлючЭлементаСоответствияСвойствШапки();
		
	КонецЕсли;
	
	СвойстваУспешнойКонвертации = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.СвойстваУспешнойКонвертации;
	Если СвойстваУспешнойКонвертации.Получить(КлючЭлемента) = Неопределено Тогда
		
		СвойстваУспешнойКонвертации[КлючЭлемента] = "";
		
	КонецЕсли;
	
	СвойстваУспешнойКонвертации[КлючЭлемента] = СвойстваУспешнойКонвертации[КлючЭлемента] + ИмяСвойстваКонфигурации + ",";
	
КонецПроцедуры

Процедура ЗаполнитьДанныеИБПоПолученнымДанным(КомпонентыОбмена, ПравилоКонвертации, ПолученныеДанные, ДанныеИБ)
	
	Если ПолученныеДанные = Неопределено Тогда
		
		// Нет источника для копирования значений,
		// т.к. разработчик правил отказался от переноса полученных свойств
		Возврат;
		
	КонецЕсли;
	
	Если ДанныеИБ = Неопределено Тогда
		
		// Если данных в ИБ нет (соответствие не найдено),
		// то контейнер конвертации ПолученныеДанные и есть ДанныеИБ
		ДанныеИБ = ПолученныеДанные;
		Возврат;
		
	КонецЕсли;
	
	ПеренестиПоляШапки(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБ, ПолученныеДанные);
	ПеренестиПоляТабличныхЧастей(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБ, ПолученныеДанные);
	
КонецПроцедуры

Процедура ЗапомнитьПодобранныйПубличныйИдентификатор(КомпонентыОбмена, ПубличныйИдентификатор, ДанныеИБСсылка)
	
	Если НЕ КомпонентыОбмена.Свойство("ПодобранныеПубличныеИдентификаторы") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	КомпонентыОбмена.ПодобранныеПубличныеИдентификаторы.Вставить(СокрЛП(ПубличныйИдентификатор), ДанныеИБСсылка);
	
КонецПроцедуры

Процедура ЗначениеСвойстваВПолученныеДанные(КомпонентыОбмена, ПКС, ЗначениеСвойства, ПолученныеДанные, ИмяТЧ, НомерЭтапа)
	Перем ПравилоИзПКС;
	
	ТипСвойства = ОпределитьТипСвойстваПоЗначениюСвойства(КомпонентыОбмена, ЗначениеСвойства, ПКС, ПравилоИзПКС);
	
	Если ТипСвойства = "ПКПД" Тогда
		
		ЗначениеСвойстваПКПДВРеквизитОбъекта(ЗначениеСвойства, ПравилоИзПКС, ПКС.СвойствоКонфигурации, ПолученныеДанные);
		ДобавитьУспешнуюКонвертацию(КомпонентыОбмена, ПКС.СвойствоКонфигурации, ИмяТЧ);
		
	ИначеЕсли ТипСвойства = "Сложное" Тогда
		
		// Передаем "КомпонентыОбмена" потому, что конвертация продолжится рекурсивно
		ЗначениеСложногоСвойстваВРеквизитОбъекта(КомпонентыОбмена, ЗначениеСвойства, ПКС, ПравилоИзПКС, ПолученныеДанные, ИмяТЧ, НомерЭтапа);
		
	Иначе
		
		ЗначениеПростогоСвойстваВРеквизитОбъекта(ЗначениеСвойства, ПКС.СвойствоКонфигурации, ПолученныеДанные);
		ДобавитьУспешнуюКонвертацию(КомпонентыОбмена, ПКС.СвойствоКонфигурации, ИмяТЧ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗначениеПростогоСвойстваВРеквизитОбъекта(ЗначениеСвойства, ИмяСвойстваКонфигурации, ПолученныеДанные)
	
	// Конвертацию простых свойств выполняем только на 1-м этапе.
	ПолученныеДанные[ИмяСвойстваКонфигурации] = ЗначениеСвойства;
	
КонецПроцедуры

Процедура ЗначениеСложногоСвойстваВРеквизитОбъекта(КомпонентыОбмена, ЗначениеСвойства, ПКС, ПКОИзПКС, ПолученныеДанные, ИмяТЧ, НомерЭтапа)
	
	Если Не ЗначениеЗаполнено(ПКОИзПКС) Тогда
		
		// Конвертация сложного свойства без правила не поддерживается
		ДобавитьСвойствоИсключенноеИзКонвертации(КомпонентыОбмена, ПКС.СвойствоКонфигурации, ИмяТЧ);
		Возврат;
		
	КонецЕсли;
	
	ВнешняяСсылкаСтрокой = ВнешняяСсылкаИзДанныхXDTO(ПКОИзПКС, ЗначениеСвойства);
	НавигационнаяСсылка = ВнешняяНавигационнаяСсылкаИзДанныхXDTO(ПКОИзПКС, ЗначениеСвойства);
	ВложеннаяСсылка = ОбъектнаяСсылкаПоВнешней(КомпонентыОбмена, ПКОИзПКС, ВнешняяСсылкаСтрокой);
	
	// Если ссылка не найдена (ВложеннаяСсылка = Неопределено) и правило ориентируется на ключевые поля.
	Если ВложеннаяСсылка = Неопределено
		И ПравилоПредписываетСопоставлениеПоКлючевымПолям(ПКОИзПКС) Тогда
		
		Если ПустаяСтрока(ВнешняяСсылкаСтрокой)
			И ПустаяСтрока(НавигационнаяСсылка) Тогда
			
			ВложеннаяСсылка = ЗначениеСложногоСвойстваБезУникальногоИдентификатора(КомпонентыОбмена, ПКС, ПКОИзПКС, ЗначениеСвойства);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Редкий случай, когда объект ссылается на такой же УИД, возможно, на самого себя.
	// Помним, что одинаковые УИД могут быть в разных таблицах МД и это допустимо...
	Если ВложеннаяСсылка = Неопределено 
		И КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ВнешняяСсылкаСтрокой = ВнешняяСсылкаСтрокой
		И ЗначениеЗаполнено(ПКС.ПравилоКонвертацииСвойства)
		Тогда
		
		// В ПКС нет типа объекта, нужен ПКО, чтобы убедиться, что совпадают типы.
		// Если тип метаданных совпадают, то вложенное свойство ссылается конвертируемый объект
		ПКОПоИмениПКС = КонвертацияОбъектноРецепцияСервер.ПКОПоИмени(КомпонентыОбмена, ПКС.ПравилоКонвертацииСвойства);
		Если ПКОИзПКС.ОбъектДанных = ПКОПоИмениПКС.ОбъектДанных Тогда
			
			ИдентификаторСсылки = Новый УникальныйИдентификатор(ВнешняяСсылкаСтрокой);
			ВложеннаяСсылка = ПКОИзПКС.МенеджерОбъекта.ПолучитьСсылку(ИдентификаторСсылки);
			ПолученныеДанные.УстановитьСсылкуНового(ВложеннаяСсылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Если после поиска не нашли соответствие в текущей ИБ
	Если ВложеннаяСсылка = Неопределено Тогда
		
		ДобавитьСвойствоИсключенноеИзКонвертации(КомпонентыОбмена, ПКС.СвойствоКонфигурации, ИмяТЧ);
		
		Если НЕ ПустаяСтрока(ВнешняяСсылкаСтрокой) Тогда
			
			// Нет соответствия, запомнил идентификатор как проблемный и добавим связь после конвертации
			// Процесс не прерываем, чтобы определить все проблемные места
			ДобавитьСсылкуБлокирующуюКонвертацию(КомпонентыОбмена, ПКС, ПКОИзПКС, ВнешняяСсылкаСтрокой, НавигационнаяСсылка);
			
		КонецЕсли;
		
	Иначе
		
		ПолученныеДанные[ПКС.СвойствоКонфигурации] = ВложеннаяСсылка.Ссылка;
		ЗапомнитьПодобранныйПубличныйИдентификатор(КомпонентыОбмена, ВнешняяСсылкаСтрокой, ВложеннаяСсылка);
		ДобавитьУспешнуюКонвертацию(КомпонентыОбмена, ПКС.СвойствоКонфигурации, ИмяТЧ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗначениеСвойстваПКПДВРеквизитОбъекта(ЗначениеКонвертации, ПравилоИзПКС, СвойствоКонфигурации_Имя, ПолученныеДанные)
	
	Если Не ЗначениеЗаполнено(ПравилоИзПКС) Тогда
		
		// Конвертация предопределенного свойства без правила не поддерживается
		Возврат;
		
	КонецЕсли;
	
	Значение = ПравилоИзПКС.КонвертацииЗначенийПриПолучении.Получить(ЗначениеКонвертации.Значение);
	ПолученныеДанные[СвойствоКонфигурации_Имя] = Значение;
	
КонецПроцедуры

Процедура ИсключитьСопоставленныеРаннее(КомпонентыОбмена, ВнешняяСсылкаСтрокой, Запрос, УсловиеОтбора)
	
	// Ситуация, когда у нас есть соответствие, но нет объекта похожа на ошибку
	УзелОбмена = КомпонентыОбмена.УзелКорреспондента;
	Если НЕ ЗначениеЗаполнено(УзелОбмена) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекстСоединения = "
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторы
	|	ПО ПубличныеИдентификаторы.Ссылка = Таблица.Ссылка
	|		И ПубличныеИдентификаторы.УзелИнформационнойБазы = &УзелОбмена";
	
	// Из поиска необходимо исключить уже сопоставленные ранее объекты.
	Если НЕ ПустаяСтрока(ВнешняяСсылкаСтрокой) Тогда
		
		ТекстСоединения = ТекстСоединения + "
		|		И ПубличныеИдентификаторы.Идентификатор <> &ВнешняяСсылкаСтрокой";
		
		Запрос.УстановитьПараметр("ВнешняяСсылкаСтрокой", ВнешняяСсылкаСтрокой);
		
	КонецЕсли;
	
	УсловиеОтбора = УсловиеОтбора + Символы.ПС + "	И ПубличныеИдентификаторы.Ссылка is null";
	Запрос.Текст = СтрЗаменить(Запрос.Текст,  "ГДЕ", ТекстСоединения + Символы.ПС + "	ГДЕ");
	
	Запрос.УстановитьПараметр("УзелОбмена", УзелОбмена);
	
КонецПроцедуры

Процедура КонвертацияМножественногоСвойстваСтруктурыОбъектаXDTOДоАлгоритмов(КомпонентыОбмена, ТабличнаяЧастьПКО, ДанныеXDTO, ПолученныеДанные, НомерЭтапа)
	
	ТаблицаИзСтруктурыXDTO = Неопределено; // ТаблицаЗначений
	
	Если НЕ ДанныеXDTO.Свойство(ТабличнаяЧастьПКО.ТЧФормата, ТаблицаИзСтруктурыXDTO)
		ИЛИ ТаблицаИзСтруктурыXDTO.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ИменаКолонокСтрокой = "";
	Для Каждого Колонка Из ТаблицаИзСтруктурыXDTO.Колонки Цикл
		
		ИменаКолонокСтрокой = ИменаКолонокСтрокой + Колонка.Имя + ",";
		
	КонецЦикла;
	
	Для НомерСтроки = 1 По ТаблицаИзСтруктурыXDTO.Количество() Цикл
		
		СтруктураДанныхСтрокиXDTO = Новый Структура(ИменаКолонокСтрокой); // Последняя запятая не помеха
		ДанныеСтрокиXDTO = ТаблицаИзСтруктурыXDTO[НомерСтроки - 1];
		ЗаполнитьЗначенияСвойств(СтруктураДанныхСтрокиXDTO, ДанныеСтрокиXDTO);
		
		СтрокаТЧ = ПолученныеДанные[ТабличнаяЧастьПКО.ТЧКонфигурации].Добавить(); // Результат конвертации сразу в строку объекта ИБ
		Для Каждого ПКС Из ТабличнаяЧастьПКО.Свойства Цикл
			
			Если ПКС.ИспользуетсяАлгоритмКонвертации Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			КонвертацияСвойствСтруктурыОбъектаXDTOДоАлгоритмов(КомпонентыОбмена, ПКС, СтруктураДанныхСтрокиXDTO, СтрокаТЧ, ТабличнаяЧастьПКО.ТЧКонфигурации, НомерЭтапа);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура КонвертацияМножественногоСвойстваСтруктурыОбъектаXDTOПослеАлгоритмов(КомпонентыОбмена, ТабличнаяЧастьПКО, ДанныеXDTO, ПолученныеДанные, НомерЭтапа)
	
	ИмяТабличнойЧасти = ТабличнаяЧастьПКО.ТЧКонфигурации;
	
	МассивСтруктурСДаннымиСтрок = ПолученныеДанные.ДополнительныеСвойства[ИмяТабличнойЧасти]; // Массив
	КоличествоСтрокТЧКонфигурации = ПолученныеДанные[ИмяТабличнойЧасти].Количество();
	
	Для НомерСтроки = 0 По МассивСтруктурСДаннымиСтрок.ВГраница() Цикл
		
		// Определим строку-приемник
		Если НомерСтроки <= (КоличествоСтрокТЧКонфигурации - 1) Тогда
			
			// Строка с таким номером есть.
			// Возможно, добавлена конвертацией до алгоритма или данные загружаются в существующий документ.
			СтрокаТЧ = ПолученныеДанные[ИмяТабличнойЧасти][НомерСтроки];
			
		Иначе
			
			// Строка с таким номером отсутствует.
			СтрокаТЧ = ПолученныеДанные[ИмяТабличнойЧасти].Добавить();
			
		КонецЕсли;
		
		ИсточникДанных = МассивСтруктурСДаннымиСтрок[НомерСтроки];
		
		Для Каждого ПКС Из ТабличнаяЧастьПКО.Свойства Цикл // обход полей строки табличной части
			
			КонвертацияСвойстваТабличнойЧастиСтруктурыОбъектаXDTOПослеАлгоритмов(КомпонентыОбмена, ПКС, ИсточникДанных, СтрокаТЧ, ИмяТабличнойЧасти, НомерЭтапа);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура КонвертацияСвойствСтруктурыОбъектаXDTOДоАлгоритмов(КомпонентыОбмена, ПКС, ДанныеXDTO, ПолученныеДанные, ИмяТЧ, НомерЭтапа)
	
	// Обрабатывается ПКС где указано только свойство формата - оно используется только при выгрузке.
	Если СокрЛП(ПКС.СвойствоКонфигурации) = "" 
		ИЛИ НЕ ЗначениеЗаполнено(ПКС.СвойствоФормата) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ИмяСвойстваФормата = СокрЛП(ПКС.СвойствоФормата);
	
	Попытка
		
		Если ПКС.ОбработкаКлючевогоСвойства И Не ДанныеXDTO.Свойство("ЭтоНаборКлючевыхСвойств") Тогда
			
			ИсточникДанных = ДанныеXDTO[ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства()];
			
		Иначе
			
			ИсточникДанных = ДанныеXDTO;
			
		КонецЕсли;
		
		ЗначениеСвойства = ЗначениеСвойстваДляКонвертации(ИсточникДанных, ПКС, ИмяСвойстваФормата, ПолученныеДанные);
		Если Не ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			
			ДобавитьСвойствоИсключенноеИзКонвертации(КомпонентыОбмена, ИмяСвойстваФормата, ИмяТЧ);
			Возврат; // Если нет значения, уходим
			
		КонецЕсли;
		
		ЗначениеСвойстваВПолученныеДанные(КомпонентыОбмена, ПКС, ЗначениеСвойства, ПолученныеДанные, ИмяТЧ, НомерЭтапа);
		
	Исключение
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьОшибкуИсполненияПКС(КомпонентыОбмена, ПКС, ТекстОшибки);
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура КонвертацияСвойстваСтруктурыОбъектаXDTOПослеАлгоритмов(КомпонентыОбмена, ПКС, ДанныеXDTO, ПолученныеДанные, НомерЭтапа)
	Перем ЗначениеСвойства;
	
	// Обрабатывается ПКС где указано только свойство формата - оно используется только при выгрузке.
	Если СокрЛП(ПКС.СвойствоКонфигурации) = "" 
		ИЛИ НЕ ПКС.ИспользуетсяАлгоритмКонвертации Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Попытка
		
		// На 2-м этапе значения свойств получаются из дополнительных свойств ПолученныеДанные.
		// Представляют из себя структуру, содержащую инструкцию для конвертации, либо значение XDTO.
		ИсточникДанных = ПолученныеДанные.ДополнительныеСвойства;
		Если НЕ ИсточникДанных.Свойство(ПКС.СвойствоКонфигурации, ЗначениеСвойства)
			ИЛИ НЕ ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ЗначениеСвойстваВПолученныеДанные(КомпонентыОбмена, ПКС, ЗначениеСвойства, ПолученныеДанные, "", НомерЭтапа);
		
	Исключение
		
		ШаблонТекста = НСтр("ru = 'Ошибка конвертации свойства объекта XDTO, имя свойства: <%1>.
							|
							|%2.'", ОбщегоНазначения.КодОсновногоЯзыка());
		
		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ТекстОшибки = СтрШаблон(ШаблонТекста, ПКС.СвойствоКонфигурации, ПредставлениеОшибки);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура КонвертацияСвойстваТабличнойЧастиСтруктурыОбъектаXDTOПослеАлгоритмов(КомпонентыОбмена, ПКС, ИсточникДанных, ПолученныеДанные, ИмяТЧ, НомерЭтапа)
	
	// Обрабатывается ПКС, где указано только свойство формата - оно используется только при выгрузке.
	Если СокрЛП(ПКС.СвойствоКонфигурации) = ""
		ИЛИ НЕ ПКС.ИспользуетсяАлгоритмКонвертации Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Попытка
		
		ЗначениеСвойства = Неопределено;
		Если НЕ ИсточникДанных.Свойство(ПКС.СвойствоКонфигурации, ЗначениеСвойства) // Свойства нет
			ИЛИ НЕ ЗначениеЗаполнено(ЗначениеСвойства) Тогда						// или оно пустое
			
			ДобавитьСвойствоИсключенноеИзКонвертации(КомпонентыОбмена, ПКС.СвойствоКонфигурации, ИмяТЧ);
			Возврат;
			
		КонецЕсли;
		
		ЗначениеСвойстваВПолученныеДанные(КомпонентыОбмена, ПКС, ЗначениеСвойства, ПолученныеДанные, ИмяТЧ, НомерЭтапа);
		
	Исключение
		
		ШаблонТекста = НСтр("ru = 'Ошибка конвертации свойства табличной части %1, колонка: <%2>.
							|
							|%3.'", ОбщегоНазначения.КодОсновногоЯзыка());
		
		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ТекстОшибки = СтрШаблон(ШаблонТекста, ИмяТЧ, ПКС.СвойствоКонфигурации, ПредставлениеОшибки);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура КонвертацияОсновныхСвойств(КомпонентыОбмена, ПравилоКонвертации, ДанныеXDTO, ПолученныеДанные, НомерЭтапа)
	
	Для Каждого ПКС Из ПравилоКонвертации.Свойства Цикл
		
		Если НомерЭтапа = 1 
			И НЕ ПКС.ИспользуетсяАлгоритмКонвертации Тогда
			
			КонвертацияСвойствСтруктурыОбъектаXDTOДоАлгоритмов(КомпонентыОбмена, ПКС, ДанныеXDTO, ПолученныеДанные, "", НомерЭтапа);
		КонецЕсли;
		
		Если НомерЭтапа = 2
			И ПКС.ИспользуетсяАлгоритмКонвертации Тогда
			
			КонвертацияСвойстваСтруктурыОбъектаXDTOПослеАлгоритмов(КомпонентыОбмена, ПКС, ДанныеXDTO, ПолученныеДанные, НомерЭтапа);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура КонвертацияМножественныхСвойств(КомпонентыОбмена, ПравилоКонвертации, ДанныеXDTO, ПолученныеДанные, НомерЭтапа)
	
	Для Каждого ТабличнаяЧастьПКО Из ПравилоКонвертации.СвойстваТабличныхЧастей Цикл
		
		Если НомерЭтапа = 1
			И ЗначениеЗаполнено(ТабличнаяЧастьПКО.ТЧКонфигурации) // Есть приемник
			И ЗначениеЗаполнено(ТабличнаяЧастьПКО.ТЧФормата)      // Есть источник
			Тогда
			
			КонвертацияМножественногоСвойстваСтруктурыОбъектаXDTOДоАлгоритмов(КомпонентыОбмена, ТабличнаяЧастьПКО, ДанныеXDTO, ПолученныеДанные, НомерЭтапа);
			
		КонецЕсли;
		
		Если НомерЭтапа = 2 
			И ТабличнаяЧастьПКО.ИспользуетсяАлгоритмКонвертации
			И ЗначениеЗаполнено(ТабличнаяЧастьПКО.ТЧКонфигурации)                                // Есть приемник
			И ПолученныеДанные.ДополнительныеСвойства.Свойство(ТабличнаяЧастьПКО.ТЧКонфигурации) // Есть источник
			Тогда
			
			КонвертацияМножественногоСвойстваСтруктурыОбъектаXDTOПослеАлгоритмов(КомпонентыОбмена, ТабличнаяЧастьПКО, ДанныеXDTO, ПолученныеДанные, НомерЭтапа);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура КонвертацияСвойствСтруктурыОбъектаXDTO(КомпонентыОбмена, ДанныеXDTO, ПолученныеДанные)
	
	ПравилоКонвертации = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПравилоКонвертации;
	
	Попытка
		
		// Конвертация свойств (Маппинг)
		НомерЭтапа = 1;
		ОписаниеЭтапа = НСтр("ru ='(этап <До алгоритма ПриКонвертацииДанныхXDTO>)'", ОбщегоНазначения.КодОсновногоЯзыка());
		КонвертацияОсновныхСвойств(КомпонентыОбмена, ПравилоКонвертации, ДанныеXDTO, ПолученныеДанные, НомерЭтапа);
		КонвертацияМножественныхСвойств(КомпонентыОбмена, ПравилоКонвертации, ДанныеXDTO, ПолученныеДанные, НомерЭтапа);
		
		// Обработчик события "ПриКонвертацииДанныхXDTO".
		// В этом обработчике, по мимо прочего, можно определить пользовательские инструкции конвертации данных.
		// Например, положить в "ДополнительныеСвойства" конвертируемого объекта (ПолученныеДанные) структуру,
		// где Ключ это имя конвертируемого свойства, а значение это вложенная структура с именем ПКО
		// и данными конвертации (ДанныеXDTO):
		//		ВладелецXDTO = ДанныеXDTO.КлючевыеСвойства.Владелец;
		//		ИнструкцияКонвертации = Новый Структура("ИмяПКО, Значение", "Справочник_Контрагенты", ВладелецXDTO);
		//		ПолученныеДанные.ДополнительныеСвойства.Вставить("Владелец", ИнструкцияКонвертации);
		ОписаниеЭтапа = НСтр("ru ='(этап <ПриКонвертацииДанныхXDTO>)'", ОбщегоНазначения.КодОсновногоЯзыка());
		КонвертацияОбъектноСобытияКД.ПриКонвертацииДанныхXDTO(КомпонентыОбмена, ПравилоКонвертации, ДанныеXDTO, ПолученныеДанные);
		
		// Конвертация свойств (после алгоритма)
		НомерЭтапа = 2;
		ОписаниеЭтапа = НСтр("ru ='(этап <После алгоритма ПриКонвертацииДанныхXDTO>)'", ОбщегоНазначения.КодОсновногоЯзыка());
		КонвертацияОсновныхСвойств(КомпонентыОбмена, ПравилоКонвертации, ДанныеXDTO, ПолученныеДанные, НомерЭтапа);
		КонвертацияМножественныхСвойств(КомпонентыОбмена, ПравилоКонвертации, ДанныеXDTO, ПолученныеДанные, НомерЭтапа);
		
	Исключение
		
		ПредставлениеОбъекта = КонвертацияОбъектноРецепцияСервер.ПредставлениеОбъектаДляПротокола(ПолученныеДанные);
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьОшибкуКонвертацииСтруктурыОбъектаПоПКО(КомпонентыОбмена, ОписаниеЭтапа, ПредставлениеОбъекта, ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура НачальныеДанныеКонвертацииОбъекта(КомпонентыОбмена, ПравилоКонвертации, ДанныеXDTO)
	
	ВнешняяСсылкаСтрокой = ВнешняяСсылкаИзДанныхXDTO(ПравилоКонвертации, ДанныеXDTO);
	НавигационнаяСсылка = ВнешняяНавигационнаяСсылкаИзДанныхXDTO(ПравилоКонвертации, ДанныеXDTO);
	
	// Для ссылочных объектов ищем соответствие в регистре "ПубличныеИдентификаторыСинхронизируемыхОбъектов",
	// если соответствия для ссылки нет, то пробуем получить объект в "ЛОБ" по УИД из менеджера.
	ДанныеИБСсылка = ОбъектнаяСсылкаПоВнешней(КомпонентыОбмена, ПравилоКонвертации, ВнешняяСсылкаСтрокой);
	
	ИсторияПримененияТекущегоПКО = КомпонентыОбмена.ИсторияПримененияТекущегоПКО;
	
	ИсторияПримененияТекущегоПКО.ВнешняяСсылкаСтрокой = ВнешняяСсылкаСтрокой;
	ИсторияПримененияТекущегоПКО.НавигационнаяСсылка = НавигационнаяСсылка;
	ИсторияПримененияТекущегоПКО.ДанныеИБСсылка = ДанныеИБСсылка;
	ИсторияПримененияТекущегоПКО.ПравилоКонвертации = ПравилоКонвертации;
	
	Если НЕ КомпонентыОбмена.Свойство("ПараметрыИнтерактивнойКонвертации") Тогда
		
		ПараметрыИнтерактивнойКонвертации = РаботаСРезультатамиОбмена.НовыйПараметрыПередачиОбъектовНаЗагрузку();
		КомпонентыОбмена.Вставить("ПараметрыИнтерактивнойКонвертации", ПараметрыИнтерактивнойКонвертации);
		
	КонецЕсли;
	
	ДобавитьДействияПриПолученииДанных(КомпонентыОбмена, ПравилоКонвертации);
	
КонецПроцедуры

Процедура ОтразитьБлокирующиеСсылкиКонвертацииОбъекта(КомпонентыОбмена, ПолученныеДанные)
	
	КонвертацияОбъектноСобытияКД.ПриОбработкеСсылокБлокирующихКонвертацию(КомпонентыОбмена, ПолученныеДанные);
	
	Если КомпонентыОбмена.ПараметрыИнтерактивнойКонвертации.ИгнорироватьНедостающиеСсылки = ИСТИНА
		ИЛИ КомпонентыОбмена.ИсторияПримененияТекущегоПКО.СсылкиБлокирующиеКонвертацию.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	КонвертацияОбъектноРезультатыСлужебный.ФиксироватьПредупреждениеБлокировкиОбъектаДругимиОбъектами(КомпонентыОбмена);
	
КонецПроцедуры

Процедура ПередЗаписьюПолученныхДанных(КомпонентыОбмена, ПравилоКонвертации, ПолученныеДанные, ДанныеИБ)
	
	КонвертацияОбъектноСобытияКД.ПередЗаписьюПолученныхДанных(КомпонентыОбмена, ПравилоКонвертации, ПолученныеДанные, ДанныеИБ);
	Если КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьОшибкаСобытияПередЗаписьюПолученныхДанных = Истина Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ПолученныеДанные = Неопределено 
		И ДанныеИБ = Неопределено Тогда
		
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьОтказОтКонвертацииОбъекта(КомпонентыОбмена);
		
	ИначеЕсли ПолученныеДанные <> Неопределено
		И (КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьПредупреждениеУстановитьВручнуюСоответствие = Истина
			ИЛИ КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЗагрузкаДанныхТребуетПодтверждения = Истина) Тогда
		
		КонвертацияОбъектноРезультатыСлужебный.ФиксироватьНеобходимостьПодтвержденияЗагрузкиДанных(КомпонентыОбмена, ПолученныеДанные);
		ПолученныеДанные = ПрерватьВыполнениеКонвертацииПоОшибке(КомпонентыОбмена, ПолученныеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПеренестиПоляШапки(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБ, ПолученныеДанные)
	
	РеквизитыОбъектаКопия = ПравилоКонвертации.Свойства.ВыгрузитьКолонку("СвойствоКонфигурации");
	Если РеквизитыОбъектаКопия.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ИмяШапкаОбъекта = КонвертацияОбъектноРезультатыСлужебный.КлючЭлементаСоответствияСвойствШапки();
	ИсторияПримененияТекущегоПКО = КомпонентыОбмена.ИсторияПримененияТекущегоПКО;
	
	СвойстваШапкиУспешнойКонвертации = ИсторияПримененияТекущегоПКО.СвойстваУспешнойКонвертации[ИмяШапкаОбъекта];
	СвойстваУспешнойКонвертации = СтрРазделить(СвойстваШапкиУспешнойКонвертации, ",", Ложь);
	
	СвойстваШапкиИсключенныеИзКонвертации = ИсторияПримененияТекущегоПКО.СвойстваИсключенныеИзКонвертации[ИмяШапкаОбъекта];
	СвойстваИсключенныеИзКонвертации = СтрРазделить(СвойстваШапкиИсключенныеИзКонвертации, ",", Ложь);
	
	УбратьПробелыВИменахПолей(СвойстваУспешнойКонвертации);
	УбратьПробелыВИменахПолей(СвойстваИсключенныеИзКонвертации);
	
	СлитьСвойстваОтсутствующиеИСвойстваИсключенные(ПолученныеДанные, РеквизитыОбъектаКопия, СвойстваИсключенныеИзКонвертации); // Поддержка обратной совместимости
	
	Для НомерПоляИсключения = 0 По СвойстваИсключенныеИзКонвертации.ВГраница() Цикл
		
		ИндексПоляИсключения = РеквизитыОбъектаКопия.Найти(СвойстваИсключенныеИзКонвертации[НомерПоляИсключения]);
		Если ИндексПоляИсключения <> Неопределено Тогда
			
			РеквизитыОбъектаКопия.Удалить(ИндексПоляИсключения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПоляКопируемые = СтрСоединить(СвойстваУспешнойКонвертации, ",");
	ПоляИсключаемые = СтрСоединить(СвойстваИсключенныеИзКонвертации, ",");
	
	ЗаполнитьЗначенияСвойств(ДанныеИБ, ПолученныеДанные, ПоляКопируемые, ПоляИсключаемые);
	
КонецПроцедуры

Процедура ПеренестиПоляТабличныхЧастей(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБ, ПолученныеДанные)
	
	Если ТипЗнч(ПравилоКонвертации.СвойстваТабличныхЧастей) <> Тип("ТаблицаЗначений")
		ИЛИ ПравилоКонвертации.СвойстваТабличныхЧастей.Количество() = 0 Тогда
		
		Возврат; // Если не добавлялось правил конвертаций для ТЧ
		
	КонецЕсли;
	
	Для Каждого КонвертацииТЧ Из ПравилоКонвертации.СвойстваТабличныхЧастей Цикл
		
		ИмяТЧ = КонвертацииТЧ.ТЧКонфигурации; // Имя табличной части, как оно заведено в конфигураторе
		Если ПустаяСтрока(ИмяТЧ) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ДанныеИБ[ИмяТЧ].Очистить();
		ДанныеИБ[ИмяТЧ].Загрузить(ПолученныеДанные[ИмяТЧ].Выгрузить());
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодборОбъектаПоКлючевымПолям(КомпонентыОбмена, ПравилоКонвертации, ПолученныеДанные)
	
	Если ПравилоКонвертации.ЭтоСсылочныйТип <> Истина Тогда
		
		// Поиск по ключам актуален только для ссылочных типов
		Возврат;
		
	КонецЕсли;
	
	ДанныеИБСсылка = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ДанныеИБСсылка;
	Если ДанныеИБСсылка <> Неопределено Тогда
		
		// Если соответствие уже есть поиск по ключам не нужен
		Возврат;
		
	КонецЕсли;
	
	Если КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕслиНетСоответствияСоздаватьНовый = Истина
		ИЛИ КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕслиНетСоответствияУстанавливатьВручную = Истина Тогда
		
		// В настройках установлен ручной режим или вкл опция всегда создавать новые объекты
		Возврат;
		
	КонецЕсли;
	
	// Когда в настройках указано:
	// 1. Разрешен поиск по ключам ("ИсторияПримененияТекущегоПКО.ЕслиНетСоответствияИскатьПоКлючам = Истина");
	// 2. Или настроек вовсе нет (отсутствует запись в РС.ДействияПриПолученииДанныхОбмена).
	ВнешняяСсылкаСтрокой = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ВнешняяСсылкаСтрокой;
	НавигационнаяСсылка = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.НавигационнаяСсылка;
	ДанныеИБСсылка = СопоставитьОбъектПоПолямПоискаИлиАлгоритмом(КомпонентыОбмена, ПравилоКонвертации, ПолученныеДанные, ВнешняяСсылкаСтрокой, НавигационнаяСсылка);
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ДанныеИБСсылка = ДанныеИБСсылка;
	
КонецПроцедуры

Процедура ПоискПоПолямПоиска(КомпонентыОбмена, ПравилоКонвертации, ПоляПоиска, ВнешняяСсылкаСтрокой, ДанныеИБСсылка)
	
	// Попытка выполнить поиск платформенными методами
	ПоискСсылкиПлатформеннымМетодом(ПравилоКонвертации, ПоляПоиска, ДанныеИБСсылка);
	
	Если ДанныеИБСсылка = Неопределено Тогда
		
		ИдентификаторСтратегии = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.СтратегияПоискаПоКлючам;
		Если ИдентификаторСтратегии = Неопределено
			ИЛИ ИдентификаторСтратегии = КонвертацияОбъектноСервер.ИдентификаторСтандартнойСтратегииПоискаПоКлючам()
			Тогда
			
			ПоискСсылкиЗапросомПоТаблицеБД(КомпонентыОбмена, ПравилоКонвертации, ПоляПоиска, ВнешняяСсылкаСтрокой, ДанныеИБСсылка);
			
		Иначе
			
			ПоискСсылкиЗапросомПоТаблицеВременной(КомпонентыОбмена, ПравилоКонвертации, ПоляПоиска, ВнешняяСсылкаСтрокой, ДанныеИБСсылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоискСсылкиЗапросомПоТаблицеБД(КомпонентыОбмена, ПравилоКонвертации, ПоляПоиска, ВнешняяСсылкаСтрокой, ДанныеИБСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.Ссылка КАК Ссылка
		|ИЗ
		|	&ПолноеИмя КАК Таблица
		|ГДЕ
		|	&УсловиеОтбора";
	
	Отбор = Новый Массив;
	ДобавитьПоляПоискаВОтборЗапроса(ПравилоКонвертации, ПоляПоиска, Запрос, Отбор);
	
	УсловиеОтбора = СтрСоединить(Отбор, " И ");
	
	ИсключитьСопоставленныеРаннее(КомпонентыОбмена, ВнешняяСсылкаСтрокой, Запрос, УсловиеОтбора);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", УсловиеОтбора);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПолноеИмя", ПравилоКонвертации.ПолноеИмя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ДанныеИБСсылка = Выборка.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет поиск ссылки по ключевым полям среди несопоставленных данных.
// В отличии от ПоискСсылкиЗапросомПоТаблицеБД поиск выполняется по индексированной временной таблице,
// в которую выбираются несопоставленные данные.
//
// Образец запроса, который должен получиться по схеме запроса
//
//	Запрос.Текст =
//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//		|	ТаблицаНесопоставленных.Ссылка КАК Ссылка
//		|	<поля для сравнения из ПоляПоиска>
//		|ПОМЕСТИТЬ ТаблицаНесопоставленных
//		|ИЗ
//		|	<Имя таблицы МД> КАК ТаблицаНесопоставленных
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИСО
//		|		ПО (ТаблицаНесопоставленных.Ссылка = ПИСО.Ссылка)
//		|			И (ПИСО.УзелИнформационнойБазы = &УзелОбмена)
//		|ГДЕ
//		|	ПИСО.Идентификатор ЕСТЬ NULL
//		|
//		|ИНДЕКСИРОВАТЬ ПО
//		|	ТаблицаНесопоставленных.Ссылка
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	Таблица.Ссылка КАК Ссылка
//		|ИЗ
//		|	ТаблицаНесопоставленных КАК Таблица
//		|ГДЕ
//		|	<сравнение по полям из ПоляПоиска>";
//
Процедура ПоискСсылкиЗапросомПоТаблицеВременной(КомпонентыОбмена, ПравилоКонвертации, ПоляПоиска, ВнешняяСсылкаСтрокой, ДанныеИБСсылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УзелОбмена", КомпонентыОбмена.УзелКорреспондента);
	
	СхемаЗапроса = Новый СхемаЗапроса;
	
	// Запрос с выбором несопоставленных ссылок во временную таблицу
	ЗапросНесопоставленных = СхемаЗапроса.ПакетЗапросов[0];
	ЗапросНесопоставленных.ТаблицаДляПомещения = "ТаблицаНесопоставленных";
	ЗапросНесопоставленных.ВыбиратьРазрешенные = Истина;
	
	ОператорЗапроса1 = ЗапросНесопоставленных.Операторы[0];
	ИсточникЗапросаТаблица = ОператорЗапроса1.Источники.Добавить(ПравилоКонвертации.ПолноеИмя, "ТаблицаНесопоставленных");
	ИсточникЗапросаПИСО = ОператорЗапроса1.Источники.Добавить("РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов", "ПИСО");
	
	НомерКолонки = 0;
	
	ОператорЗапроса1.ВыбираемыеПоля.Добавить("ТаблицаНесопоставленных.Ссылка", НомерКолонки);
	ЗапросНесопоставленных.Колонки[НомерКолонки].Псевдоним = "Ссылка";
	ЗапросНесопоставленных.Индекс.Добавить("Ссылка");
	
	ДобавитьПоляПоискаВВыбранныеИИндексСхемыЗапроса(ПравилоКонвертации, ПоляПоиска, СхемаЗапроса, НомерКолонки);
	
	ИсточникЗапросаТаблица.Соединения.Добавить(ИсточникЗапросаПИСО, "ТаблицаНесопоставленных.Ссылка = ПИСО.Ссылка");
	ИсточникЗапросаТаблица.Соединения.Добавить(ИсточникЗапросаПИСО, "ПИСО.УзелИнформационнойБазы = &УзелОбмена");
	
	ОператорЗапроса1.Отбор.Добавить("ПИСО.Ссылка IS NULL");
	
	// Запрос с поиском по временной таблице
	ЗапросНайденныеЭлементы = СхемаЗапроса.ПакетЗапросов.Добавить();
	ОператорЗапроса2 = ЗапросНайденныеЭлементы.Операторы[0];
	ОператорЗапроса2.Источники.Добавить("ТаблицаНесопоставленных", "Таблица");
	
	ОператорЗапроса2.ВыбираемыеПоля.Добавить("Таблица.Ссылка");
	
	Отбор = Новый Массив;
	ДобавитьПоляПоискаВОтборЗапроса(ПравилоКонвертации, ПоляПоиска, Запрос, Отбор);
	
	УсловиеОтбора = СтрСоединить(Отбор, " И ");
	ОператорЗапроса2.Отбор.Добавить(УсловиеОтбора);
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ДанныеИБСсылка = Выборка.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоискСсылкиПлатформеннымМетодом(ПравилоКонвертации, ПоляПоиска, ДанныеИБСсылка)
	
	Если ПравилоКонвертации.ЭтоДокумент
		И ПоляПоиска.Количество() = 2
		И ПоляПоиска.Свойство("Дата")
		И ПоляПоиска.Свойство("Номер")
		Тогда
		
		ДанныеИБСсылка = ПравилоКонвертации.МенеджерОбъекта.НайтиПоНомеру(ПоляПоиска.Номер, ПоляПоиска.Дата);
		ДанныеИБСсылка = ?(ДанныеИБСсылка.Пустая(), Неопределено, ДанныеИБСсылка);
		
	ИначеЕсли ПравилоКонвертации.ЭтоСправочник Тогда
		
		Если (ПоляПоиска.Количество() = 1 И НЕ ПоляПоиска.Свойство("ЭтоГруппа")) // Если одно поле, и оно не признак группы
			ИЛИ (ПоляПоиска.Количество() = 2 И ПоляПоиска.Свойство("ЭтоГруппа")) // Если два поля, и одно из них признак группы
			Тогда
			
			Если ПоляПоиска.Свойство("Наименование") Тогда
				
				ДанныеИБСсылка = ПравилоКонвертации.МенеджерОбъекта.НайтиПоНаименованию(ПоляПоиска.Наименование, Истина);
				ДанныеИБСсылка = ?(ДанныеИБСсылка.Пустая(), Неопределено, ДанныеИБСсылка);
				
			ИначеЕсли ПоляПоиска.Свойство("Код") Тогда
				
				ДанныеИБСсылка = ПравилоКонвертации.МенеджерОбъекта.НайтиПоКоду(ПоляПоиска.Код);
				ДанныеИБСсылка = ?(ДанныеИБСсылка.Пустая(), Неопределено, ДанныеИБСсылка);
				
			КонецЕсли;
			
			// Если нашли элемент и есть признак группы, то обязательно проверим
			Если ДанныеИБСсылка <> Неопределено
				И ПоляПоиска.Свойство("ЭтоГруппа")
				И ОбщегоНазначения.ЭтоСправочник(ДанныеИБСсылка.Метаданные())
				Тогда
				
				Если (ПоляПоиска.ЭтоГруппа = Истина И ДанныеИБСсылка.ЭтоГруппа = Ложь)
					ИЛИ (ПоляПоиска.ЭтоГруппа = Ложь И ДанныеИБСсылка.ЭтоГруппа = Истина)
					Тогда
					
					ДанныеИБСсылка = Неопределено;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриПолученииОбъектаИБ(КомпонентыОбмена, ПравилоКонвертации, ДанныеИБ)
	
	Если ПравилоКонвертации.ЭтоСсылочныйТип <> Истина Тогда
		
		// Например, конвертация набора записей РС не требует получения объекта по ссылке
		Возврат;
		
	КонецЕсли;
	
	// Если новый, проверим настройку действия
	Если КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ДанныеИБСсылка = Неопределено Тогда
		
		КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЭтоНовыйОбъект = Истина;
		
		// Новый только вручную, с подтверждением
		Если КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕслиНетСоответствияУстанавливатьВручную = Истина Тогда
			
			ВнешняяСсылкаСтрокой = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ВнешняяСсылкаСтрокой;
			КонвертацияОбъектноРезультатыСлужебный.ФиксироватьНеобходимостьРучнойЗагрузкиДанныхЧерезСопоставление(КомпонентыОбмена, ВнешняяСсылкаСтрокой);
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	// Если в ПИСО записана битая ссылка (<Объект не найден...>) будет Неопределено
	ДанныеИБ = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ДанныеИБСсылка.ПолучитьОбъект();
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЭтоНовыйОбъект = (ДанныеИБ = Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ПриоритетыКонвертации

Функция НоваяТаблицаПриоритетыКонвертации()
	
	ПриоритетыКонвертации = Новый ТаблицаЗначений;
	ПриоритетыКонвертации.Колонки.Добавить("ОбъектФормата", Новый ОписаниеТипов("Строка"));
	ПриоритетыКонвертации.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
	ПриоритетыКонвертации.Колонки.Добавить("ПутьКДате", Новый ОписаниеТипов("Строка"));
	ПриоритетыКонвертации.Колонки.Добавить("ЭтоДокумент", Новый ОписаниеТипов("Булево"));
	
	Возврат ПриоритетыКонвертации;
	
КонецФункции

Функция ПриоритетыКонвертацииОбъектовФормата(ВерсияФорматаСтрокой) Экспорт
	
	Если СтрНайти(ВерсияФорматаСтрокой, "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/") = 0 Тогда
		
		// Если пустое значение (версия формата не указана), то выбираем все версии.
		// Для этого оставляем общую часть "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/"
		ПространствоИменВерсииФормата = "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/" + ВерсияФорматаСтрокой;
		
	Иначе
		
		// Ожидаем "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.2"
		ПространствоИменВерсииФормата = ВерсияФорматаСтрокой;
		
	КонецЕсли;
	
	ПриоритетыКонвертации = НоваяТаблицаПриоритетыКонвертации();
	КонвертацияОбъектноПриоритетыСлужебный.ПриоритетыКонвертацииОбъектовФормата(ПространствоИменВерсииФормата, ПриоритетыКонвертации);
	
	Возврат ПриоритетыКонвертации;
	
КонецФункции

#КонецОбласти

#КонецОбласти