///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// Проверка использования заданий не нужна для ИБ РИБ,
	// в том числе в сценариях:
	// - первого запуска периферийного узла РИБ;
	// - восстановления предопределенного узла периферийного РИБ.
	ЭтоПервыйЗапускАРМ = АвтономнаяРаботаСлужебный.НеобходимоВыполнитьНастройкуАвтономногоРабочегоМестаПриПервомЗапуске();
	ЭтоВосстановлениеСвязиСГлавнымУзлом = ПланыОбмена.ГлавныйУзел() = Неопределено 
		И ЗначениеЗаполнено(Константы.ГлавныйУзел.Получить());
		
	Если ЭтоПервыйЗапускАРМ
		ИЛИ ЭтоВосстановлениеСвязиСГлавнымУзлом
		Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ЭлементОтбора = Отбор.Найти("УзелИнформационнойБазы");
	Если ЭлементОтбора <> Неопределено
		И ЗначениеЗаполнено(ЭлементОтбора.Значение)
		И ОбменДаннымиПовтИсп.ЭтоУзелОбменаДаннымиБСП(ЭлементОтбора.Значение)
		И ОбменДаннымиСервер.ЭтоПланОбменаXDTO(ЭлементОтбора.Значение)
		Тогда
		
		РаботаСРезультатамиОбмена.ПроверитьНеобходимостьИспользованияЗаданийПообъектногоОбмена();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
