///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ClientID") Тогда
		
		ВызватьИсключение НСтр("ru = 'Эта форма не предназначена для непосредственного открытия.'", 
			ОбщегоНазначения.КодОсновногоЯзыка());
		
	КонецЕсли;
	
	ПолеHTML = "https://accounts.google.com/o/oauth2/auth?response_type=code&client_id=" + Параметры.ClientID +
		"&redirect_uri=http://localhost&access_type=offline&scope=https://www.googleapis.com/auth/drive"
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолеHTMLДокументСформирован(Элемент)
	
	Позиция = СтрНайти(Элемент.Документ.URL, "code=");
	Если Позиция Тогда 
		
		Код = Сред(Элемент.Документ.URL, Позиция + 5);
		
		Закрыть(Код);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
