///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//   НастройкиОтчета - см. ВариантыОтчетов.ОписаниеОтчета.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВариантыОтчетов") Тогда
		Возврат;
	КонецЕсли;
	
	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СертификатыЭлектроннойПодписи");
	НастройкиВарианта.Описание = НСтр("ru = 'Сертификаты электронной подписи действующие в этом году.'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ЗаканчиваетсяСрокДействия");
	НастройкиВарианта.Описание = НСтр("ru = 'Сертификаты, у которых заканчивается срок действия.'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ТребуетсяМЧД");
	НастройкиВарианта.Описание = НСтр("ru = 'Сертификаты, для которых требуется МЧД.'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ТребуетсяВыпускСертификатаФЛ");
	НастройкиВарианта.Описание = НСтр("ru = 'Сертификаты организации, выпущенные коммерческими УЦ, которым требуется выпуск сертификата физического лица.'");
	
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	Если Не ПравоДоступа("Просмотр", Метаданные.Отчеты.СертификатыЭлектроннойПодписи) Тогда
		Возврат;
	КонецЕсли;
	
	Команда = КомандыОтчетов.Добавить();
	Команда.КлючВарианта      = "СертификатыЭлектроннойПодписи";
	Команда.Представление     = НСтр("ru = 'Сертификаты электронной подписи'");
	Команда.Идентификатор     = "СертификатыЭлектроннойПодписи";
	Команда.Важность          = "Важное";
	
	Команда = КомандыОтчетов.Добавить();
	Команда.КлючВарианта      = "ЗаканчиваетсяСрокДействия";
	Команда.Представление     = НСтр("ru = 'Сертификаты, у которых заканчивается срок действия'");
	Команда.Идентификатор     = "ЗаканчиваетсяСрокДействия";
	Команда.Важность          = "Важное";
	
	Команда = КомандыОтчетов.Добавить();
	Команда.КлючВарианта      = "ТребуетсяВыпускСертификатаФЛ";
	Команда.Представление     = НСтр("ru = 'Требуется выпуск сертификата физического лица'");
	Команда.Идентификатор     = "ТребуетсяМЧД";
	Команда.Важность          = "Важное";
	
	Команда = КомандыОтчетов.Добавить();
	Команда.КлючВарианта      = "ТребуетсяМЧД";
	Команда.Представление     = НСтр("ru = 'Сертификаты, для которых требуется МЧД'");
	Команда.Идентификатор     = "ТребуетсяМЧД";
	Команда.Важность          = "Важное";
	
КонецПроцедуры

// Задать настройки формы отчета.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения
//         - Неопределено
//   КлючВарианта - Строка
//                - Неопределено
//   Настройки - см. ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Если КлючВарианта = "ТребуетсяМЧД" ИЛИ КлючВарианта = "ЗаканчиваетсяСрокДействия" Тогда
		Настройки.РазрешеноИзменятьСтруктуру = Ложь;
	КонецЕсли;
	Настройки.ФормироватьСразу = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет настройки интеграции отчета с механизмами конфигурации. 
//
// Параметры:
//  НастройкиПрограммногоИнтерфейса - см. ПодключаемыеКоманды.НастройкиПодключаемогоОбъекта
//
Процедура ПриОпределенииНастроек(НастройкиПрограммногоИнтерфейса) Экспорт
	
	НастройкиПрограммногоИнтерфейса.НастроитьВариантыОтчета = Истина;
	НастройкиПрограммногоИнтерфейса.ОпределитьНастройкиФормы = Истина;
	НастройкиПрограммногоИнтерфейса.ДобавитьКомандыОтчетов = Истина;
	НастройкиПрограммногоИнтерфейса.Размещение.Добавить(Метаданные.Справочники.СертификатыКлючейЭлектроннойПодписиИШифрования);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#КонецЕсли