///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Для процедуры ПриДобавленииСерверныхОповещений общего модуля ОбщегоНазначенияПереопределяемый.
//
// Параметры:
//  Имя - Строка - имя оповещения, подходящее для имени свойства структуры.
//
// Возвращаемое значение:
//  Структура:
//   * Имя - Строка - имя оповещения.
//
//   * ИмяМодуляОтправки - Строка - имя серверного общего модуля, например, "СоединенияИБ",
//                    содержащего экспортную процедуру ПриОтправкеСерверногоОповещения.
//                    Вызов процедуры выполняется в привилегированном режиме.
//                    Смотри пример в общем модуле СтандартныеПодсистемыСервер.
//                    Может быть не заполнено. В этом случае вызываться не будет,
//                    например, используется для отправки сообщений об изменении
//                    настроек функциональных опций в момент изменения их констант,
//                    вместо отслеживания изменений в регламентом задании.
//
//   * ИмяМодуляПолучения - Строка - имя клиентского общего модуля, например, "СоединенияИБКлиент",
//                    содержащего экспортную процедуру ПриПолученииСерверногоОповещения.
//                    Смотри пример в общем модуле СтандартныеПодсистемыКлиент.
//
//   * Параметры - Произвольный - любое сериализуемое значение, которое нужно передать
//                    в процедуру ПриОтправкеСерверногоОповещения в качестве параметров.
//                    Должно быть как можно меньшего размера в сериализованном виде.
//                    Например, описание метаданных и расширений сеанса, для вычисления
//                    добавленных и удаленных расширений и исправлений в регламентном
//                    задании при вызове ПриОтправкеСерверногоОповещения, и отправке
//                    оповещения с вычисленными отличиями соответствующим сеансам.
//
//   * ПериодПроверки - Число - количество секунд, через которое требуется
//                         вызывать ПриОтправкеСерверногоОповещения для проверки
//                         состояния сервера и отправки оповещения, если требуется.
//                         Начальное значение 20 минут.
//
Функция НовоеСерверноеОповещение(Имя) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Имя", Имя);
	Результат.Вставить("ИмяМодуляОтправки", "");
	Результат.Вставить("ИмяМодуляПолучения", "");
	Результат.Вставить("Параметры", Неопределено);
	Результат.Вставить("ПериодПроверки", 20*60);
	
	Возврат Результат;
	
КонецФункции

// Добавляет серверное оповещение в очередь для доставки на клиент.
// Оповещение доставляется через систему взаимодействия,
// либо забирается в рамках общего серверного вызова.
//
// Параметры:
//  ИмяОповещения - Строка - смотри НовоеСерверноеОповещение.Имя.
//  
//  Результат - Произвольный - произвольное сериализуемое значение,
//             которое будет отправлено в составе оповещения на клиент
//             (должны быть как можно меньшего размера, желательно не более 1 Кб).
//
//  Адресаты - Неопределено - все пользователи (и соответственно все сеансы).
//               Если указано незаполненное соответствие, тогда возврат.
//           - Соответствие из КлючИЗначение:
//              * Ключ - УникальныйИдентификатор - идентификатор пользователя ИБ.
//              * Значение - Массив из см. СерверныеОповещения.КлючСеанса
//
//  ОтправитьСразу - Булево - если Истина, попытаться сразу отправить сообщение
//               через систему взаимодействия перед добавлением в очередь.
//               Отправка сразу не допускается из обработчиков ПриОтправкеСерверногоОповещения.
//               При вызове в транзакции следует учесть, что неудачное обращение
//               к системе взаимодействия может занимать (3-5 сек)*2, а удачное не менее (50 мс)*2.
//
Процедура ОтправитьСерверноеОповещение(ИмяОповещения, Результат, Адресаты, ОтправитьСразу = Ложь) Экспорт
	
	ОтправитьСерверноеОповещениеСИдентификаторомГруппы(ИмяОповещения, Результат, Адресаты, ОтправитьСразу);
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// Возвращает строковый уникальный ключ сеанса,
// полученный из свойств сеанса НачалоСеанса и НомерСеанса.
//
// Параметры:
//  Сеанс - СеансИнформационнойБазы
//        - Неопределено - использовать текущий сеанс.
//
// Возвращаемое значение:
//  Строка - строка вида "<НачалоСеанса> <НомерСеанса>",
//    например, "2022.03.07 05:01:09 8342".
//
Функция КлючСеанса(Сеанс = Неопределено) Экспорт
	
	Если Сеанс = Неопределено Тогда
		Сеанс = ПолучитьТекущийСеансИнформационнойБазы();
	КонецЕсли;
	
	// АПК:1367-выкл - №763.1.1 Допустимо использовать произвольный формат,
	// так как не выводится пользователю и используется для технологических целей.
	Возврат Формат(Сеанс.НачалоСеанса, "ДФ='yyyy.MM.dd HH:mm:ss'") + " "
		+ Формат(Сеанс.НомерСеанса, "ЧН=0; ЧГ=");
	// АПК:1367-вкл.
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистем конфигурации.

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииПараметровРаботыКлиентаПриЗапуске.
Процедура ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры) Экспорт
	
	Параметры.Вставить("СерверныеОповещения", ПараметрыСерверныхОповещенийЭтогоСеанса());
	
КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	СоответствиеИменПсевдонимам.Вставить(
		Метаданные.РегламентныеЗадания.ОтправкаСерверныхОповещенийКлиентам.ИмяМетода);
	
КонецПроцедуры

// См. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки.
Процедура ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы) Экспорт
	
	Типы.Добавить(Метаданные.Константы.СостояниеОтправкиСерверныхОповещений);
	Типы.Добавить(Метаданные.РегистрыСведений.ПериодическиеСерверныеОповещения);
	Типы.Добавить(Метаданные.РегистрыСведений.ОтправленныеСерверныеОповещения);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Основные процедуры и функции.

// Параметры:
//  ИмяОповещения  - см. ОтправитьСерверноеОповещение.ИмяОповещения
//  Результат      - см. ОтправитьСерверноеОповещение.Результат
//  Адресаты       - см. ОтправитьСерверноеОповещение.Адресаты
//  ОтправитьСразу - см. ОтправитьСерверноеОповещение.ОтправитьСразу
//
//  ИдентификаторГруппы - УникальныйИдентификатор - идентификатор группы оповещений для записи регистр.
//                      - Неопределено - не заполнять.
//
Процедура ОтправитьСерверноеОповещениеСИдентификаторомГруппы(ИмяОповещения, Результат, Адресаты,
			ОтправитьСразу, ИдентификаторГруппы = Неопределено) Экспорт
	
	Если Адресаты <> Неопределено И Не ЗначениеЗаполнено(Адресаты) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписаноВСистемуВзаимодействия = Ложь;
	ИдентификаторОповещения = НРег(Новый УникальныйИдентификатор);
	ДатаДобавления = ТекущаяДатаСеанса();
	ДатаДобавленияМиллисекунды = Миллисекунды();
	
	Если ОтправитьСразу
	   И СерверныеОповещенияСлужебныйПовтИсп.ЭтоСеансОтправкиСерверныхОповещенийКлиентам() Тогда
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'В процедуре %1 недопустимо указывать значение %2 для параметра %3
			           |при вызове из процедур %4.'"),
			"СерверныеОповещения.ОтправитьСерверноеОповещение",
			"Истина",
			"ОтправитьСразу",
			"ПриОтправкеСерверногоОповещения");
		ВызватьИсключение ТекстОшибки;
		
	ИначеЕсли ОтправитьСразу
	        И ТекущийПользовательЗарегистрированВСистемеВзаимодействия() Тогда
		
		Данные = НовыеДанныеСообщения();
		Данные.ИмяОповещения           = ИмяОповещения;
		Данные.Результат               = Результат;
		Данные.Адресаты                = Адресаты;
		Данные.ИдентификаторОповещения = ИдентификаторОповещения;
		Данные.ДатаДобавления          = ДатаДобавления;
		Данные.ОтправленоИзОчереди     = Ложь;
		
		Если ЗначениеЗаполнено(Адресаты) И Адресаты.Количество() = 1 Тогда
			Для Каждого КлючИЗначение Из Адресаты Цикл
				Прервать;
			КонецЦикла;
			ИдентификаторОбсуждения = ИдентификаторЛичногоОбсуждения(КлючИЗначение.Ключ);
		Иначе
			ИдентификаторОбсуждения = ИдентификаторОбщегоОбсуждения();
		КонецЕсли;
		Если ИдентификаторОбсуждения <> Неопределено Тогда
			ЗаписаноВСистемуВзаимодействия = ОтправитьСообщение(Данные, ИдентификаторОбсуждения);
		КонецЕсли;
	КонецЕсли;
	
	СодержимоеОповещения = НовоеСодержимоеОповещения();
	СодержимоеОповещения.ИмяОповещения = ИмяОповещения;
	СодержимоеОповещения.Результат     = Результат;
	СодержимоеОповещения.Адресаты      = Адресаты;
	
	НаборЗаписей = СлужебныйНаборЗаписей(РегистрыСведений.ОтправленныеСерверныеОповещения);
	НаборЗаписей.Отбор.ИдентификаторОповещения.Установить(ИдентификаторОповещения);
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ИдентификаторОповещения = ИдентификаторОповещения;
	НоваяЗапись.ДатаДобавления = ДатаДобавления;
	НоваяЗапись.ДатаДобавленияМиллисекунды = ДатаДобавленияМиллисекунды;
	НоваяЗапись.ЗаписаноВСистемуВзаимодействия = ЗаписаноВСистемуВзаимодействия;
	НоваяЗапись.СодержимоеОповещения = Новый ХранилищеЗначения(СодержимоеОповещения);
	НоваяЗапись.ИдентификаторГруппы = НРег(ИдентификаторГруппы);
	Если Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		НаборЗаписей.Отбор.ОбластьДанныхВспомогательныеДанные.Установить(0);
		НоваяЗапись.ОбластьДанныхВспомогательныеДанные = 0;
	КонецЕсли;
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция Миллисекунды()
	
	ДатаВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Возврат ДатаВМиллисекундах - Цел(ДатаВМиллисекундах/1000)*1000;
	
КонецФункции

// Параметры:
//  ИдентификаторГруппыОповещений - УникальныйИдентификатор - для поиска в регистре.
//  ПоследнееОповещение - см. НовоеСерверноеОповещенияДляКлиента
//
// Возвращаемое значение:
//  Массив из см. НовоеСерверноеОповещенияДляКлиента
//
Функция СерверныеОповещенияДляКлиента(ИдентификаторГруппыОповещений, ПоследнееОповещение = Неопределено) Экспорт
	
	Если ПоследнееОповещение = Неопределено Тогда
		ПоследнееОповещение = НовоеСерверноеОповещенияДляКлиента();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторГруппы",        НРег(ИдентификаторГруппыОповещений));
	Запрос.УстановитьПараметр("ДатаДобавления",             ПоследнееОповещение.ДатаДобавления);
	Запрос.УстановитьПараметр("ДатаДобавленияМиллисекунды", ПоследнееОповещение.ДатаДобавленияМиллисекунды);
	Запрос.УстановитьПараметр("ИдентификаторОповещения",    ПоследнееОповещение.ИдентификаторОповещения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтправленныеСерверныеОповещения.ИдентификаторОповещения КАК ИдентификаторОповещения,
	|	ОтправленныеСерверныеОповещения.СодержимоеОповещения КАК СодержимоеОповещения,
	|	ОтправленныеСерверныеОповещения.ДатаДобавления КАК ДатаДобавления,
	|	ОтправленныеСерверныеОповещения.ДатаДобавленияМиллисекунды КАК ДатаДобавленияМиллисекунды
	|ИЗ
	|	РегистрСведений.ОтправленныеСерверныеОповещения КАК ОтправленныеСерверныеОповещения
	|ГДЕ
	|	ОтправленныеСерверныеОповещения.ИдентификаторГруппы = &ИдентификаторГруппы
	|	И ОтправленныеСерверныеОповещения.ИдентификаторОповещения <> &ИдентификаторОповещения
	|	И (ОтправленныеСерверныеОповещения.ДатаДобавления > &ДатаДобавления
	|			ИЛИ ОтправленныеСерверныеОповещения.ДатаДобавления = &ДатаДобавления
	|				И ОтправленныеСерверныеОповещения.ДатаДобавленияМиллисекунды > &ДатаДобавленияМиллисекунды)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтправленныеСерверныеОповещения.ДатаДобавления,
	|	ОтправленныеСерверныеОповещения.ДатаДобавленияМиллисекунды";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Оповещение = НовоеСерверноеОповещенияДляКлиента();
		ЗаполнитьЗначенияСвойств(Оповещение, Выборка);
		Оповещение.Содержимое = НовоеСодержимоеОповещения(Выборка.СодержимоеОповещения);
		Результат.Добавить(Оповещение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//   * ИдентификаторОповещения - Строка
//   * Содержимое - см. НовоеСодержимоеОповещения
//   * ДатаДобавления - Дата
//   * ДатаДобавленияМиллисекунды - Число
//
Функция НовоеСерверноеОповещенияДляКлиента()
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторОповещения", "");
	Результат.Вставить("Содержимое", Неопределено);
	Результат.Вставить("ДатаДобавления", '00010101');
	Результат.Вставить("ДатаДобавленияМиллисекунды", 0);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//   Хранилище - Неопределено
//             - ХранилищеЗначения
//
// Возвращаемое значение:
//  Структура:
//   * ИмяОповещения - см. ОтправитьСерверноеОповещение.ИмяОповещения
//   * Результат     - см. ОтправитьСерверноеОповещение.Результат
//   * Адресаты      - см. ОтправитьСерверноеОповещение.Адресаты
//
Функция НовоеСодержимоеОповещения(Хранилище = Неопределено)
	
	Содержимое = Новый Структура;
	Содержимое.Вставить("ИмяОповещения", "");
	Содержимое.Вставить("Результат");
	Содержимое.Вставить("Адресаты", Новый Соответствие);
	
	Если ТипЗнч(Хранилище) <> Тип("ХранилищеЗначения") Тогда
		Возврат Содержимое;
	КонецЕсли;
	
	ТекущееСодержимое = Хранилище.Получить();
	Если ТипЗнч(ТекущееСодержимое) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Содержимое, ТекущееСодержимое);
	КонецЕсли;
	
	Возврат Содержимое;
	
КонецФункции

// Обработчик регламентного задания.
Процедура ОтправкаСерверныхОповещенийКлиентам() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.ОтправкаСерверныхОповещенийКлиентам);
	
	УстановитьПривилегированныйРежим(Истина);
	СостояниеОтправки = СостояниеОтправкиПриЗапускеФоновогоЗадания();
	Если СостояниеОтправки <> Неопределено Тогда
		МинимальныйПериодПоПользователям = Новый Соответствие;
		ПодготовитьСерверныеОповещения(СостояниеОтправки, МинимальныйПериодПоПользователям);
		ОтправитьПодготовленныеСерверныеОповещения(СостояниеОтправки, МинимальныйПериодПоПользователям);
	КонецЕсли;
	ОбновитьЗаданиеОтправкаСерверныхОповещенийКлиентамЕслиНетОповещений(
		СостояниеОтправки.МинимальныйПериодПроверки);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Обработчик общего серверного вызова.
//
// Параметры:
//  Параметры - см. СерверныеОповещенияКлиент.НовыеПараметрыОбщегоСерверногоВызова
//
// Возвращаемое значение:
//  Структура:
//   * СерверныеОповещения - Массив из Структура:
//      ** ИмяОповещения - см. ОтправитьСерверноеОповещение.ИмяОповещения
//      ** Результат     - см. ОтправитьСерверноеОповещение.Результат
//   * ДатаПоследнегоОповещения - Дата
//   * МинимальныйПериодПроверки - Число
//   * ДополнительныеРезультаты - Соответствие - содержит параметры, вставленные в процедуре
//       ОбщегоНазначенияПереопределяемый.ПриПериодическомПолученииДанныхКлиентаНаСервере.
//
Функция НедоставленныеСерверныеОповещенияСеанса(Знач Параметры) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СерверныеОповещения",       Новый Массив);
	Результат.Вставить("ДатаПоследнегоОповещения",  Параметры.ДатаПоследнегоОповещения);
	Результат.Вставить("МинимальныйПериодПроверки", Параметры.МинимальныйПериодПроверки);
	Результат.Вставить("ДополнительныеРезультаты",  Новый Соответствие);
	
	ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(Параметры.СообщенияДляЖурналаРегистрации);
	
	ДлительныеОперации.ПриПериодическомПолученииДанныхКлиентаНаСервере(
		Параметры.ДополнительныеПараметры, Результат.ДополнительныеРезультаты);
	
	Если Параметры.ПериодическаяОтправкаДанных Тогда
		ИнтеграцияПодсистемБСП.ПриПериодическомПолученииДанныхКлиентаНаСервере(
			Параметры.ДополнительныеПараметры, Результат.ДополнительныеРезультаты);
		
		ОбщегоНазначенияПереопределяемый.ПриПериодическомПолученииДанныхКлиентаНаСервере(
			Параметры.ДополнительныеПараметры, Результат.ДополнительныеРезультаты);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СеансАдминистратораСервиса = СеансАдминистратораСервиса();
	НоваяДатаПоследнегоОповещения = Параметры.ДатаПоследнегоОповещения;
	Если Не СеансАдминистратораСервиса Тогда
		СостояниеОтправки = СостояниеОтправкиСерверныхОповещений();
		
		ДатаСледующейПроверки = СостояниеОтправки.ДатаПоследнейПроверки
			+ СостояниеОтправки.МинимальныйПериодПроверки;
		
		Если ТекущаяДатаСеанса() > ДатаСледующейПроверки
		   И ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЗавершениеРаботыПользователей") Тогда
			
			МодульСоединенияИБ = ОбщегоНазначения.ОбщийМодуль("СоединенияИБ");
			МодульСоединенияИБ.ПриПериодическомПолученииДанныхКлиентаНаСервере(
				Параметры.ДополнительныеПараметры, Результат.ДополнительныеРезультаты);
		КонецЕсли;
		
		Если НоваяДатаПоследнегоОповещения < СостояниеОтправки.ДатаПоследнейПроверки Тогда
			НоваяДатаПоследнегоОповещения = СостояниеОтправки.ДатаПоследнейПроверки;
		КонецЕсли;
	КонецЕсли;
	
	ИдентификаторПользователяИБ = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
	КлючЭтогоСеанса = КлючСеанса();
	
	Выборка = НовыеСерверныеОповещения(Параметры.ДатаПоследнегоОповещения);
	Пока Выборка.Следующий() Цикл
		Хранилище = Выборка.СодержимоеОповещения;
		Содержимое = НовоеСодержимоеОповещения(Хранилище);
		Если ЗначениеЗаполнено(Содержимое.ИмяОповещения) Тогда
			Если ТипЗнч(Содержимое.Адресаты) = Тип("Соответствие") Тогда
				КлючиСеансов = Содержимое.Адресаты.Получить(ИдентификаторПользователяИБ);
				Если ТипЗнч(КлючиСеансов) <> Тип("Массив")
				 Или КлючиСеансов.Найти(КлючЭтогоСеанса) = Неопределено
				   И КлючиСеансов.Найти("*") = Неопределено Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			Данные = НовыеДанныеСообщения();
			Данные.ИмяОповещения           = Содержимое.ИмяОповещения;
			Данные.Результат               = Содержимое.Результат;
			Данные.ИдентификаторОповещения = Выборка.ИдентификаторОповещения;
			Данные.ДатаДобавления          = Выборка.ДатаДобавления;
			Если Не ДлительныеОперации.ПропуститьОповещение(Данные) Тогда
				Результат.СерверныеОповещения.Добавить(Данные);
			КонецЕсли;
		КонецЕсли;
		НоваяДатаПоследнегоОповещения = Выборка.ДатаДобавления;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НоваяДатаПоследнегоОповещения) Тогда
		Результат.ДатаПоследнегоОповещения = НоваяДатаПоследнегоОповещения;
	КонецЕсли;
	
	Если СеансАдминистратораСервиса Тогда
		УдалитьУстаревшиеОповещения();
		
	ИначеЕсли ЗначениеЗаполнено(СостояниеОтправки.МинимальныйПериодПроверки) Тогда
		Результат.МинимальныйПериодПроверки = СостояниеОтправки.МинимальныйПериодПроверки;
	КонецЕсли;
	
	ИмяКлючаПараметровОбсуждений = "СтандартныеПодсистемы.БазоваяФункциональность.ИдентификаторыОбсуждений";
	Если Параметры.ДополнительныеПараметры.Получить(ИмяКлючаПараметровОбсуждений) <> Неопределено Тогда
		Результат.ДополнительныеРезультаты.Вставить(ИмяКлючаПараметровОбсуждений, ИдентификаторыОбсуждений());
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Процедура ПодготовитьСерверныеОповещения(СостояниеОтправки, МинимальныйПериодПоПользователям = Неопределено)
	
	УдалитьУстаревшиеОповещения();
	
	СостояниеОтправки.ДатаПоследнейПроверки = ТекущаяДатаСеанса();
	СостояниеОтправки.МинимальныйПериодПроверки = 60*20;
	
	ПериодическиеОповещения = ПериодическиеСерверныеОповещения(МинимальныйПериодПоПользователям);
	
	Для Каждого КлючИЗначение Из ПериодическиеОповещения Цикл
		ИмяОповещения = КлючИЗначение.Ключ;
		Оповещение    = КлючИЗначение.Значение;
		Если СостояниеОтправки.МинимальныйПериодПроверки > Оповещение.ПериодПроверки Тогда
			СостояниеОтправки.МинимальныйПериодПроверки = Оповещение.ПериодПроверки;
		КонецЕсли;
		ДатаПроверки = СостояниеОтправки.ДатыПроверкиПоИменамОповещений.Получить(ИмяОповещения);
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
		Если ТипЗнч(ДатаПроверки) = Тип("Дата")
		   И ТекущаяДатаСеанса < ДатаПроверки + Оповещение.ПериодПроверки Тогда
			Продолжить;
		КонецЕсли;
		СостояниеОтправки.ДатыПроверкиПоИменамОповещений.Вставить(ИмяОповещения, ТекущаяДатаСеанса);
		Если Метаданные.ОбщиеМодули.Найти(Оповещение.ИмяМодуляОтправки) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МодульОтправки = ОбщегоНазначения.ОбщийМодуль(Оповещение.ИмяМодуляОтправки);
		Попытка
			МодульОтправки.ПриОтправкеСерверногоОповещения(ИмяОповещения, КлючИЗначение.Значение.ВариантыПараметров);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'При вызове процедуры ""%1"" возникла ошибка:
				           |%2'"),
				Оповещение.ИмяМодуляОтправки + ".ПриОтправкеСерверногоОповещения",
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Серверные оповещения.Ошибка работы фонового задания'",
					ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		КонецПопытки;
	КонецЦикла;
	
	УточнитьМинимальныйПериодПроверки(СостояниеОтправки.МинимальныйПериодПроверки);
	
	ОбновитьСостояниеОтправки(СостояниеОтправки,
		"ДатаПоследнейПроверки, ДатыПроверкиПоИменамОповещений, МинимальныйПериодПроверки");
	
КонецПроцедуры

// Возвращаемое значение:
//   см. ОбщегоНазначенияПереопределяемый.ПриДобавленииСерверныхОповещений.Оповещения
//
Функция ДобавленныеОповещенияСеанса()
	
	Оповещения = Новый Соответствие;
	ДлительныеОперации.ПриДобавленииСерверныхОповещений(Оповещения);
	
	Если Не СеансАдминистратораСервиса() Тогда
		ИнтеграцияПодсистемБСП.ПриДобавленииСерверныхОповещений(Оповещения);
		ОбщегоНазначенияПереопределяемый.ПриДобавленииСерверныхОповещений(Оповещения);
	КонецЕсли;
	
	Возврат Оповещения;
	
КонецФункции

Процедура ОтправитьПодготовленныеСерверныеОповещения(СостояниеОтправки, МинимальныйПериодПоПользователям)
	
	Если Не ТекущийПользовательЗарегистрированВСистемеВзаимодействия() Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторОбщегоОбсуждения = ИдентификаторОбщегоОбсуждения();
	Если ИдентификаторОбщегоОбсуждения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьУстаревшиеСообщения(СостояниеОтправки);
	
	ДатаПоследнегоОповещения = СостояниеОтправки.ДатаПоследнейПроверки;
	ДатаОповещенияСОшибкой   = '00010101';
	
	Выборка = НовыеСерверныеОповещения(?(ЗначениеЗаполнено(СостояниеОтправки.ДатаОповещенияСОшибкой),
		СостояниеОтправки.ДатаОповещенияСОшибкой, СостояниеОтправки.ДатаПоследнегоОповещения));
	
	Контекст = Новый Структура;
	Контекст.Вставить("ИдентификаторОбщегоОбсуждения", ИдентификаторОбщегоОбсуждения);
	Контекст.Вставить("ИдентификаторыЛичныхОбсуждений", Новый Соответствие);
	Контекст.Вставить("ДатыОповещенийСОшибкамиПоПользователям", Новый Соответствие);
	Контекст.Вставить("ДатыУспешнойОтправкиОповещенийПоПользователям", Новый Соответствие);
	
	Пока Выборка.Следующий() Цикл
		Хранилище = Выборка.СодержимоеОповещения;
		Содержимое = НовоеСодержимоеОповещения(Хранилище);
		Если ЗначениеЗаполнено(Содержимое.ИмяОповещения) Тогда
			Данные = НовыеДанныеСообщения();
			Данные.ИмяОповещения           = Содержимое.ИмяОповещения;
			Данные.Результат               = Содержимое.Результат;
			Данные.ИдентификаторОповещения = Выборка.ИдентификаторОповещения;
			Данные.ДатаДобавления          = Выборка.ДатаДобавления;
			
			Если ТипЗнч(Содержимое.Адресаты) <> Тип("Соответствие") Тогда
				Если Не СообщениеУжеОтправлено(СостояниеОтправки, Выборка, "ВсеПользователи") Тогда
					Данные.Адресаты = Неопределено;
					Данные.Ошибки = Контекст.ДатыОповещенийСОшибкамиПоПользователям;
					Если ОтправитьСообщение(Данные, ИдентификаторОбщегоОбсуждения) Тогда
						Контекст.ДатыУспешнойОтправкиОповещенийПоПользователям.Вставить("ВсеПользователи", ТекущаяДатаСеанса());
					Иначе
						Если Контекст.ДатыОповещенийСОшибкамиПоПользователям.Получить("ВсеПользователи") = Неопределено Тогда
							Контекст.ДатыОповещенийСОшибкамиПоПользователям.Вставить("ВсеПользователи", Данные.ДатаДобавления);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Адресаты = Новый Соответствие;
				Для Каждого ОписаниеАдресата Из Содержимое.Адресаты Цикл
					Если Не СообщениеУжеОтправлено(СостояниеОтправки, Выборка, ОписаниеАдресата.Ключ) Тогда
						Адресаты.Вставить(ОписаниеАдресата.Ключ, ОписаниеАдресата.Значение);
					КонецЕсли;
				КонецЦикла;
				ОтправитьАдресноеСообщение(Данные, Адресаты, Контекст);
			КонецЕсли;
		КонецЕсли;
		ДатаПоследнегоОповещения = Данные.ДатаДобавления;
	КонецЦикла;
	
	ОповеститьОбАктивности(СостояниеОтправки, МинимальныйПериодПоПользователям, Контекст);
	
	Если ЗначениеЗаполнено(ДатаОповещенияСОшибкой)
	   И ДатаОповещенияСОшибкой < ДатаПоследнегоОповещения - МаксимальныйПериодПовторенияДоставки() Тогда
		
		ДатаОповещенияСОшибкой = ДатаПоследнегоОповещения - МаксимальныйПериодПовторенияДоставки();
	КонецЕсли;
	
	СостояниеОтправки.ДатаОповещенияСОшибкой   = ДатаОповещенияСОшибкой;
	СостояниеОтправки.ДатаПоследнегоОповещения = ДатаПоследнегоОповещения;
	СостояниеОтправки.ДатыОповещенийСОшибкамиПоПользователям = Контекст.ДатыОповещенийСОшибкамиПоПользователям;
	
	ОбновитьСостояниеОтправки(СостояниеОтправки,
		"ДатаОповещенияСОшибкой,
		|ДатаПоследнегоОповещения,
		|ДатаПоследнейОчисткиСообщений,
		|ДатыОповещенийСОшибкамиПоПользователям,
		|ДатыУспешнойОтправкиОповещенийПоПользователям");
	
КонецПроцедуры

Процедура ОтправитьАдресноеСообщение(Данные, Адресаты, Контекст)
	
	Если Адресаты.Количество() > 20 Тогда
		Данные.Адресаты = Адресаты;
		УстановитьДатыОповещенийСОшибками(Данные, Контекст.ДатыОповещенийСОшибкамиПоПользователям);
		Если ОтправитьСообщение(Данные, Контекст.ИдентификаторОбщегоОбсуждения) Тогда
			Для Каждого ОписаниеАдресата Из Адресаты Цикл
				Контекст.ДатыУспешнойОтправкиОповещенийПоПользователям.Вставить(ОписаниеАдресата.Ключ, ТекущаяДатаСеанса());
			КонецЦикла;
		Иначе
			Для Каждого ОписаниеАдресата Из Адресаты Цикл
				Если Контекст.ДатыОповещенийСОшибкамиПоПользователям.Получить(ОписаниеАдресата.Ключ) = Неопределено Тогда
					Контекст.ДатыОповещенийСОшибкамиПоПользователям.Вставить(ОписаниеАдресата.Ключ, Данные.ДатаДобавления);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Для Каждого ОписаниеАдресата Из Адресаты Цикл
			ИдентификаторПользователяИБ = ОписаниеАдресата.Ключ;
			Данные.Адресаты = Новый Соответствие;
			Данные.Адресаты.Вставить(ИдентификаторПользователяИБ, ОписаниеАдресата.Значение);
			УстановитьДатыОповещенийСОшибками(Данные, Контекст.ДатыОповещенийСОшибкамиПоПользователям);
			ИдентификаторОбсуждения = Контекст.ИдентификаторыЛичныхОбсуждений.Получить(ИдентификаторПользователяИБ);
			Если ИдентификаторОбсуждения = Неопределено Тогда
				ИдентификаторОбсуждения = ИдентификаторЛичногоОбсуждения(ИдентификаторПользователяИБ);
			КонецЕсли;
			Если ОтправитьСообщение(Данные, ИдентификаторОбсуждения) Тогда
				Контекст.ДатыУспешнойОтправкиОповещенийПоПользователям.Вставить(ИдентификаторПользователяИБ, ТекущаяДатаСеанса());
			Иначе
				Если Контекст.ДатыОповещенийСОшибкамиПоПользователям.Получить(ИдентификаторПользователяИБ) = Неопределено Тогда
					Контекст.ДатыОповещенийСОшибкамиПоПользователям.Вставить(ИдентификаторПользователяИБ, Данные.ДатаДобавления);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповеститьОбАктивности(СостояниеОтправки, МинимальныйПериодПоПользователям, Контекст)
	
	АдресатыPing = Новый Соответствие;
	ДатаСледующейПроверки = СостояниеОтправки.ДатаПоследнейПроверки
		+ СостояниеОтправки.МинимальныйПериодПроверки + 3;
	
	Для Каждого ОписаниеПериода Из МинимальныйПериодПоПользователям Цикл
		Если Контекст.ДатыОповещенийСОшибкамиПоПользователям.Получить("ВсеПользователи") <> Неопределено
		 Или Контекст.ДатыОповещенийСОшибкамиПоПользователям.Получить(ОписаниеПериода.Ключ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДатаОтправки = Контекст.ДатыУспешнойОтправкиОповещенийПоПользователям.Получить(ОписаниеПериода.Ключ);
		ОбщаяДатаОтправки = Контекст.ДатыУспешнойОтправкиОповещенийПоПользователям.Получить("ВсеПользователи");
		Если ДатаОтправки = Неопределено Или ОбщаяДатаОтправки <> Неопределено И ДатаОтправки < ОбщаяДатаОтправки Тогда
			ДатаОтправки = ОбщаяДатаОтправки;
		КонецЕсли;
		Если ДатаОтправки = Неопределено Тогда
			ДатаОтправки = СостояниеОтправки.ДатыУспешнойОтправкиОповещенийПоПользователям.Получить(ОписаниеПериода.Ключ);
			ОбщаяДатаОтправки = СостояниеОтправки.ДатыУспешнойОтправкиОповещенийПоПользователям.Получить("ВсеПользователи");
			Если ДатаОтправки = Неопределено Или ОбщаяДатаОтправки <> Неопределено И ДатаОтправки < ОбщаяДатаОтправки Тогда
				ДатаОтправки = ОбщаяДатаОтправки;
			КонецЕсли;
		КонецЕсли;
		Если ДатаОтправки = Неопределено
		 Или ДатаОтправки + ОписаниеПериода.Значение > ДатаСледующейПроверки Тогда
			АдресатыPing.Вставить(ОписаниеПериода.Ключ, Новый Массив);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(АдресатыPing) Тогда
		Данные = НовыеДанныеСообщения();
		Данные.ИмяОповещения = "НетСерверныхОповещений";
		ОтправитьАдресноеСообщение(Данные, АдресатыPing, Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Возвращаемое значение:
//  Структура:
//   * ИмяОповещения           - см. ОтправитьСерверноеОповещение.ИмяОповещения
//   * Результат               - см. ОтправитьСерверноеОповещение.Результат
//   * Адресаты                - см. ОтправитьСерверноеОповещение.Адресаты
//   * ИдентификаторОповещения - Строка - строка уникального идентификатора.
//   * ДатаДобавления          - Дата - дата добавления оповещения.
//   * Ошибки - Соответствие из КлючИЗначение:
//       ** Ключ - УникальныйИдентификатор - идентификатор пользователя ИБ.
//       ** Значение - Дата - дата первого оповещения с ошибкой (которое не удалось отправить).
//   * ОтправленоИзОчереди - Булево - если истина, то отправлено из очереди по порядку
//       добавления в очередь, то есть можно учитывать и сдвигать указатель даты последнего оповещения.
//
Функция НовыеДанныеСообщения() Экспорт
	
	Данные = Новый Структура;
	Данные.Вставить("ИмяОповещения", "");
	Данные.Вставить("Результат");
	Данные.Вставить("Адресаты", Новый Соответствие);
	Данные.Вставить("ИдентификаторОповещения", "");
	Данные.Вставить("ДатаДобавления", '00010101');
	Данные.Вставить("Ошибки", Новый Соответствие);
	Данные.Вставить("ОтправленоИзОчереди", Истина);
	
	Возврат Данные;
	
КонецФункции

Функция СообщениеУжеОтправлено(СостояниеОтправки, Выборка, ИдентификаторПользователяИБ)
	
	Если Выборка.ЗаписаноВСистемуВзаимодействия Тогда
		Возврат Истина;
	КонецЕсли;
	
	ДатаОповещенияСОшибкой =
		СостояниеОтправки.ДатыОповещенийСОшибкамиПоПользователям.Получить("ВсеПользователи");
	
	Если ДатаОповещенияСОшибкой = Неопределено Тогда
		ДатаОповещенияСОшибкой = СостояниеОтправки.ДатаПоследнегоОповещения;
	КонецЕсли;
	
	Возврат Выборка.ДатаДобавления < ДатаОповещенияСОшибкой;
	
КонецФункции

Процедура УстановитьДатыОповещенийСОшибками(Данные, ДатыОповещенийСОшибкамиПоПользователям,
			ИдентификаторПользователяИБ = Неопределено)
	
	Данные.Ошибки = Новый Соответствие;
	
	Если ИдентификаторПользователяИБ = Неопределено Тогда
		Для Каждого КлючИЗначение Из ДатыОповещенийСОшибкамиПоПользователям Цикл
			Если Данные.Адресаты.Получить(КлючИЗначение.Ключ) <> Неопределено Тогда
				Данные.Ошибки.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ДатаОповещенияСОшибкой = ДатыОповещенийСОшибкамиПоПользователям.Получить(ИдентификаторПользователяИБ);
		Если ДатаОповещенияСОшибкой <> Неопределено Тогда
			Данные.Ошибки.Вставить(ИдентификаторПользователяИБ, ДатаОповещенияСОшибкой);
		КонецЕсли;
	КонецЕсли;
	
	ДатаОповещенияСОшибкой = ДатыОповещенийСОшибкамиПоПользователям.Получить("ВсеПользователи");
	Если ДатаОповещенияСОшибкой <> Неопределено Тогда
		Данные.Ошибки.Вставить("ВсеПользователи", ДатаОповещенияСОшибкой);
	КонецЕсли;
	
КонецПроцедуры

Функция МаксимальныйПериодПовторенияДоставки()
	
	Возврат 120;
	
КонецФункции

Функция НовыеСерверныеОповещения(ДатаПоследнегоОповещения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаПоследнегоОповещения", ДатаПоследнегоОповещения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтправленныеСерверныеОповещения.ИдентификаторОповещения КАК ИдентификаторОповещения,
	|	ОтправленныеСерверныеОповещения.СодержимоеОповещения КАК СодержимоеОповещения,
	|	ОтправленныеСерверныеОповещения.ДатаДобавления КАК ДатаДобавления,
	|	ОтправленныеСерверныеОповещения.ЗаписаноВСистемуВзаимодействия КАК ЗаписаноВСистемуВзаимодействия
	|ИЗ
	|	РегистрСведений.ОтправленныеСерверныеОповещения КАК ОтправленныеСерверныеОповещения
	|ГДЕ
	|	ОтправленныеСерверныеОповещения.ДатаДобавления >= &ДатаПоследнегоОповещения
	|	И &Отбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтправленныеСерверныеОповещения.ДатаДобавления,
	|	ОтправленныеСерверныеОповещения.ДатаДобавленияМиллисекунды";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отбор",
		?(ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных(), "ИСТИНА",
			"ОтправленныеСерверныеОповещения.ОбластьДанныхВспомогательныеДанные = 0"));
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//   * Параметры - Произвольный - смотри НовоеСерверноеОповещение.Параметры.
//   * Адресаты - Соответствие из КлючИЗначение:
//      ** Ключ - УникальныйИдентификатор - идентификатор пользователя ИБ.
//      ** Значение - Массив из см. СерверныеОповещения.КлючСеанса
//
Функция НовыйВариантПараметровСерверногоОповещения()
	
	ВариантПараметров = Новый Структура;
	ВариантПараметров.Вставить("Параметры");
	ВариантПараметров.Вставить("Адресаты", Новый Соответствие);
	
	Возврат ВариантПараметров;
	
КонецФункции

// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - Строка - смотри НовоеСерверноеОповещение.Имя
//   * Значение - Структура:
//      ** ИмяМодуляОтправки - Строка - смотри НовоеСерверноеОповещение.ИмяМодуляОтправки
//      ** ПериодПроверки - Число - смотри НовоеСерверноеОповещение.ПериодПроверки
//      ** ВариантыПараметров - см. СтандартныеПодсистемыСервер.ПриОтправкеСерверногоОповещения.ВариантыПараметров
//
Функция ПериодическиеСерверныеОповещения(МинимальныйПериодПоПользователям)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПериодическиеСерверныеОповещения.КлючСеанса КАК КлючСеанса,
	|	ПериодическиеСерверныеОповещения.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ,
	|	ПериодическиеСерверныеОповещения.Оповещения КАК Оповещения
	|ИЗ
	|	РегистрСведений.ПериодическиеСерверныеОповещения КАК ПериодическиеСерверныеОповещения";
	
	Оповещения = Новый Соответствие;
	ВариантыПараметровОповещенийПоКлючамЗначений = Новый Соответствие;
	
	КлючиАктивныхСеансов = Новый Соответствие;
	Сеансы = ПолучитьСеансыИнформационнойБазы();
	Для Каждого Сеанс Из Сеансы Цикл
		КлючиАктивныхСеансов.Вставить(КлючСеанса(Сеанс), Истина);
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если КлючиАктивныхСеансов.Получить(Выборка.КлючСеанса) = Неопределено Тогда
			НаборЗаписей = СлужебныйНаборЗаписей(РегистрыСведений.ПериодическиеСерверныеОповещения);
			НаборЗаписей.Отбор.КлючСеанса.Установить(Выборка.КлючСеанса);
			НаборЗаписей.Записать();
			Продолжить;
		КонецЕсли;
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
			Выборка.ИдентификаторПользователяИБ);
		Если ПользовательИБ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОповещенияСеанса = ПериодическиеСерверныеОповещенияСеанса(Выборка.Оповещения);
		Если Не ЗначениеЗаполнено(ОповещенияСеанса) Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого КлючИЗначение Из ОповещенияСеанса Цикл
			ИмяОповещения = КлючИЗначение.Ключ;
			Если ТипЗнч(КлючИЗначение.Значение) <> Тип("Структура") Тогда
				Продолжить;
			КонецЕсли;
			Оповещение = Оповещения.Получить(ИмяОповещения);
			Если Оповещение = Неопределено Тогда
				Оповещение = Новый Структура;
				Оповещение.Вставить("ИмяМодуляОтправки", "");
				Оповещение.Вставить("ПериодПроверки", 20*60);
				ЗаполнитьЗначенияСвойств(Оповещение, КлючИЗначение.Значение);
				Оповещение.Вставить("ВариантыПараметров", Новый Массив);
				Оповещения.Вставить(ИмяОповещения, Оповещение);
			КонецЕсли;
			ПараметрыОповещения = Неопределено;
			КлючИЗначение.Значение.Свойство("Параметры", ПараметрыОповещения);
			ВариантыПараметровПоКлючамЗначений = ВариантыПараметровОповещенийПоКлючамЗначений.Получить(ИмяОповещения);
			Если ВариантыПараметровПоКлючамЗначений = Неопределено Тогда
				ВариантыПараметровПоКлючамЗначений = Новый Соответствие;
				ВариантыПараметровОповещенийПоКлючамЗначений.Вставить(ИмяОповещения, ВариантыПараметровПоКлючамЗначений);
			КонецЕсли;
			КлючЗначенияПараметров = ЗначениеВСтрокуВнутр(ПараметрыОповещения);
			ВариантПараметров = ВариантыПараметровПоКлючамЗначений.Получить(КлючЗначенияПараметров);
			Если ВариантПараметров = Неопределено Тогда
				ВариантПараметров = НовыйВариантПараметровСерверногоОповещения();
				ВариантыПараметровПоКлючамЗначений.Вставить(КлючЗначенияПараметров, ВариантПараметров);
				ВариантПараметров.Параметры = ПараметрыОповещения;
				Оповещение.ВариантыПараметров.Добавить(ВариантПараметров);
			КонецЕсли;
			КлючиСеансов = ВариантПараметров.Адресаты.Получить(Выборка.ИдентификаторПользователяИБ);
			Если КлючиСеансов = Неопределено Тогда
				КлючиСеансов = Новый Массив;
				ВариантПараметров.Адресаты.Вставить(Выборка.ИдентификаторПользователяИБ, КлючиСеансов);
			КонецЕсли;
			Если КлючиСеансов.Найти(Выборка.КлючСеанса) = Неопределено Тогда
				КлючиСеансов.Добавить(Выборка.КлючСеанса);
			КонецЕсли;
			Если МинимальныйПериодПоПользователям <> Неопределено Тогда
				ТекущийПериод = МинимальныйПериодПоПользователям.Получить(Выборка.ИдентификаторПользователяИБ);
				Если ТекущийПериод = Неопределено
				 Или ТекущийПериод > Оповещение.ПериодПроверки Тогда
					МинимальныйПериодПоПользователям.Вставить(Выборка.ИдентификаторПользователяИБ,
						Оповещение.ПериодПроверки);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Оповещения;
	
КонецФункции

Процедура ОбновитьЗаданиеОтправкаСерверныхОповещенийКлиентамЕслиНетОповещений(МинимальныйПериодПроверки)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЗначениеИстина
	|ИЗ
	|	РегистрСведений.ПериодическиеСерверныеОповещения КАК ПериодическиеСерверныеОповещения";
	
	ЗаданиеОтключено = Ложь;
	Если Запрос.Выполнить().Пустой() Тогда
		Блокировка = Новый БлокировкаДанных;
		Блокировка.Добавить("РегистрСведений.ПериодическиеСерверныеОповещения");
		
		НачатьТранзакцию();
		Попытка
			Блокировка.Заблокировать();
			Если Запрос.Выполнить().Пустой() Тогда
				НастроитьЗаданиеОтправкаСерверныхОповещенийКлиентам(Ложь);
				ЗаданиеОтключено = Истина;
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЕсли;
	
	Если Не ЗаданиеОтключено Тогда
		НастроитьЗаданиеОтправкаСерверныхОповещенийКлиентам(Истина, МинимальныйПериодПроверки);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ХранилищеОповещений - ХранилищеЗначений
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ     - Строка - смотри СерверныеОповещения.НовоеСерверноеОповещение.Имя
//   * Значение - см. СерверныеОповещения.НовоеСерверноеОповещение
//
Функция ПериодическиеСерверныеОповещенияСеанса(ХранилищеОповещений)
	
	Если ТипЗнч(ХранилищеОповещений) <> Тип("ХранилищеЗначения") Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	Оповещения = ХранилищеОповещений.Получить();
	Если ТипЗнч(Оповещения) <> Тип("Соответствие") Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	Возврат Оповещения;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//   * ДатаПоследнейПроверки - Дата
//   * МинимальныйПериодПроверки - Число
//   * ДатыПроверкиПоИменамОповещений - Соответствие из КлючИЗначение:
//       ** Ключ     - Строка - смотри НовоеСерверноеОповещение.Имя
//       ** Значение - Дата
//   * ДатаПоследнегоОповещения - Дата - дата последнего из отправляемых оповещений.
//   * ДатаОповещенияСОшибкой   - Дата - дата оповещения, на котором возникла ошибка.
//   * ДатыОповещенийСОшибкамиПоПользователям - Соответствие из КлючИЗначение:
//       ** Ключ     - УникальныйИдентификатор - идентификатор пользователя ИБ.
//       ** Значение - Дата - дата оповещения, на котором возникла ошибка.
//   * ДатыУспешнойОтправкиОповещенийПоПользователям - Соответствие из КлючИЗначение:
//       ** Ключ     - УникальныйИдентификатор - идентификатор пользователя ИБ.
//       ** Значение - Дата.
//   * ИдентификаторФоновогоЗадания - УникальныйИдентификатор
//   * ДатаПоследнейОчисткиСообщений - Дата
//
Функция СостояниеОтправкиСерверныхОповещений()
	
	Состояние = Новый Структура;
	Состояние.Вставить("ДатаПоследнейПроверки", '00010101');
	Состояние.Вставить("МинимальныйПериодПроверки", 0);
	Состояние.Вставить("ДатыПроверкиПоИменамОповещений", Новый Соответствие);
	Состояние.Вставить("ДатаПоследнегоОповещения", '00010101');
	Состояние.Вставить("ДатаОповещенияСОшибкой", '00010101');
	Состояние.Вставить("ДатыОповещенийСОшибкамиПоПользователям", Новый Соответствие);
	Состояние.Вставить("ДатыУспешнойОтправкиОповещенийПоПользователям", Новый Соответствие);
	Состояние.Вставить("ИдентификаторФоновогоЗадания",
		ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	Состояние.Вставить("ДатаПоследнейОчисткиСообщений", '00010101');
	
	Значение = Константы.СостояниеОтправкиСерверныхОповещений.Получить();
	Если ТипЗнч(Значение) = Тип("ХранилищеЗначения") Тогда
		ТекущееСостояние = Значение.Получить();
		Если ТипЗнч(ТекущееСостояние) = Тип("Структура") Тогда
			Для Каждого КлючИЗначение Из ТекущееСостояние Цикл
				Если ТипЗнч(Состояние[КлючИЗначение.Ключ]) = ТипЗнч(КлючИЗначение.Значение) Тогда
					Состояние[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Состояние;
	
КонецФункции

Процедура ОбновитьСостояниеОтправки(НовоеСостояниеОтправки, ИменаСвойств)
	
	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить("Константа.СостояниеОтправкиСерверныхОповещений");
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		СостояниеОтправки = СостояниеОтправкиСерверныхОповещений();
		Если СтрНайти(ИменаСвойств, "ДатыУспешнойОтправкиОповещенийПоПользователям") > 0 Тогда
			НовыеДаты = НовоеСостояниеОтправки.ДатыУспешнойОтправкиОповещенийПоПользователям;
			Для Каждого КлючИЗначение Из СостояниеОтправки.ДатыУспешнойОтправкиОповещенийПоПользователям Цикл
				НоваяДата = НовыеДаты.Получить(КлючИЗначение.Ключ);
				Если НоваяДата <> Неопределено И НоваяДата < КлючИЗначение.Значение Тогда
					НовыеДаты.Вставить(КлючИЗначение.Ключ, НоваяДата);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Записать = Ложь;
		Для Каждого КлючИЗначение Из Новый Структура(ИменаСвойств) Цикл
			ИмяСвойства = КлючИЗначение.Ключ;
			Если СостояниеОтправки[ИмяСвойства] = НовоеСостояниеОтправки[ИмяСвойства] Тогда
				Продолжить;
			КонецЕсли;
			СостояниеОтправки[ИмяСвойства] = НовоеСостояниеОтправки[ИмяСвойства];
			Записать = Истина;
		КонецЦикла;
		Если Записать Тогда
			МенеджерЗначения = СлужебныйМенеджерЗначения(Константы.СостояниеОтправкиСерверныхОповещений);
			МенеджерЗначения.Значение = Новый ХранилищеЗначения(СостояниеОтправки);
			МенеджерЗначения.Записать();
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось установить константу %1 по причине:
			           |%2'"),
			"СостояниеОтправкиСерверныхОповещений",
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Серверные оповещения.Ошибка работы фонового задания'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Возвращаемое значение:
//   см. СостояниеОтправкиСерверныхОповещений
//
Функция СостояниеОтправкиПриЗапускеФоновогоЗадания()
	
	ТекущийСеанс = ПолучитьТекущийСеансИнформационнойБазы();
	Если ТекущийСеанс.ИмяПриложения <> "BackgroundJob" Тогда
		Возврат СостояниеОтправкиСерверныхОповещений();
	КонецЕсли;
	
	ТекущееФоновоеЗадание = ТекущийСеанс.ПолучитьФоновоеЗадание();
	Если ТекущееФоновоеЗадание = Неопределено Тогда
		Возврат СостояниеОтправкиСерверныхОповещений();
	КонецЕсли;
	
	СостояниеОтправки = Неопределено;
	
	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить("Константа.СостояниеОтправкиСерверныхОповещений");
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		СостояниеОтправки = СостояниеОтправкиСерверныхОповещений();
		Если ОтправкаСерверныхОповещенийКлиентамУжеВыполняется(СостояниеОтправки) Тогда
			СостояниеОтправки = Неопределено;
		Иначе
			СостояниеОтправки.ИдентификаторФоновогоЗадания = ТекущееФоновоеЗадание.УникальныйИдентификатор;
			МенеджерЗначения = СлужебныйМенеджерЗначения(Константы.СостояниеОтправкиСерверныхОповещений);
			МенеджерЗначения.Значение = Новый ХранилищеЗначения(СостояниеОтправки);
			МенеджерЗначения.Записать();
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		СостояниеОтправки = Неопределено;
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось установить константу %1 по причине:
			           |%2'"),
			"СостояниеОтправкиСерверныхОповещений",
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Серверные оповещения.Ошибка запуска фонового задания'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
	КонецПопытки;
	
	Возврат СостояниеОтправки;
	
КонецФункции

Функция ОтправкаСерверныхОповещенийКлиентамУжеВыполняется(СостояниеОтправки)
	
	ИсполняющееФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(
		СостояниеОтправки.ИдентификаторФоновогоЗадания);
	
	Возврат ИсполняющееФоновоеЗадание <> Неопределено
	      И ИсполняющееФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно;
	
КонецФункции

Процедура УдалитьУстаревшиеОповещения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГраницаУстаревания", ТекущаяДатаСеанса() - 60*60);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтправленныеСерверныеОповещения.ИдентификаторОповещения КАК ИдентификаторОповещения
	|ИЗ
	|	РегистрСведений.ОтправленныеСерверныеОповещения КАК ОтправленныеСерверныеОповещения
	|ГДЕ
	|	ОтправленныеСерверныеОповещения.ДатаДобавления < &ГраницаУстаревания
	|	И &Отбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтправленныеСерверныеОповещения.ДатаДобавления,
	|	ОтправленныеСерверныеОповещения.ДатаДобавленияМиллисекунды";
	
	ДоступноИспользованиеРазделенныхДанных = ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных();
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отбор",
		?(ДоступноИспользованиеРазделенныхДанных, "ИСТИНА",
			"ОтправленныеСерверныеОповещения.ОбластьДанныхВспомогательныеДанные = 0"));
	
	ПустойНаборЗаписей = СлужебныйНаборЗаписей(РегистрыСведений.ОтправленныеСерверныеОповещения);
	Если Не ДоступноИспользованиеРазделенныхДанных Тогда
		ПустойНаборЗаписей.Отбор.ОбластьДанныхВспомогательныеДанные.Установить(0);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПустойНаборЗаписей.Отбор.ИдентификаторОповещения.Установить(Выборка.ИдентификаторОповещения);
		ПустойНаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Возвращаемое значение:
//  Структура:
//   * КлючСеанса - см. КлючСеанса
//   * ИдентификаторПользователяИБ - УникальныйИдентификатор - идентификатор текущего пользователя.
//   * ДатаПоследнегоОповещения - Дата
//   * Оповещения - см. ОбщегоНазначенияПереопределяемый.ПриДобавленииСерверныхОповещений.Оповещения
//   * МинимальныйПериод - Число - число секунд.
//   * ИдентификаторЛичногоОбсуждения - Неопределено - обсуждение недоступно.
//                                    - ИдентификаторОбсужденияСистемыВзаимодействия - идентификатор
//                                        обсуждения "СерверныеОповещения <Идентификатор пользователя ИБ>".
//   * ИдентификаторОбщегоОбсуждения - Неопределено - обсуждение недоступно.
//                                   - ИдентификаторОбсужденияСистемыВзаимодействия - идентификатор
//                                        обсуждения "СерверныеОповещения".
//   * СеансАдминистратораСервиса - Булево
//
Функция ПараметрыСерверныхОповещенийЭтогоСеанса() Экспорт
	
	Оповещения = ДобавленныеОповещенияСеанса();
	
	Параметры = Новый Структура;
	Параметры.Вставить("КлючСеанса", КлючСеанса());
	Параметры.Вставить("ИдентификаторПользователяИБ",
		ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
	Параметры.Вставить("ДатаПоследнегоОповещения", НачалоТекущегоСеансаВЧасовомПоясеТекущейДатыСеанса());
	Параметры.Вставить("Оповещения", Оповещения);
	Параметры.Вставить("МинимальныйПериод", 20*60);
	Параметры.Вставить("ИдентификаторЛичногоОбсуждения", Неопределено);
	Параметры.Вставить("ИдентификаторОбщегоОбсуждения", Неопределено);
	Параметры.Вставить("СеансАдминистратораСервиса", СеансАдминистратораСервиса());
	
	ПериодическиеОповещения = Новый Соответствие;
	Для Каждого КлючИЗначение Из Оповещения Цикл
		Оповещение = КлючИЗначение.Значение;
		Если Не ЗначениеЗаполнено(Оповещение.Имя)
		 Или КлючИЗначение.Ключ <> Оповещение.Имя Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В процедуре ""%1""
				           |не заполнено или некорректно заполнено имя оповещения
				           |%2 = ""%3""
				           |%4 = ""%5"".'"),
					"ОбщегоНазначенияПереопределяемый.ПриДобавленииСерверныхОповещений",
					"Ключ", КлючИЗначение.Ключ, "Оповещение.Имя", Оповещение.Имя);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Оповещение.ИмяМодуляПолучения) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В процедуре ""%1""
				           |у оповещения ""%2""
				           |не заполнено свойство ""%3"".'"),
					"ОбщегоНазначенияПереопределяемый.ПриДобавленииСерверныхОповещений",
					Оповещение.Имя, "ИмяМодуляПолучения");
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		Если Метаданные.ОбщиеМодули.Найти(Оповещение.ИмяМодуляПолучения) = Неопределено Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В процедуре ""%1""
				           |у оповещения ""%2""
				           |в свойстве ""%3"" указан несуществующий общий модуль
				           |""%4"".'"),
					"ОбщегоНазначенияПереопределяемый.ПриДобавленииСерверныхОповещений",
					Оповещение.Имя, "ИмяМодуляПолучения", Оповещение.ИмяМодуляПолучения);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Оповещение.ИмяМодуляОтправки) Тогда
			Продолжить;
		КонецЕсли;
		Если Метаданные.ОбщиеМодули.Найти(Оповещение.ИмяМодуляОтправки) = Неопределено Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В процедуре ""%1""
				           |у оповещения ""%2""
				           |в свойстве ""%3"" указан несуществующий общий модуль
				           |""%4"".'"),
					"ОбщегоНазначенияПереопределяемый.ПриДобавленииСерверныхОповещений",
					Оповещение.Имя, "ИмяМодуляОтправки", Оповещение.ИмяМодуляОтправки);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		Если Параметры.СеансАдминистратораСервиса Тогда
			Продолжить;
		КонецЕсли;
		ПериодическиеОповещения.Вставить(КлючИЗначение.Ключ, Оповещение);
		Если Параметры.МинимальныйПериод > Оповещение.ПериодПроверки Тогда
			Параметры.МинимальныйПериод = Оповещение.ПериодПроверки;
		КонецЕсли;
	КонецЦикла;
	
	Если Параметры.СеансАдминистратораСервиса Тогда
		Возврат Параметры;
	КонецЕсли;
	
	УточнитьМинимальныйПериодПроверки(Параметры.МинимальныйПериод);
	
	Если ЗначениеЗаполнено(ПериодическиеОповещения) Тогда
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей = СлужебныйНаборЗаписей(РегистрыСведений.ПериодическиеСерверныеОповещения);
		НаборЗаписей.Отбор.КлючСеанса.Установить(Параметры.КлючСеанса);
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.КлючСеанса = Параметры.КлючСеанса;
		НоваяЗапись.ИдентификаторПользователяИБ =
			ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
		НоваяЗапись.Оповещения = Новый ХранилищеЗначения(ПериодическиеОповещения);
		НоваяЗапись.ДатаДобавления = ТекущаяДатаСеанса();
		НаборЗаписей.Записать();
		НастроитьЗаданиеОтправкаСерверныхОповещенийКлиентам(Истина, Параметры.МинимальныйПериод, Истина);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из Оповещения Цикл
		КлючИЗначение.Значение.Параметры = Неопределено;
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(Параметры, ИдентификаторыОбсуждений());
	
	Возврат Параметры;
	
КонецФункции

Функция НачалоТекущегоСеансаВЧасовомПоясеТекущейДатыСеанса()
	
	// АПК:143-выкл - №643.2.1 Требуется ТекущаяДата сервера, а не ТекущаяДатаСеанса, так как
	// именно ТекущаяДата используется в свойстве НачалоСеанса объекта СеансИнформационнойБазы.
	СдвигВремени = ТекущаяДатаСеанса() - ТекущаяДата();
	// АПК:143-вкл.
	
	Возврат ПолучитьТекущийСеансИнформационнойБазы().НачалоСеанса + СдвигВремени;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//   * ИдентификаторЛичногоОбсуждения - Неопределено - обсуждение недоступно.
//                                    - ИдентификаторОбсужденияСистемыВзаимодействия - идентификатор
//                                        обсуждения "СерверныеОповещения <Идентификатор пользователя ИБ>".
//   * ИдентификаторОбщегоОбсуждения - Неопределено - обсуждение недоступно.
//                                   - ИдентификаторОбсужденияСистемыВзаимодействия - идентификатор
//                                        обсуждения "СерверныеОповещения".
// 
Функция ИдентификаторыОбсуждений()
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторЛичногоОбсуждения");
	Результат.Вставить("ИдентификаторОбщегоОбсуждения");
	
	Если Не ТекущийПользовательЗарегистрированВСистемеВзаимодействия() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИдентификаторЛичногоОбсуждения = ИдентификаторЛичногоОбсуждения();
	Если ИдентификаторЛичногоОбсуждения = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИдентификаторОбщегоОбсуждения = ИдентификаторОбщегоОбсуждения();
	Если ИдентификаторОбщегоОбсуждения = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.ИдентификаторЛичногоОбсуждения = ИдентификаторЛичногоОбсуждения;
	Результат.ИдентификаторОбщегоОбсуждения  = ИдентификаторОбщегоОбсуждения;
	
	Возврат Результат;
	
КонецФункции

Процедура УточнитьМинимальныйПериодПроверки(МинимальныйПериодПроверки)
	
	НижняяГраница = ?(ОбщегоНазначения.РазделениеВключено(), 5*60, 60);
	
	Если МинимальныйПериодПроверки < НижняяГраница Тогда
		МинимальныйПериодПроверки = НижняяГраница;
	КонецЕсли;
	
КонецПроцедуры

Процедура НастроитьЗаданиеОтправкаСерверныхОповещенийКлиентам(Включить, ПериодПовтора = 0, ПриЗапуске = Ложь)
	
	Попытка
		НастроитьЗаданиеОтправкаСерверныхОповещенийКлиентамБезПопытки(Включить, ПериодПовтора, ПриЗапуске);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось настроить регламентное задание
			           |""%1"" по причине:
			           |%2'"),
			Метаданные.РегламентныеЗадания.ОтправкаСерверныхОповещенийКлиентам.Имя,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Серверные оповещения.Ошибка настройки регламентного задания'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

Процедура НастроитьЗаданиеОтправкаСерверныхОповещенийКлиентамБезПопытки(Включить, ПериодПовтора, ПриЗапуске)
	
	ИмяПользователя = "";
	Если ЗначениеЗаполнено(ИмяПользователя())
	 Или Не ПриЗапуске
	   И ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() <> 0 Тогда
		Попытка
			ПользовательИБ = СлужебныйПользовательИБ();
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось создать служебного пользователя ""%1"" по причине:
				           |%2'"),
				ИмяСлужебногоПользователя(),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
		Если ПользовательИБ <> Неопределено Тогда
			ИмяПользователя = ПользовательИБ.Имя;
		КонецЕсли;
	КонецЕсли;
	
	МинимальныйПериодПовтора = 60;
	МаксимальныйПериодПовтора = 20*60;
	УточнитьМинимальныйПериодПроверки(МинимальныйПериодПовтора);
	
	Если ЗначениеЗаполнено(ПериодПовтора) Тогда
		Если ПериодПовтора < МинимальныйПериодПовтора Тогда
			ПериодПовтора = МинимальныйПериодПовтора;
		ИначеЕсли ПериодПовтора > МаксимальныйПериодПовтора Тогда
			ПериодПовтора = МаксимальныйПериодПовтора;
		Иначе
			ЦелыхДолей = Цел(ПериодПовтора / 15);
			Остаток = ПериодПовтора - ЦелыхДолей * 15;
			Если Остаток <> 0 Тогда
				ПериодПовтора = ЦелыхДолей * 15;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ПериодПовтора = МаксимальныйПериодПовтора;
	КонецЕсли;
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	Расписание.ПериодПовтораДней = 1;
	Расписание.ПериодПовтораВТечениеДня = ПериодПовтора;
	
	МетаданныеЗадания = Метаданные.РегламентныеЗадания.ОтправкаСерверныхОповещенийКлиентам;
	ПараметрыЗадания = Новый Структура("Ключ, ИнтервалПовтораПриАварийномЗавершении,
	|КоличествоПовторовПриАварийномЗавершении");
	ЗаполнитьЗначенияСвойств(ПараметрыЗадания, МетаданныеЗадания);
	ПараметрыЗадания.Вставить("Использование", Включить);
	ПараметрыЗадания.Вставить("ИмяПользователя", ИмяПользователя);
	ПараметрыЗадания.Вставить("Расписание", Расписание);
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Отбор = Новый Структура("ИмяМетода", МетаданныеЗадания.ИмяМетода);
	Иначе
		Отбор = Новый Структура("Метаданные", МетаданныеЗадания);
	КонецЕсли;
	НайденныеЗадания = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	
	Если НайденныеЗадания.Количество() > 1 Тогда
		Для Каждого НайденноеЗадание Из НайденныеЗадания Цикл
			Если НайденноеЗадание = НайденныеЗадания[0] Тогда
				Продолжить;
			КонецЕсли;
			РегламентныеЗаданияСервер.УдалитьЗадание(НайденноеЗадание);
		КонецЦикла;
	КонецЕсли;
	
	Если НайденныеЗадания.Количество() = 0 Тогда
		НачатьТранзакцию();
		Попытка
			РегламентныеЗаданияСервер.ЗаблокироватьРегламентноеЗадание(МетаданныеЗадания);
			НайденныеЗадания = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
			Если НайденныеЗадания.Количество() = 0 Тогда
				ПараметрыЗадания.Вставить("Метаданные", МетаданныеЗадания);
				РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
				ОбновитьСостояниеОтправки(Новый Структура("МинимальныйПериодПроверки", ПериодПовтора),
					"МинимальныйПериодПроверки");
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки
	КонецЕсли;
	
	Если НайденныеЗадания.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Задание = НайденныеЗадания[0];
	Если ПараметрыЗаданияСовпадают(Задание, ПараметрыЗадания, ПриЗапуске) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		РегламентныеЗаданияСервер.ЗаблокироватьРегламентноеЗадание(Задание.УникальныйИдентификатор);
		НайденныеЗадания = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
		Если НайденныеЗадания.Количество() = 0
		 Или НайденныеЗадания[0].УникальныйИдентификатор <> Задание.УникальныйИдентификатор Тогда
			НастроитьЗаданиеОтправкаСерверныхОповещенийКлиентамБезПопытки(Включить, ПериодПовтора, ПриЗапуске);
		ИначеЕсли Не ПараметрыЗаданияСовпадают(НайденныеЗадания[0], ПараметрыЗадания, ПриЗапуске) Тогда
			Если ПриЗапуске И ПериодПовтора >= НайденныеЗадания[0].Расписание.ПериодПовтораВТечениеДня Тогда
				ПараметрыЗадания.Удалить("Расписание");
			КонецЕсли;
			РегламентныеЗаданияСервер.ИзменитьЗадание(НайденныеЗадания[0].УникальныйИдентификатор, ПараметрыЗадания);
			Если ПараметрыЗадания.Свойство("Расписание") Тогда
				ОбновитьСостояниеОтправки(Новый Структура("МинимальныйПериодПроверки", ПериодПовтора),
					"МинимальныйПериодПроверки");
			КонецЕсли;
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки
	
КонецПроцедуры

Функция ПараметрыЗаданияСовпадают(Задание, ПараметрыЗадания, ПриЗапуске)
	
	Для Каждого КлючИЗначение Из ПараметрыЗадания Цикл
		Если Задание[КлючИЗначение.Ключ] = КлючИЗначение.Значение Тогда
			Продолжить;
		КонецЕсли;
		Если КлючИЗначение.Ключ = "Расписание" Тогда
			Если ПриЗапуске Тогда
				Если ПараметрыЗадания.Расписание.ПериодПовтораВТечениеДня
				   < Задание.Расписание.ПериодПовтораВТечениеДня Тогда
					Возврат Ложь;
				КонецЕсли;
				НовоеРасписание = Новый РасписаниеРегламентногоЗадания;
				ЗаполнитьЗначенияСвойств(НовоеРасписание, ПараметрыЗадания.Расписание);
				НовоеРасписание.ПериодПовтораВТечениеДня =
					Задание.Расписание.ПериодПовтораВТечениеДня;
			Иначе
				НовоеРасписание = ПараметрыЗадания.Расписание;
			КонецЕсли;
			Если Строка(Задание[КлючИЗначение.Ключ]) = Строка(НовоеРасписание) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Возврат Ложь;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция УровеньЖурналаРегистрацииОшибкиСВ(ИнформацияОбОшибке)
	
	УровеньЖурнала = УровеньЖурналаРегистрации.Ошибка;
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Обсуждения") Тогда
		Возврат УровеньЖурнала;
	КонецЕсли;
	
	МодульОбсуждения = ОбщегоНазначения.ОбщийМодуль("Обсуждения");
	Если МодульОбсуждения.ЭтоОшибкаУстановкиСоединенияССерверомВзаимодействия(ИнформацияОбОшибке) Тогда
		УровеньЖурнала = УровеньЖурналаРегистрации.Предупреждение;
	КонецЕсли;
	
	Возврат УровеньЖурнала;
	
КонецФункции

// Параметры:
//  Служебный - Булево - если Истина и имя текущего пользователя пустое,
//     тогда создать служебного пользователя и установить регламентному заданию.
//
// Возвращаемое значение:
//  Булево
//
Функция ТекущийПользовательЗарегистрированВСистемеВзаимодействия()
	
	Если Не СистемаВзаимодействийПодключена() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	Если Не ЗначениеЗаполнено(ПользовательИБ.Имя)
	 Или Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Обсуждения") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МодульОбсуждения = ОбщегоНазначения.ОбщийМодуль("Обсуждения");
	АвторизованныйПользователь = Пользователи.АвторизованныйПользователь();
	Попытка
		МодульОбсуждения.ПользовательСистемыВзаимодействия(АвторизованныйПользователь);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось зарегистрировать текущего пользователя
			           |""%1 (%2)""
			           |в системе взаимодействия по причине:
			           |%3'"),
			ПользовательИБ.Имя,
			НРег(ПользовательИБ.УникальныйИдентификатор),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Серверные оповещения.Ошибка регистрации пользователя в системе взаимодействия'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрацииОшибкиСВ(ИнформацияОбОшибке),,,
			ТекстОшибки);
			Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция СлужебныйПользовательИБ()
	
	ИмяПользователя = ИмяСлужебногоПользователя();
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);
	РольДляЗапуска = ?(ОбщегоНазначения.РазделениеВключено(),
		Метаданные.Роли.БазовыеПраваБСП, Метаданные.Роли.Администрирование);
	Если ПользовательИБ <> Неопределено Тогда
		Если Не ПользовательИБ.Роли.Содержит(РольДляЗапуска) Тогда
			ПользовательИБ.Роли.Очистить();
			ПользовательИБ.Роли.Добавить(РольДляЗапуска);
			ПользователиСлужебный.ЗаписатьПользователяИнформационнойБазы(ПользовательИБ);
		КонецЕсли;
		Возврат ПользовательИБ;
	КонецЕсли;
	
	Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() = 0 Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеПользователяИБ = Новый Структура;
	ОписаниеПользователяИБ.Вставить("Действие", "Записать");
	ОписаниеПользователяИБ.Вставить("Имя", ИмяСлужебногоПользователя());
	ОписаниеПользователяИБ.Вставить("АутентификацияСтандартная", Истина);
	ОписаниеПользователяИБ.Вставить("ЗапрещеноИзменятьПароль", Истина);
	ОписаниеПользователяИБ.Вставить("ПоказыватьВСпискеВыбора", Ложь);
	ОписаниеПользователяИБ.Вставить("Пароль", Строка(Новый УникальныйИдентификатор));
	ОписаниеПользователяИБ.Вставить("Роли",
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РольДляЗапуска));
	
	Пользователь = Справочники.Пользователи.СоздатьЭлемент();
	Пользователь.Наименование = ИмяСлужебногоПользователя();
	Пользователь.Служебный = Истина;
	Пользователь.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
	Пользователь.Записать();
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);
	Возврат ПользовательИБ;
	
КонецФункции

Функция ИмяСлужебногоПользователя()
	
	Возврат "ОтправкаСерверныхОповещений";
	
КонецФункции

Функция СеансАдминистратораСервиса()
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.БазоваяФункциональность") Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		Возврат МодульРаботаВМоделиСервиса.СеансЗапущенБезРазделителей();
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция СистемаВзаимодействийПодключена() Экспорт
	
	Если СеансАдминистратораСервиса() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Обсуждения") Тогда
		МодульОбсуждения = ОбщегоНазначения.ОбщийМодуль("Обсуждения");
		Результат = МодульОбсуждения.СистемаВзаимодействийПодключена();
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторЛичногоОбсуждения(ИдентификаторПользователяИБ = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	Если ИдентификаторПользователяИБ = Неопределено Тогда
		УникальныйИдентификатор = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
	Иначе
		УникальныйИдентификатор = ИдентификаторПользователяИБ;
	КонецЕсли;
	КлючЛичногоОбсуждения = "СерверныеОповещения" + "_" + НРег(УникальныйИдентификатор);
	
	Попытка
		ОбновлятьУчастниковОбсуждения = Ложь;
		Если ИдентификаторПользователяИБ = Неопределено Тогда
			ИдентификаторТекущегоПользователя = СистемаВзаимодействия.ИдентификаторТекущегоПользователя();
			ОбновлятьУчастниковОбсуждения = Истина;
		Иначе
			Попытка
				ИдентификаторТекущегоПользователя = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(УникальныйИдентификатор);
				ОбновлятьУчастниковОбсуждения = Истина;
			Исключение
				ИдентификаторТекущегоПользователя = СистемаВзаимодействия.ИдентификаторТекущегоПользователя();
			КонецПопытки;
		КонецЕсли;
		НомерПопытки = 1;
		Создано = Ложь;
		Пока Истина Цикл
			Обсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(КлючЛичногоОбсуждения);
			Если Обсуждение <> Неопределено Тогда
				Прервать;
			КонецЕсли;
			НовоеОбсуждение = СистемаВзаимодействия.СоздатьОбсуждение();
			НовоеОбсуждение.Отображаемое = Ложь;
			НовоеОбсуждение.Ключ = КлючЛичногоОбсуждения;
			НовоеОбсуждение.Участники.Добавить(ИдентификаторТекущегоПользователя);
			Попытка
				НовоеОбсуждение.Записать();
				Обсуждение = НовоеОбсуждение;
				Создано = Истина;
				Прервать;
			Исключение
				НомерПопытки = НомерПопытки + 1;
				Если НомерПопытки > 10 Тогда
					ВызватьИсключение;
				КонецЕсли;
			КонецПопытки;
		КонецЦикла;
		Если Не Создано
		   И (Обсуждение.Отображаемое
		      Или ОбновлятьУчастниковОбсуждения
		        И (Обсуждение.Участники.Количество() <> 1
		           Или Не Обсуждение.Участники.Содержит(ИдентификаторТекущегоПользователя))) Тогда
			Обсуждение.Отображаемое = Ложь;
			Если ОбновлятьУчастниковОбсуждения Тогда
				Обсуждение.Участники.Очистить();
				Обсуждение.Участники.Добавить(ИдентификаторТекущегоПользователя);
			КонецЕсли;
			Обсуждение.Записать();
		КонецЕсли;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось создать личное обсуждение для пользователя ""%1 (%2)"" по причине:
			           |%3'"),
			ПользователиИнформационнойБазы.ТекущийПользователь().Имя,
			НРег(ИдентификаторПользователяИБ),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Серверные оповещения.Ошибка создания личного обсуждения'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрацииОшибкиСВ(ИнформацияОбОшибке),,, ТекстОшибки);
		Возврат Неопределено;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Обсуждение.Идентификатор;
	
КонецФункции

Функция ИдентификаторОбщегоОбсуждения()
	
	КлючОбщегоОбсуждения = "СерверныеОповещения";
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Обсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(КлючОбщегоОбсуждения);
		Создано = Ложь;
		Если Обсуждение = Неопределено Тогда
			Обсуждение = СистемаВзаимодействия.СоздатьОбсуждение();
			Обсуждение.Отображаемое = Ложь;
			Обсуждение.Ключ = КлючОбщегоОбсуждения;
			Обсуждение.Участники.Добавить(СистемаВзаимодействия.СтандартныеПользователи.ВсеПользователиПриложения);
			Попытка
				Обсуждение.Записать();
				Создано = Истина;
			Исключение
				Создано = Ложь;
			КонецПопытки;
			Если Не Создано Тогда
				СуществующееОбсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(КлючОбщегоОбсуждения);
				Если СуществующееОбсуждение <> Неопределено Тогда
					Обсуждение = СуществующееОбсуждение;
				Иначе
					Обсуждение.Записать();
					Создано = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если Не Создано И Обсуждение.Отображаемое Тогда
			Обсуждение.Отображаемое = Ложь;
			Обсуждение.Записать();
		КонецЕсли;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Серверные оповещения.Ошибка создания общего обсуждения'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрацииОшибкиСВ(ИнформацияОбОшибке),,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		Возврат Неопределено;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Обсуждение.Идентификатор;
	
КонецФункции

// Отправляет сообщение с произвольными данными с клиента на сервер.
//
// Выбрасывает исключение, если не удалось отправить сообщение.
//
// Параметры: 
//   Данные - Произвольный - данные для передачи на клиент через систему взаимодействия.
//   ИдентификаторОбсуждения - ИдентификаторОбсужденияСистемыВзаимодействия
//   ОбщееОбсуждение - Булево - если Истина, тогда ИдентификаторОбсуждения указан
//                               для общего обсуждения, иначе для личного.
//
// Возвращаемое значение:
//  Булево - Истина, если успешно записано в систему взаимодействия.
//
Функция ОтправитьСообщение(Данные, ИдентификаторОбсуждения)
	
	Попытка
		НовоеСообщение = СистемаВзаимодействия.СоздатьСообщение(ИдентификаторОбсуждения);
		НовоеСообщение.Данные = Данные;
		НовоеСообщение.Дата   = ТекущаяДатаСеанса();
		НовоеСообщение.Записать();
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось отправить сообщение в обсуждение %1 по причине:
			           |%2'"),
			НРег(ИдентификаторОбсуждения),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Серверные оповещения.Ошибка отправки сообщения'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрацииОшибкиСВ(ИнформацияОбОшибке),,, ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Процедура ОчиститьУстаревшиеСообщения(СостояниеОтправки)
	
	НоваяДата = НачалоЧаса(ТекущаяДатаСеанса());
	Период = 60*60;
	Если СостояниеОтправки.ДатаПоследнейОчисткиСообщений + Период > НоваяДата Тогда
		Возврат;
	КонецЕсли;
	
	Граница = НоваяДата - Период;
	
	Попытка
		ОтборОбсуждений = Новый ОтборОбсужденийСистемыВзаимодействия;
		ОтборОбсуждений.Групповое = Истина;
		ОтборОбсуждений.Отображаемое = Ложь;
		НайденныеОбсуждения = СистемаВзаимодействия.ПолучитьОбсуждения(ОтборОбсуждений);
		Для Каждого Обсуждение Из НайденныеОбсуждения Цикл
			Если Не СтрНачинаетсяС(Обсуждение.Ключ, "СерверныеОповещения") Тогда
				Продолжить;
			КонецЕсли;
			ОтборСообщений = Новый ОтборСообщенийСистемыВзаимодействия;
			ОтборСообщений.Обсуждение = Обсуждение.Идентификатор;
			ОтборСообщений.НаправлениеСортировки = НаправлениеСортировки.Возр;
			Сообщения = СистемаВзаимодействия.ПолучитьСообщения(ОтборСообщений);
			Для Каждого Сообщение Из Сообщения Цикл
				Если Сообщение.Дата < Граница Тогда
					СистемаВзаимодействия.УдалитьСообщение(Сообщение.Идентификатор);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		СостояниеОтправки.ДатаПоследнейОчисткиСообщений = НоваяДата;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Серверные оповещения.Ошибка очистки устаревших сообщений'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрацииОшибкиСВ(ИнформацияОбОшибке),,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;
	
КонецПроцедуры

Функция СлужебныйНаборЗаписей(МенеджерРегистра)
	
	НаборЗаписей = МенеджерРегистра.СоздатьНаборЗаписей();
	НаборЗаписей.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых");
	НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
	НаборЗаписей.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	
	Возврат НаборЗаписей;
	
КонецФункции

Функция СлужебныйМенеджерЗначения(МенеджерКонстанты)
	
	МенеджерЗначения = МенеджерКонстанты.СоздатьМенеджерЗначения();
	МенеджерЗначения.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых");
	МенеджерЗначения.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
	МенеджерЗначения.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	МенеджерЗначения.ОбменДанными.Загрузка = Истина;
	
	Возврат МенеджерЗначения;
	
КонецФункции

#КонецОбласти
