///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область Конструкторы

Функция КонструкторИсторииКонвертацииДанных() Экспорт
	
	ИсторияКонвертацииДанных = Новый Структура;
	ИсторияКонвертацииДанных.Вставить("ТекстыОшибок", Новый Соответствие);
	
	ИсторияКонвертацииДанных.Вставить("ЕстьОшибкаСобытияПередКонвертацией", Ложь);
	
	Возврат ИсторияКонвертацииДанных;
	
КонецФункции

Функция КонструкторИсторииПримененияПКО() Экспорт
	
	ИсторияПримененияПКО = Новый Структура;
	ИсторияПримененияПКО.Вставить("ВнешняяСсылкаСтрокой", "");
	ИсторияПримененияПКО.Вставить("НавигационнаяСсылка", "");
	ИсторияПримененияПКО.Вставить("ДанныеИБСсылка", Неопределено);
	ИсторияПримененияПКО.Вставить("ПравилоКонвертации", Неопределено); // ПКО - СтрокаТаблицыЗначений
	ИсторияПримененияПКО.Вставить("ПолученныеДанныеJSON", Неопределено);
	
	// В процессе конвертации для ошибок и предупреждений используем:
	// - признак с типом булево (отмечаем наличие проблемы);
	// - текстовое описание проблемы, как правило, стек. Вложено в соответствие "ТекстыОшибокПКО".
	//
	// Наименование свойства с текст описанием отличается от признака (булево) только префиксом "Есть". 
	// Например:
	// ЕстьОшибкаОпределенияПКО (булево), а его описание храним в ТекстыОшибокПКО["ОшибкаОпределенияПКО"]
	//
	ИсторияПримененияПКО.Вставить("ТекстыОшибокПКО", Новый Соответствие);
	
	ИсторияПримененияПКО.Вставить("ЕстьОшибкаКонвертацииСтруктурыXDTO", Ложь);
	ИсторияПримененияПКО.Вставить("ЕстьОшибкаКонвертацииСвойстваСтруктурыXDTO", Ложь);
	ИсторияПримененияПКО.Вставить("ЕстьОшибкаОпределенияПКО", Ложь);
	ИсторияПримененияПКО.Вставить("ЕстьОшибкаПоддерживаемыхОбъектовXDTO", Ложь);
	ИсторияПримененияПКО.Вставить("ЕстьОшибкаСобытияПередЗаписьюПолученныхДанных", Ложь);
	ИсторияПримененияПКО.Вставить("ЕстьОшибкаСобытияПриОбработкеСсылокБлокирующихКонвертацию", Ложь);
	ИсторияПримененияПКО.Вставить("ЕстьОшибкаСобытияПослеКонвертацииОбъекта", Ложь);
	ИсторияПримененияПКО.Вставить("ЕстьОшибкаОбработкиУдаленияОбъекта", Ложь);
	
	ИсторияПримененияПКО.Вставить("ЕстьПредупреждениеИзмененияНеразделенныхДанных", Ложь);
	ИсторияПримененияПКО.Вставить("ЕстьПредупреждениеОбъектнойБлокировкиОбъекта", Ложь);
	ИсторияПримененияПКО.Вставить("ЕстьПредупреждениеУстановитьВручнуюСоответствие", Ложь);
	ИсторияПримененияПКО.Вставить("ЕстьПредупреждениеБлокировкиОбъектаДругимиОбъектами", Ложь);
	ИсторияПримененияПКО.Вставить("ЕстьПредупреждениеНеобходимостиПодтвердитьЗагрузкуДанных", Ложь);
	ИсторияПримененияПКО.Вставить("ЕстьПредупреждениеПриПроведении", Ложь);
	ИсторияПримененияПКО.Вставить("ЕстьПредупреждениеПриЗаписи", Ложь);
	ИсторияПримененияПКО.Вставить("ЕстьПредупреждениеПриСохранении", Ложь);
	
	ИсторияПримененияПКО.Вставить("ЕстьИнформированиеОтказаОтКонвертацииОбъекта", Ложь); // Информирование не считаем ошибкой
	
	ИсторияПримененияПКО.Вставить("ДобавленоНовоеСоответствиеПИСО", Ложь);
	ИсторияПримененияПКО.Вставить("ЕслиНетСоответствияИскатьПоКлючам", Истина);
	ИсторияПримененияПКО.Вставить("ЕслиНетСоответствияСоздаватьНовый", Истина);
	ИсторияПримененияПКО.Вставить("ЕслиНетСоответствияУстанавливатьВручную", Ложь);
	ИсторияПримененияПКО.Вставить("ЗагрузкаДанныхТребуетПодтверждения", Ложь);
	ИсторияПримененияПКО.Вставить("ИгнорироватьПроблемыПриЗаписи", Ложь); // Булево - ИСТИНА разрешает конвертации ухудшать состояние объектов ИБ
	
	ИсторияПримененияПКО.Вставить("СтратегияЗаписиОбъекта", ""); // Строка - разрешенные действия: проведение, запись, сохранение
	ИсторияПримененияПКО.Вставить("СтратегияПоискаПоКлючам", КонвертацияОбъектноСервер.ИдентификаторСтандартнойСтратегииПоискаПоКлючам());
	ИсторияПримененияПКО.Вставить("СтратегияПоискаПоКлючамГраница", Неопределено);
	ИсторияПримененияПКО.Вставить("СвойстваУспешнойКонвертации", Новый Соответствие);	// Каждый элемент соответствует шапке или ТЧ объекта.
																						// Значением элемента является строка с именами реквизитов, которые успешно прочитаны.
	ИсторияПримененияПКО.Вставить("СвойстваИсключенныеИзКонвертации", Новый Соответствие);	// Каждый элемент соответствует шапке или ТЧ объекта.
																							// Значением элемента является строка с именами реквизитов, которые не конвертировались.
	ИсторияПримененияПКО.Вставить("СсылкиБлокирующиеКонвертацию", Новый Массив); // Массив из Структура, см. КонвертацияОбъектноСервер.КонструкторСсылкиБлокирующиеКонвертацию()
	ИсторияПримененияПКО.Вставить("ЭтоНовыйОбъект", Неопределено);
	
	Возврат ИсторияПримененияПКО;
	
КонецФункции

Функция КонструкторИсторииПримененияПОД() Экспорт
	
	// Свойства:
	// - "ЕстьОшибкаОбработкиЗапросаВыгрузкиОбъекта" 
	// относиться к конвертации объекта, т.е. не к выполнению ПКО, т.к. это отдельные ветки конвертации.
	
	ИсторияКонвертацииОбъекта = Новый Структура;
	ИсторияКонвертацииОбъекта.Вставить("ЗначениеТипОбъектаXDTO", Неопределено);
	ИсторияКонвертацииОбъекта.Вставить("ЗначениеОбъектXDTO", Неопределено);
	ИсторияКонвертацииОбъекта.Вставить("ЗначениеПОД", Неопределено);
	ИсторияКонвертацииОбъекта.Вставить("ПолученныйОбъект", Неопределено);
	ИсторияКонвертацииОбъекта.Вставить("ОбъектФормата", Неопределено);
	ИсторияКонвертацииОбъекта.Вставить("УказанноеИмяПКО", Неопределено); // Используется при интерактивной работе
	
	ИсторияКонвертацииОбъекта.Вставить("ТекстыОшибокПОД", Новый Соответствие);
	
	ИсторияКонвертацииОбъекта.Вставить("ЕстьОшибкаОпределенияТипаОбъектаXDTO", Ложь);
	ИсторияКонвертацииОбъекта.Вставить("ЕстьОшибкаДесериализацииПоТипуXDTO", Ложь);
	ИсторияКонвертацииОбъекта.Вставить("ЕстьОшибкаОбработкиЗапросаВыгрузкиОбъекта", Ложь);
	ИсторияКонвертацииОбъекта.Вставить("ЕстьОшибкаОпределенияПОД", Ложь);
	ИсторияКонвертацииОбъекта.Вставить("ЕстьОшибкаСобытияПриОбработкеПОД", Ложь);
	ИсторияКонвертацииОбъекта.Вставить("ЕстьОшибкаНепредвиденногоИсключения", Ложь);
	
	Возврат ИсторияКонвертацииОбъекта;
	
КонецФункции

Функция КлючЭлементаСоответствияСвойствШапки() Экспорт
	
	// См. КонструкторИсторииПримененияПКО(), СвойстваУспешнойКонвертации и СвойстваИсключенныеИзКонвертации.
	Возврат "Шапка";
	
КонецФункции

#КонецОбласти

#Область ФиксацияОшибок

Процедура ФиксироватьНеобходимостьПодтвержденияЗагрузкиДанных(КомпонентыОбмена, ПолученныеДанные, ЭтоУдаление = Ложь) Экспорт
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьПредупреждениеНеобходимостиПодтвердитьЗагрузкуДанных = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	Если ЭтоУдаление = Истина Тогда
		
		ШаблонТекста = НСтр("ru ='Удаление объекта %1 не выполнено,
			|т.к. установлена настройка, которая требует подтверждения от пользователя.'", ОбщегоНазначения.КодОсновногоЯзыка());
		
	Иначе
		
		ШаблонТекста = НСтр("ru ='Загрузка объекта %1 не выполнена,
			|т.к. установлена настройка, которая требует подтверждения от пользователя.'", ОбщегоНазначения.КодОсновногоЯзыка());
		
	КонецЕсли;
	
	ПредставлениеОбъекта = КонвертацияОбъектноРецепцияСервер.ПредставлениеОбъектаДляПротокола(ПолученныеДанные);
	ТекстОшибки = СтрШаблон(ШаблонТекста, ПредставлениеОбъекта);
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ТекстыОшибокПКО["ПредупреждениеНеобходимостиПодтвердитьЗагрузкуДанных"] = ТекстОшибки;
	
КонецПроцедуры

Процедура ФиксироватьНеобходимостьРучнойЗагрузкиДанныхЧерезСопоставление(КомпонентыОбмена, ВнешняяСсылкаСтрокой) Экспорт
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьПредупреждениеУстановитьВручнуюСоответствие = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ОбъектМетаданных = ИдентификаторОбъектаМетаданныхИзПравилаКонвертации(КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПравилоКонвертации);
	
	ШаблонТекста = НСтр("ru ='В настройках синхронизации установлена опция запрещающая добавление данных этого типа %1 в автоматическом режиме.
		|Необходимо выполнить сопоставления в ручном режиме, предварительно, при необходимости, создать новые объект.'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ТекстОшибки = СтрШаблон(ШаблонТекста, ОбъектМетаданных);
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ТекстыОшибокПКО["ПредупреждениеУстановитьВручнуюСоответствие"] = ТекстОшибки;
	
КонецПроцедуры

Процедура ФиксироватьОшибкуДесериализацииПоТипуXDTO(КомпонентыОбмена, ТипОбъектаXDTO, СодержимоеЗаписи, ТекстОшибки) Экспорт
	
	КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЕстьОшибкаДесериализацииПоТипуXDTO = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ШаблонОписанияОшибки = НСтр("ru = 'Формат полученных данных к загрузке не соответствуют ожидаемому.
		|
		|Направление: %1
		|Тип формата: %2
		|Данные XML:
		|%3
		|
		|Для устранения проблемы обратитесь к администратору.
		|
		|Описание для разработчика:
		|%4'");
	
	НаправлениеОбмена = КомпонентыОбмена.НаправлениеОбмена;
	
	ОписаниеОшибки = СтрШаблон(ШаблонОписанияОшибки, НаправлениеОбмена, ТипОбъектаXDTO, СодержимоеЗаписи, ТекстОшибки);
	
	КомпонентыОбмена.ИсторияКонвертацииОбъекта.ТекстыОшибокПОД.Вставить("ОшибкаДесериализацииПоТипуXDTO", ОписаниеОшибки);
	
КонецПроцедуры

Процедура ФиксироватьОшибкуИсполненияПКС(КомпонентыОбмена, ПКС, Знач ОписаниеОшибки) Экспорт
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьОшибкаКонвертацииСвойстваСтруктурыXDTO = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ШаблонТекстаОшибки = НСтр("ru = 'При выполнении конвертации свойства структуры объекта XDTO <%1> в свойство конфигурации <%2> возникла ошибка:
		|%3'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	СвойствоФормата = ПКС.СвойствоФормата;
	СвойствоКонфигурации = ПКС.СвойствоКонфигурации;
	
	ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, СвойствоФормата, СвойствоКонфигурации, ОписаниеОшибки);
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ТекстыОшибокПКО["ОшибкаКонвертацииСвойстваСтруктурыXDTO"] = ТекстОшибки;
	
	// Запись в протокол для ошибок конвертации свойств сделаем в ФиксироватьОшибкуКонвертацииСтруктурыОбъектаПоПКО()
	
КонецПроцедуры

Процедура ФиксироватьОшибкуКонвертацииСтруктурыОбъектаПоПКО(КомпонентыОбмена, Знач ОписаниеЭтапа, Знач ПредставлениеОбъекта, Знач ОписаниеОшибки) Экспорт
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьОшибкаКонвертацииСтруктурыXDTO = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ШаблонТекстаОшибки = НСтр("ru ='Конвертация структуры зачитанных данных объекта XDTO в объект информационной базы завершилась ошибкой.
	|	
	|	ПОД: %1
	|	ПКО: %2
	|	Этап: %3
	|	Объект: %4
	|
	|Для устранения проблемы обратитесь к администратору.
	|
	|Описание для разработчика:
	|%5'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ИмяПОД = КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЗначениеПОД.Имя;
	ИмяПКО = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПравилоКонвертации.ИмяПКО;
	
	// Если пришли сюда из-за ошибки конвертации свойства, то уже есть подробности исключений
	Если КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьОшибкаКонвертацииСвойстваСтруктурыXDTO = Истина Тогда
		
		ОписаниеОшибки = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ТекстыОшибокПКО["ОшибкаКонвертацииСвойстваСтруктурыXDTO"];
		
	КонецЕсли;
	
	ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ИмяПОД, ИмяПКО, ОписаниеЭтапа, ПредставлениеОбъекта, ОписаниеОшибки);
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ТекстыОшибокПКО["ОшибкаКонвертацииСтруктурыXDTO"] = ТекстОшибки;
	
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ТекстОшибки, , Ложь);
	
КонецПроцедуры

Процедура ФиксироватьОшибкуОбработкиЗапросаВыгрузкиОбъекта(КомпонентыОбмена, ПравилоКонвертации, ОписаниеСсылкиЗапроса, ПодобраннаяОбъектнаяСсылка, ОписаниеОшибки) Экспорт
	
	КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЕстьОшибкаОбработкиЗапросаВыгрузкиОбъекта = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ШаблонОписанияОшибки = НСтр("ru = 'Приложение корреспондент попросило повторно выгрузить данные, но обработка запроса завершилась с ошибкой.
			|
			|Обработчик: %1
			|Описание данных для поиска: %2
			|Идентификатор поиска: %3
			|Навигационная ссылка: %4
			|Подобранная объектная ссылка: %5
			|
			|Описание для разработчика:
			|%6.'");
	
	ИмяОбработчика = "ПриПолученииЗапросаВыгрузкиОбъекта";
	
	ПредставлениеНайденногоОбъекта = "";
	Если ПодобраннаяОбъектнаяСсылка <> Неопределено Тогда
		
		ПредставлениеНайденногоОбъекта = КонвертацияОбъектноРецепцияСервер.ПредставлениеОбъектаДляПротокола(ПодобраннаяОбъектнаяСсылка);
		
	КонецЕсли;
	
	ТаблицаДанных = ПравилоКонвертации.ПолноеИмя;
	ИдентификаторДляПоиска = ОписаниеСсылкиЗапроса.БлокирующийИдентификатор;
	НавигационнаяСсылка = СокрЛП(ОписаниеСсылкиЗапроса.ВнешняяНавигационнаяСсылка);
	
	ТекстОшибки = СтрШаблон(ШаблонОписанияОшибки, ИмяОбработчика, ТаблицаДанных, ИдентификаторДляПоиска, НавигационнаяСсылка,
		ПредставлениеНайденногоОбъекта, ОписаниеОшибки);
	
	ТекущаяЗапись = СокрЛП(КомпонентыОбмена.ИсторияКонвертацииОбъекта.ТекстыОшибокПОД["ОшибкаОбработкиЗапросаВыгрузкиОбъекта"]);
	Если НЕ ПустаяСтрока(ТекущаяЗапись) Тогда
		
		ТекущаяЗапись = ТекущаяЗапись + Символы.ПС + Символы.ПС;
		
	КонецЕсли;
	
	КомпонентыОбмена.ИсторияКонвертацииОбъекта.ТекстыОшибокПОД["ОшибкаОбработкиЗапросаВыгрузкиОбъекта"] = ТекущаяЗапись + ТекстОшибки;
	
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ТекстОшибки, , Ложь);
	
КонецПроцедуры

Процедура ФиксироватьОшибкуОбработкиУдаленияОбъекта(КомпонентыОбмена, ДанныеИБ, Знач ТекстОшибки) Экспорт
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьОшибкаОбработкиУдаленияОбъекта = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ШаблонТекстаОшибки = НСтр("ru ='При конвертации удаления объекта возникла ошибка.
	|
	|	Удаляемый объект: %1
	|
	|Описание для разработчика:
	|%2'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ОписаниеОшибки = СтрШаблон(ШаблонТекстаОшибки, ДанныеИБ, ТекстОшибки);
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ТекстыОшибокПКО["ОшибкаОбработкиУдаленияОбъекта"] = ТекстОшибки;
	
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ОписаниеОшибки, , Ложь);
	
КонецПроцедуры

Процедура ФиксироватьОшибкуОбработчикаПередКонвертацией(КомпонентыОбмена, ТекстОшибки) Экспорт
	
	КомпонентыОбмена.ИсторияКонвертацииДанных.ЕстьОшибкаСобытияПередКонвертацией = Истина;
	
	ШаблонОписанияОшибки = НСтр("ru = 'Перед началом процесса конвертации выявлена блокирующая ошибка.
		|
		|Направление: %1.
		|Обработчик: <ПередКонвертацией>
		|
		|Для устранения проблемы обратитесь к администратору.
		|
		|Описание для разработчика:
		|%2.'");
	
	ОписаниеОшибки = СтрШаблон(ШаблонОписанияОшибки, КомпонентыОбмена.НаправлениеОбмена, ТекстОшибки);
	
	КомпонентыОбмена.ИсторияКонвертацииДанных.ТекстыОшибок["ОшибкаСобытияПередКонвертацией"] = ОписаниеОшибки;
	
	// Флаг "ВзвестиФлагОшибок" необходимо взвести в ИСТИНА, т.к. далее продолжать конвертацию нельзя.
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ОписаниеОшибки, , Истина);
	
КонецПроцедуры

Процедура ФиксироватьОшибкуОпределенияТипаОбъектаXDTO(КомпонентыОбмена, ЛокальноеИмяОбъектаФормата, ПространствоИменURI, Знач СодержимоеЗаписи) Экспорт
	
	КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЕстьОшибкаОпределенияТипаОбъектаXDTO = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ШаблонТекстаОшибки = НСтр("ru ='Неизвестный тип формата обмена.
	|
	|	Имя типа формата: %1
	|	Пространстве имен: %2
	|
	|Для устранения проблемы обратитесь к администратору.
	|
	|Содержимое конвертации-xml:
	|%3
	|
	|Описание для разработчика:
	|{см. КонвертацияОбъектноСлужебный.ПриОпределенииПравилаОбработкиДанных()}'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ЛокальноеИмяОбъектаФормата, ПространствоИменURI, СодержимоеЗаписи);
	КомпонентыОбмена.ИсторияКонвертацииОбъекта.ТекстыОшибокПОД["ОшибкаОпределенияТипаОбъектаXDTO"] = ТекстОшибки;
	
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ТекстОшибки, , Ложь);
	
КонецПроцедуры

Процедура ФиксироватьОшибкуОпределенияПОД(КомпонентыОбмена, ИмяТипаОбъектаXDTO, СтекВызова) Экспорт
	
	КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЕстьОшибкаОпределенияПОД = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ШаблонТекстаОшибки = НСтр("ru = 'Не найдено ПОД для объекта формата EnterpriseData.
	|
	|	Версия формата: %1
	|	Тип объекта: %2
	|
	|Для устранения проблемы обратитесь к администратору.
	|
	|Описание для разработчика:
	|%3'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	
	ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, КомпонентыОбмена.ВерсияФорматаОбмена, Строка(ИмяТипаОбъектаXDTO), СтекВызова);
	КомпонентыОбмена.ИсторияКонвертацииОбъекта.ТекстыОшибокПОД["ОшибкаОпределенияПОД"] = ТекстОшибки;
	
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ТекстОшибки, , Ложь);
	
КонецПроцедуры

Процедура ФиксироватьОшибкуОпределенияПКО(КомпонентыОбмена, ИмяПКО, Знач ТекстОшибки) Экспорт
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьОшибкаОпределенияПКО = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ШаблонТекстаОшибки = НСтр("ru ='В ПОД указано отсутствующее ПКО.
	|
	|	ПОД: %1
	|	ПКО: %2
	|
	|Для устранения проблемы обратитесь к администратору.
	|
	|Описание для разработчика:
	|%3'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ИмяПОД = КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЗначениеПОД.Имя;
	
	ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ИмяПОД, ИмяПКО, ТекстОшибки);
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ТекстыОшибокПКО["ОшибкаОпределенияПКО"] = ТекстОшибки;
	
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ТекстОшибки, , Ложь);
	
КонецПроцедуры

Процедура ФиксироватьОшибкуОтсутствияПоддержкиОбъектаXDTO(КомпонентыОбмена) Экспорт
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьОшибкаПоддерживаемыхОбъектовXDTO = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ШаблонТекста = НСтр("ru ='Неизвестный объект формата EnterpriseData.
	|
	|	Объект XDTO: %1
	|	Версия формата: %2
	|
	|Для устранения проблемы обратитесь к администратору.
	|
	|Описание для разработчика:
	|{см. КонвертацияОбъектноСлужебный.ПередКонвертациейОбъектаXDTO()}'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ПравилоКонвертации = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПравилоКонвертации;
	
	ТекстОшибки = СтрШаблон(ШаблонТекста, ПравилоКонвертации.ОбъектФормата, КомпонентыОбмена.ВерсияФорматаОбмена);
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ТекстыОшибокПКО["ОшибкаПоддерживаемыхОбъектовXDTO"] = ТекстОшибки;
	
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ТекстОшибки, , Ложь);
	
КонецПроцедуры

Процедура ФиксироватьОшибкуСобытияПередЗаписьюПолученныхДанных(КомпонентыОбмена, Знач ПредставлениеОбъекта, Знач ОписаниеОшибки) Экспорт
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьОшибкаСобытияПередЗаписьюПолученныхДанных = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ШаблонТекстаОшибки = НСтр("ru ='В событии <ПередЗаписьюПолученныхДанных> произошла ошибка
	|	
	|	ПОД: %1
	|	ПКО: %2
	|	Объект: %3
	|
	|Для устранения проблемы обратитесь к администратору.
	|
	|Описание для разработчика:
	|%4'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ИмяПОД = КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЗначениеПОД.Имя;
	ИмяПКО = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПравилоКонвертации.ИмяПКО;
	
	ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ИмяПОД, ИмяПКО, ПредставлениеОбъекта, ОписаниеОшибки);
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ТекстыОшибокПКО["ОшибкаСобытияПередЗаписьюПолученныхДанных"] = ТекстОшибки;
	
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ТекстОшибки, , Ложь);
	
КонецПроцедуры

Процедура ФиксироватьОшибкуСобытияПослеКонвертации(КомпонентыОбмена, Знач ТекстОшибки) Экспорт
	
	// Событие не относиться к ПКО, выполняется после конвертации порции прочитанных данных
	ШаблонТекста = НСтр("ru = 'Направление: %1.
		|Обработчик: %2.
		|
		|Ошибка выполнения обработчика.
		|
		|Описание для разработчика:
		|%3.'");
	
	ИмяСобытия = НСтр("ru ='ПослеКонвертации()'", ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстОшибки = СтрШаблон(ШаблонТекста, КомпонентыОбмена.НаправлениеОбмена, ИмяСобытия, ТекстОшибки);
	
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ТекстОшибки, , Ложь);
	
КонецПроцедуры

Процедура ФиксироватьОшибкуСобытияПослеКонвертацииОбъекта(КомпонентыОбмена, ПредставлениеОбъекта, Знач ОписаниеОшибки) Экспорт
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьОшибкаСобытияПослеКонвертацииОбъекта = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ШаблонТекстаОшибки = НСтр("ru ='В событии <ПослеКонвертацииОбъекта> произошла ошибка
	|	
	|	ПОД: %1
	|	ПКО: %2
	|	Объект: %3
	|
	|Для устранения проблемы обратитесь к администратору.
	|
	|Описание для разработчика:
	|%4'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ИмяПОД = КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЗначениеПОД.Имя;
	ИмяПКО = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПравилоКонвертации.ИмяПКО;
	
	ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ИмяПОД, ИмяПКО, ПредставлениеОбъекта, ОписаниеОшибки);
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ТекстыОшибокПКО["ОшибкаСобытияПослеКонвертацииОбъекта"] = ТекстОшибки;
	
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ТекстОшибки, , Ложь);
	
КонецПроцедуры

Процедура ФиксироватьОшибкуСобытияПриОбработкеПОД(КомпонентыОбмена, ПредставлениеОбъекта, ТекстОшибки) Экспорт
	
	КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЕстьОшибкаСобытияПриОбработкеПОД = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ШаблонОписанияОшибки = НСтр("ru = 'В событии <ПриОбработкеПОД> произошла ошибка:
		|
		|Направление: %1
		|ПОД: %2
		|Объект: %3
		|
		|Для устранения проблемы обратитесь к администратору.
		|
		|Описание для разработчика:
		|%4.'");
	
	НаправлениеОбмена = КомпонентыОбмена.НаправлениеОбмена;
	ИмяПОД = КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЗначениеПОД.Имя;
	
	ОписаниеОшибки = СтрШаблон(ШаблонОписанияОшибки, НаправлениеОбмена, ИмяПОД, ПредставлениеОбъекта, ТекстОшибки);
	
	КомпонентыОбмена.ИсторияКонвертацииОбъекта.ТекстыОшибокПОД.Вставить("ОшибкаСобытияПриОбработкеПОД", ОписаниеОшибки);
	
КонецПроцедуры

Процедура ФиксироватьОшибкуСобытияПриОбработкеСсылокБлокирующихКонвертацию(КомпонентыОбмена, ПолученныеДанные, ТекстОшибки) Экспорт
	
	КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЕстьОшибкаСобытияПриОбработкеСсылокБлокирующихКонвертацию = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ШаблонОписанияОшибки = НСтр("ru = 'В событии <ПриОбработкеСсылокБлокирующихКонвертацию> произошла ошибка:
		|
		|Направление: %1
		|ПОД: %2
		|ПКО: %3
		|Объект: %4
		|
		|Для устранения проблемы обратитесь к администратору.
		|
		|Описание для разработчика:
		|%5.'");
	
	НаправлениеОбмена = КомпонентыОбмена.НаправлениеОбмена;
	ИмяПОД = КомпонентыОбмена.ИсторияКонвертацииОбъекта.ЗначениеПОД.Имя;
	ИмяПКО = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПравилоКонвертации.ИмяПКО;
	ПредставлениеОбъекта = КонвертацияОбъектноРецепцияСервер.ПредставлениеОбъектаДляПротокола(ПолученныеДанные);
	
	ОписаниеОшибки = СтрШаблон(ШаблонОписанияОшибки, НаправлениеОбмена, ИмяПОД, ИмяПКО, ПредставлениеОбъекта, ТекстОшибки);
	
	КомпонентыОбмена.ИсторияКонвертацииОбъекта.ТекстыОшибокПОД.Вставить("ОшибкаСобытияПриОбработкеСсылокБлокирующихКонвертацию", ОписаниеОшибки);
	
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ОписаниеОшибки, Неопределено, Ложь);
	
КонецПроцедуры

Процедура ФиксироватьПредупреждениеБлокировкиОбъекта(КомпонентыОбмена, ДанныеИБ) Экспорт
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьПредупреждениеОбъектнойБлокировкиОбъекта = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ШаблонТекстаПредупреждения = НСтр("ru = 'Не удалось установить объектную блокировку перед конвертацией
	|по причине: объект уже заблокирован.
	|	
	|	Объект: %1
	|	Идентификатор: %2
	|	Переход по ссылке: %3
	|
	|Возможно форма объекта была открыта пользователем или выполнялась параллельная конвертация.
	|
	|Описание для разработчика:
	|{см. КонвертацияОбъектноСлужебный.ЗаблокироватьОбъектИБ()}'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	Если ЗначениеЗаполнено(ДанныеИБ.Ссылка) Тогда
		
		УИД = ДанныеИБ.Ссылка.УникальныйИдентификатор();
		Навигация = ПолучитьНавигационнуюСсылку(ДанныеИБ.Ссылка);
		
	КонецЕсли;
	
	ТекстПредупреждения = СтрШаблон(ШаблонТекстаПредупреждения, ДанныеИБ.Ссылка, УИД, Навигация);
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ТекстыОшибокПКО["ПредупреждениеБлокировкиОбъекта"] = ТекстПредупреждения;
	
	ОписаниеПредупреждения = Новый Структура;
	ОписаниеПредупреждения.Вставить("Уровень", УровеньЖурналаРегистрации.Предупреждение);
	ОписаниеПредупреждения.Вставить("КраткоеПредставлениеОшибки",   "");
	ОписаниеПредупреждения.Вставить("ПодробноеПредставлениеОшибки", ТекстПредупреждения);
	
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ОписаниеПредупреждения, Неопределено, Ложь);
	
КонецПроцедуры

Процедура ФиксироватьПредупреждениеДублейСопоставлений(КомпонентыОбмена, ДублиСопоставлений, ВнешняяСсылка) Экспорт
	
	// Ситуация, когда внешний идентификатор (ссылка) по данным регистра ПИСО
	// соответствует нескольким ссылкам в ИБ не является ошибкой.
	// Отразим этот нюанс в журнале регистрации и продолжим работу.
	// Флаг "ЕстьОшибка* или ЕстьПредупреждение*" взводить не требуется.
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ШаблонТекстаПредупреждения = НСтр("ru = 'В приложении зафиксировано несколько соответствий внешнему (входящему) идентификатору.
	|	
	|	Внешний идентификатор: %1
	|	Список соответствий: %2
	|
	|Возможно требуется актуализировать сведения о сопоставлении данных.
	|
	|Описание для разработчика:
	|{см. регистр сведений ПубличныеИдентификаторыСинхронизируемыхОбъектов}'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ПредставлениеДублей = "";
	Для каждого ДубльИзПИСО Из ДублиСопоставлений Цикл
		
		ПредставлениеДублей = ПредставлениеДублей + Символы.ПС + "		- " + СокрЛП(ДубльИзПИСО);
		
	КонецЦикла;
	
	ТекстПредупреждения = СтрШаблон(ШаблонТекстаПредупреждения, ВнешняяСсылка, ПредставлениеДублей);
	
	ОписаниеПредупреждения = Новый Структура;
	ОписаниеПредупреждения.Вставить("Уровень", УровеньЖурналаРегистрации.Предупреждение);
	ОписаниеПредупреждения.Вставить("КраткоеПредставлениеОшибки",   "");
	ОписаниеПредупреждения.Вставить("ПодробноеПредставлениеОшибки", ТекстПредупреждения);
	
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ОписаниеПредупреждения, Неопределено, Ложь);
	
КонецПроцедуры

Процедура ФиксироватьПредупреждениеИзмененияНеразделенныхДанных(КомпонентыОбмена, ДанныеИБ, ЭтоУдаление = Ложь) Экспорт
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьПредупреждениеИзмененияНеразделенныхДанных = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ШаблонТекстаПредупреждения = НСтр("ru = 'Зафиксирована попытка изменения неразделенных данных в разделенном режиме.
	|	
	|	Метаданные: %1
	|	Ссылка: %2
	|	Идентификатор: %3
	|	Переход по ссылке: %4
	|
	|Изменение указанного объекта было проигнорировано.
	|
	|Описание для разработчика:
	|{см. КонвертацияОбъектноСлужебный.РазрешенаЗаписьОбъектаВРазделеннойИБ()}'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	Если ЗначениеЗаполнено(ДанныеИБ.Ссылка) Тогда
		
		ИмяТаблицы = ДанныеИБ.Ссылка.Метаданные().ПолноеИмя();
		УИД = ДанныеИБ.Ссылка.УникальныйИдентификатор();
		Навигация = ПолучитьНавигационнуюСсылку(ДанныеИБ.Ссылка);
		
	КонецЕсли;
	
	Если ЭтоУдаление = Истина Тогда
		
		ШаблонТекстаПредупреждения = СтрЗаменить(ШаблонТекстаПредупреждения,
			НСтр("ru = 'попытка изменения неразделенных'", ОбщегоНазначения.КодОсновногоЯзыка()),
			НСтр("ru = 'попытка удаления неразделенных'", ОбщегоНазначения.КодОсновногоЯзыка()));
			
		ШаблонТекстаПредупреждения = СтрЗаменить(ШаблонТекстаПредупреждения,
			НСтр("ru = 'Изменение указанного объекта'", ОбщегоНазначения.КодОсновногоЯзыка()),
			НСтр("ru = 'Удаление указанного объекта'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
	КонецЕсли;
		
	ТекстПредупреждения = СтрШаблон(ШаблонТекстаПредупреждения, ИмяТаблицы, ДанныеИБ.Ссылка, УИД, Навигация);
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ТекстыОшибокПКО["ПредупреждениеИзмененияНеразделенныхДанных"] = ТекстПредупреждения;
	
	ОписаниеПредупреждения = Новый Структура;
	ОписаниеПредупреждения.Вставить("Уровень", УровеньЖурналаРегистрации.Предупреждение);
	ОписаниеПредупреждения.Вставить("КраткоеПредставлениеОшибки", "");
	ОписаниеПредупреждения.Вставить("ПодробноеПредставлениеОшибки", ТекстПредупреждения);
	
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ОписаниеПредупреждения, Неопределено, Ложь);
	
КонецПроцедуры

Процедура ФиксироватьПредупреждениеБлокировкиОбъектаДругимиОбъектами(КомпонентыОбмена) Экспорт
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьПредупреждениеБлокировкиОбъектаДругимиОбъектами = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ВнешняяСсылкаСтрокой = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ВнешняяСсылкаСтрокой;
	Если ПустаяСтрока(ВнешняяСсылкаСтрокой) Тогда // Такого быть не должно, но ...
		
		ВнешняяСсылкаСтрокой = НСтр("ru ='<Идентификатор не указан>'", ОбщегоНазначения.КодОсновногоЯзыка());
		
	КонецЕсли;
	
	ШаблонТекстаЗаголовка =  НСтр("ru ='Загрузка объекта невозможна.
		|	Тип: %1
		|	Объект: %2
		|	УИД: %3
		|
		|Причина отказа загрузки:
		|%4'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	
	ИсторияПримененияТекущегоПКО = КомпонентыОбмена.ИсторияПримененияТекущегоПКО;
	ПравилоКонвертации = ИсторияПримененияТекущегоПКО.ПравилоКонвертации;
	ИмяТипа = ПравилоКонвертации.ИмяТаблицыПолученныхДанных;
	СсылкаНаОбъект = КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ДанныеИБСсылка;
	
	ОписаниеКонвертируемогоОбъекта = НСтр("ru ='<Новый объект>'", ОбщегоНазначения.КодОсновногоЯзыка());
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		
		ОписаниеКонвертируемогоОбъекта = КонвертацияОбъектноРецепцияСервер.ПредставлениеОбъектаДляПротокола(СсылкаНаОбъект);
		
	КонецЕсли;
	
	ОписаниеНедостающихСсылок = "";
	Для каждого ОписаниеБлокера Из ИсторияПримененияТекущегоПКО.СсылкиБлокирующиеКонвертацию Цикл
		
		Если ПустаяСтрока(ОписаниеБлокера.БлокирующийИдентификатор) Тогда
			
			// Обязательно должно быть 2 ссылки:
			// - что заблокировано;
			// - чем заблокировано.
			Продолжить;
			
		КонецЕсли;
		
		ПредставлениеБлокировкиОбъекта(ОписаниеНедостающихСсылок, ОписаниеБлокера, ИмяТипа);
		
	КонецЦикла;
	
	ТекстПредупреждения = СтрШаблон(ШаблонТекстаЗаголовка, ИмяТипа, ОписаниеКонвертируемогоОбъекта, ВнешняяСсылкаСтрокой, ОписаниеНедостающихСсылок);
	ИсторияПримененияТекущегоПКО.ТекстыОшибокПКО["ПредупреждениеБлокировкиОбъектаДругимиОбъектами"] = ТекстПредупреждения;
	
	ОписаниеПредупреждения = Новый Структура;
	ОписаниеПредупреждения.Вставить("Уровень", УровеньЖурналаРегистрации.Предупреждение);
	ОписаниеПредупреждения.Вставить("КраткоеПредставлениеОшибки", "");
	ОписаниеПредупреждения.Вставить("ПодробноеПредставлениеОшибки", ТекстПредупреждения);
	
	// Отразим блокировку в журнале регистрации
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ОписаниеПредупреждения, Неопределено, Ложь);
	
КонецПроцедуры

Процедура ФиксироватьПредупреждениеЗапросаНаВыгрузкуСсылкаНеНайдена(КомпонентыОбмена, ОписаниеСсылкиЗапроса) Экспорт
	
	ОписаниеОшибки = НСтр("ru = 'Ссылка с идентификатором %1 по объекту формата %2 не будет повторно выгружена,
							|т.к. ей не найдено соответствие в этом приложении.'");
	
	ИдентификаторИзЗапроса = ОписаниеСсылкиЗапроса.СсылкаЗапросаНаВыгрузку;
	ИмяОбъектаФормата = ОписаниеСсылкиЗапроса.ИмяОбъектаФорматаПолученного;
	
	ПредставлениеПредупреждения = СтрШаблон(ОписаниеОшибки, ИдентификаторИзЗапроса, ИмяОбъектаФормата);
	Если НЕ ПустаяСтрока(ОписаниеСсылкиЗапроса.СсылкаВнешняяНавигационная) Тогда
		
		ПредставлениеПредупреждения = ПредставлениеПредупреждения + Символы.ПС + ОписаниеСсылкиЗапроса.СсылкаВнешняяНавигационная;
		
	КонецЕсли;
	
	ОписаниеПредупреждения = Новый Структура;
	ОписаниеПредупреждения.Вставить("Уровень", УровеньЖурналаРегистрации.Предупреждение);
	ОписаниеПредупреждения.Вставить("КраткоеПредставлениеОшибки",   ПредставлениеПредупреждения);
	ОписаниеПредупреждения.Вставить("ПодробноеПредставлениеОшибки", ПредставлениеПредупреждения);
	
	// Предупреждение фиксируем только в ЖР, не отражая в результатах обмена.
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ОписаниеПредупреждения, Неопределено, Ложь);
	
КонецПроцедуры

Процедура ФиксироватьПредупреждениеЗапросаНаВыгрузкуСсылкаНеПроходитФильтр(КомпонентыОбмена, ОписаниеСсылкиЗапроса, ПодобраннаяОбъектнаяСсылка) Экспорт
	
	ШаблонТекста = НСтр("ru = 'Объект %1 не будет повторно выгружен, т.к. не соответствует условиям фильтра.'");
	
	ПредставлениеСсылки = КонвертацияОбъектноРецепцияСервер.ПредставлениеОбъектаДляПротокола(ПодобраннаяОбъектнаяСсылка);
	
	ПредставлениеПредупреждения = СтрШаблон(ШаблонТекста, ПредставлениеСсылки);
	Если НЕ ПустаяСтрока(ОписаниеСсылкиЗапроса.СсылкаВнешняяНавигационная) Тогда
		
		ПредставлениеПредупреждения = ПредставлениеПредупреждения + Символы.ПС + ОписаниеСсылкиЗапроса.СсылкаВнешняяНавигационная;
		
	КонецЕсли;
	
	ОписаниеПредупреждения = Новый Структура;
	ОписаниеПредупреждения.Вставить("Уровень", УровеньЖурналаРегистрации.Предупреждение);
	ОписаниеПредупреждения.Вставить("КраткоеПредставлениеОшибки",   ПредставлениеПредупреждения);
	ОписаниеПредупреждения.Вставить("ПодробноеПредставлениеОшибки", ПредставлениеПредупреждения);
	
	// Предупреждение фиксируем только в ЖР, не отражая в результатах обмена.
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ОписаниеПредупреждения, Неопределено, Ложь);
	
КонецПроцедуры

Процедура ФиксироватьПредупреждениеНеизвестныйОбъектФормата(КомпонентыОбмена, ПространствоИмен, ИмяОбъектаФормата, ТекстОшибки) Экспорт
	
	// Это событие не работает с флагами из ИсторияПримененияТекущегоПКО,
	// не блокирует обмен, не формирует записей об ошибках - только предупреждение.
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ШаблонТекста = НСтр("ru ='Обнаружена неудачная попытка создания объекта формата.
	|	
	|	Пространство имен: %1
	|	Имя объекта: %2
	|
	|Описание для разработчика:
	|%3'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ТекстПредупреждения = СтрШаблон(ШаблонТекста, ПространствоИмен, ИмяОбъектаФормата, ТекстОшибки);
	
	ОписаниеПредупреждения = Новый Структура;
	ОписаниеПредупреждения.Вставить("Уровень", УровеньЖурналаРегистрации.Предупреждение);
	ОписаниеПредупреждения.Вставить("КраткоеПредставлениеОшибки", "");
	ОписаниеПредупреждения.Вставить("ПодробноеПредставлениеОшибки", ТекстПредупреждения);
	
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ОписаниеПредупреждения, Неопределено, Ложь);
	
КонецПроцедуры

Процедура ФиксироватьОтказОтКонвертацииОбъекта(КомпонентыОбмена) Экспорт
	
	// Это событие фиксирует ситуацию, когда в ПКО отказались конвертировать данные:
	// - ПолученныеДанные = Неопределено и ДанныеИБ = Неопределено.
	// С позиции конвертации ошибки нет, т.к. это решение принято разработчиком прикладных правил,
	// но проинформировать нужно.
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьИнформированиеОтказаОтКонвертацииОбъекта = Истина;
	
	ШаблонТекста = НСтр("ru ='Загрузка данных выполнена, но в результате не потребовалось создавать или обновлять объекты.
	|Такая ситуация возникает, когда алгоритм намеренно отказался от загрузки объекта.
	|
	|	ПОД: %1
	|	ПКО: %2
	|	Идентификатор: %3
	|
	|Описание для разработчика:
	|Получены пустые значения в переменных ПолученныеДанные и ДанныеИБ.
	|{см. КонвертацияОбъектноСлужебный.ПередЗаписьюПолученныхДанных()}'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ИсторияКонвертацииОбъекта = КомпонентыОбмена.ИсторияКонвертацииОбъекта;
	ИсторияПримененияТекущегоПКО = КомпонентыОбмена.ИсторияПримененияТекущегоПКО;
	
	ИмяПОД = ИсторияКонвертацииОбъекта.ЗначениеПОД.Имя;
	ИмяПКО = ИсторияПримененияТекущегоПКО.ПравилоКонвертации.ИмяПКО;
	ИдентификаторОбъекта = ИсторияПримененияТекущегоПКО.ВнешняяСсылкаСтрокой;
	
	ТекстИнформирования = СтрШаблон(ШаблонТекста, ИмяПОД, ИмяПКО, ИдентификаторОбъекта);
	ИсторияПримененияТекущегоПКО.ТекстыОшибокПКО["ИнформированиеОтказаОтКонвертацииОбъекта"] = ТекстИнформирования;
	
	ОписаниеПредупреждения = Новый Структура;
	ОписаниеПредупреждения.Вставить("Уровень", УровеньЖурналаРегистрации.Предупреждение);
	ОписаниеПредупреждения.Вставить("КраткоеПредставлениеОшибки", "");
	ОписаниеПредупреждения.Вставить("ПодробноеПредставлениеОшибки", ТекстИнформирования);
	
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ОписаниеПредупреждения, Неопределено, Ложь);
	
КонецПроцедуры

Процедура ФиксироватьПредупреждениеПриПроведении(КомпонентыОбмена, ДанныеИБ, ТекстОшибки) Экспорт
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьПредупреждениеПриПроведении = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ШаблонТекста = НСтр("ru ='Не удалось провести документ.
	|	
	|	Метаданные: %1
	|	Ссылка: %2
	|	Идентификатор: %3
	|	Переход по ссылке: %4
	|
	|Описание для разработчика:
	|%5'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	Если ЗначениеЗаполнено(ДанныеИБ.Ссылка) Тогда
		
		ИмяТаблицы = ДанныеИБ.Ссылка.Метаданные().ПолноеИмя();
		УИД = ДанныеИБ.Ссылка.УникальныйИдентификатор();
		Навигация = ПолучитьНавигационнуюСсылку(ДанныеИБ.Ссылка);
		
	КонецЕсли;
	
	ТекстПредупреждения = СтрШаблон(ШаблонТекста, ИмяТаблицы, ДанныеИБ.Ссылка, УИД, Навигация, ТекстОшибки);
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ТекстыОшибокПКО["ПредупреждениеПриПроведении"] = ТекстПредупреждения;
	
	ОписаниеПредупреждения = Новый Структура;
	ОписаниеПредупреждения.Вставить("Уровень", УровеньЖурналаРегистрации.Предупреждение);
	ОписаниеПредупреждения.Вставить("КраткоеПредставлениеОшибки", "");
	ОписаниеПредупреждения.Вставить("ПодробноеПредставлениеОшибки", ТекстПредупреждения);
	
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ОписаниеПредупреждения, , Ложь);
	
КонецПроцедуры

Процедура ФиксироватьПредупреждениеПриЗаписиОбъекта(КомпонентыОбмена, ДанныеИБ, ТекстОшибки) Экспорт
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьПредупреждениеПриЗаписи = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ШаблонТекста = НСтр("ru ='Не удалось записать объект в пользовательском режиме (с проверкой заполнения).
	|	
	|	Метаданные: %1
	|	Ссылка: %2
	|	Идентификатор: %3
	|	Переход по ссылке: %4
	|
	|Описание для разработчика:
	|%5'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	Если КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ПравилоКонвертации.ЭтоСсылочныйТип
		И ЗначениеЗаполнено(ДанныеИБ.Ссылка) Тогда
		
		ИмяТаблицы = ДанныеИБ.Ссылка.Метаданные().ПолноеИмя();
		УИД = ДанныеИБ.Ссылка.УникальныйИдентификатор();
		Навигация = ПолучитьНавигационнуюСсылку(ДанныеИБ.Ссылка);
		
	КонецЕсли;
	
	ТекстПредупреждения = СтрШаблон(ШаблонТекста, ИмяТаблицы, СокрЛП(ДанныеИБ), УИД, Навигация, ТекстОшибки);
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ТекстыОшибокПКО["ПредупреждениеПриЗаписи"] = ТекстПредупреждения;
	
	ОписаниеПредупреждения = Новый Структура;
	ОписаниеПредупреждения.Вставить("Уровень", УровеньЖурналаРегистрации.Предупреждение);
	ОписаниеПредупреждения.Вставить("КраткоеПредставлениеОшибки", "");
	ОписаниеПредупреждения.Вставить("ПодробноеПредставлениеОшибки", ТекстПредупреждения);
	
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ОписаниеПредупреждения, , Ложь);
	
КонецПроцедуры

Процедура ФиксироватьПредупреждениеПриСохраненииОбъекта(КомпонентыОбмена, ДанныеИБ, ТекстОшибки) Экспорт
	
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ЕстьПредупреждениеПриСохранении = Истина;
	ОтметитьНаличиеПредупреждения(КомпонентыОбмена);
	
	ШаблонТекста = НСтр("ru ='Не удалось сохранить объект в режиме разработчика (без проверки заполнения).
	|	
	|	Метаданные: %1
	|	Ссылка: %2
	|	Идентификатор: %3
	|	Переход по ссылке: %4
	|
	|Фактически это предупреждение говорит о том, что результат конвертации указанного объекта не зафиксирован.
	|
	|Описание для разработчика:
	|%5'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	Если ЗначениеЗаполнено(ДанныеИБ.Ссылка) Тогда
		
		ИмяТаблицы = ДанныеИБ.Ссылка.Метаданные().ПолноеИмя();
		УИД = ДанныеИБ.Ссылка.УникальныйИдентификатор();
		Навигация = ПолучитьНавигационнуюСсылку(ДанныеИБ.Ссылка);
		
	КонецЕсли;
	
	ТекстПредупреждения = СтрШаблон(ШаблонТекста, ИмяТаблицы, ДанныеИБ.Ссылка, УИД, Навигация, ТекстОшибки);
	КомпонентыОбмена.ИсторияПримененияТекущегоПКО.ТекстыОшибокПКО["ПредупреждениеПриСохранении"] = ТекстПредупреждения;
	
	ОписаниеПредупреждения = Новый Структура;
	ОписаниеПредупреждения.Вставить("Уровень", УровеньЖурналаРегистрации.Предупреждение);
	ОписаниеПредупреждения.Вставить("КраткоеПредставлениеОшибки", "");
	ОписаниеПредупреждения.Вставить("ПодробноеПредставлениеОшибки", ТекстПредупреждения);
	
	КонвертацияОбъектноРецепцияСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ОписаниеПредупреждения, , Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область РасшифровкаОшибок

// Получает причину добавления ошибки, которая возникла при работе Правил Конвертации Объекта (существующего).
//
// Параметры:
//   ИсторияПримененияПКО - см. КонвертацияОбъектноРезультатыСлужебный.КонструкторИсторииПримененияПКО
// 
// Возвращаемое значение:
//   ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке, Неопределено - 
//    "Неопределено" если ошибка не соответствует ожидаемым типам
//
Функция ПричинаДобавленияОшибкиПКО(ИсторияПримененияПКО) Экспорт
	
	ПричинаДобавления = Неопределено;
	Если ИсторияПримененияПКО.ЕстьПредупреждениеПриСохранении = Истина Тогда
		
		ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи;
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьПредупреждениеПриЗаписи = Истина Тогда
		
		ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи;
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьПредупреждениеПриПроведении = Истина Тогда
		
		ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроведения;
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьПредупреждениеУстановитьВручнуюСоответствие = Истина Тогда
		
		ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПоискСоответствия;
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьПредупреждениеНеобходимостиПодтвердитьЗагрузкуДанных = Истина Тогда 
		
		ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПодтверждение;
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьПредупреждениеБлокировкиОбъектаДругимиОбъектами = Истина Тогда
		
		ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетЗагрузкуДругихОбъектов;
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьОшибкаКонвертацииСтруктурыXDTO = Истина
		ИЛИ ИсторияПримененияПКО.ЕстьОшибкаКонвертацииСвойстваСтруктурыXDTO = Истина
		ИЛИ ИсторияПримененияПКО.ЕстьОшибкаОпределенияПКО = Истина
		ИЛИ ИсторияПримененияПКО.ЕстьОшибкаПоддерживаемыхОбъектовXDTO = Истина
		ИЛИ ИсторияПримененияПКО.ЕстьПредупреждениеИзмененияНеразделенныхДанных = Истина
		ИЛИ ИсторияПримененияПКО.ЕстьОшибкаСобытияПередЗаписьюПолученныхДанных = Истина
		ИЛИ ИсторияПримененияПКО.ЕстьОшибкаСобытияПриОбработкеСсылокБлокирующихКонвертацию = Истина
		ИЛИ ИсторияПримененияПКО.ЕстьОшибкаСобытияПослеКонвертацииОбъекта = Истина
		ИЛИ ИсторияПримененияПКО.ЕстьОшибкаОбработкиУдаленияОбъекта = Истина
		Тогда
		
		ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаКонвертации;
		
	Иначе
		
		// Нет ошибок или :
		// - ИсторияПримененияПКО.ЕстьПредупреждениеОбъектнойБлокировкиОбъекта = Истина
		// - ИсторияПримененияПКО.ЕстьИнформированиеОтказаОтКонвертацииОбъекта ИсторияПримененияПКО
		
	КонецЕсли;
	
	Возврат ПричинаДобавления;
	
КонецФункции

// Определяет, возникала ли ошибка конвертации при загрузке объекта
//
// Параметры:
//   ИсторияКонвертацииОбъекта - см. КонвертацияОбъектноРезультатыСлужебный.КонструкторИсторииПримененияПОД
// 
// Возвращаемое значение:
//   Булево 
//
Функция ВозниклаОшибкаКонвертации(ИсторияКонвертацииОбъекта) Экспорт
	
	Если ИсторияКонвертацииОбъекта.ЕстьОшибкаНепредвиденногоИсключения
		Или ИсторияКонвертацииОбъекта.ЕстьОшибкаОбработкиЗапросаВыгрузкиОбъекта
		Или ИсторияКонвертацииОбъекта.ЕстьОшибкаОпределенияПОД
		Или ИсторияКонвертацииОбъекта.ЕстьОшибкаОпределенияТипаОбъектаXDTO
		Или ИсторияКонвертацииОбъекта.ЕстьОшибкаСобытияПриОбработкеПОД 
		Или ИсторияКонвертацииОбъекта.ЕстьОшибкаДесериализацииПоТипуXDTO Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// Получает статус ошибки, которая возникла при работе Правил Конвертации Объекта.
//
// Параметры:
//   ИсторияПримененияПКО - см. КонвертацияОбъектноРезультатыСлужебный.КонструкторИсторииПримененияПКО
// 
// Возвращаемое значение:
//   ПеречислениеСсылка.СтатусыОбновленияОбъектаПриПроблемахЗаписи, Неопределено - 
//    "Неопределено" если ошибка не соответствует ожидаемым типам
//
Функция СтатусОшибкиПКО(ИсторияПримененияПКО) Экспорт
	
	СтатусОбновленияОбъектаВИБ = Неопределено;
	Если ИсторияПримененияПКО.ЕстьПредупреждениеПриСохранении = Истина Тогда
		
		СтатусОбновленияОбъектаВИБ = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеОбновлен;
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьПредупреждениеПриЗаписи = Истина Тогда
		
		Если ИсторияПримененияПКО.ЭтоНовыйОбъект = Истина Тогда
			
			СтатусОбновленияОбъектаВИБ = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженСозданНовый;
			
		Иначе
			
			ИмяСтратегии = КонвертацияОбъектноСлужебный.ИмяСтратегииСохранения();
			СохранениеБылоРазрешено = (СтрНайти(ИсторияПримененияПКО.СтратегияЗаписиОбъекта, ИмяСтратегии) > 0);
			Если СохранениеБылоРазрешено Тогда
				
				СтатусОбновленияОбъектаВИБ = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженОбновлен;
				
			Иначе
				
				СтатусОбновленияОбъектаВИБ = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеОбновлен;
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьПредупреждениеПриПроведении = Истина Тогда
		
		Если ИсторияПримененияПКО.ЭтоНовыйОбъект = Истина Тогда
			
			СтатусОбновленияОбъектаВИБ = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженСозданНовый;
			
		Иначе
			
			ИмяСтратегии = КонвертацияОбъектноСлужебный.ИмяСтратегииЗаписи();
			ЗаписьБылаРазрешена = (СтрНайти(ИсторияПримененияПКО.СтратегияЗаписиОбъекта, ИмяСтратегии) > 0);
			Если ЗаписьБылаРазрешена Тогда
				
				// Загружался не проведенный документ
				СтатусОбновленияОбъектаВИБ = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженОбновлен;
				
			Иначе
				
				СтатусОбновленияОбъектаВИБ = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеОбновлен;
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьПредупреждениеУстановитьВручнуюСоответствие = Истина Тогда
		
		СтатусОбновленияОбъектаВИБ = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеСоздан;
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьПредупреждениеНеобходимостиПодтвердитьЗагрузкуДанных = Истина
		ИЛИ ИсторияПримененияПКО.ЕстьПредупреждениеБлокировкиОбъектаДругимиОбъектами = Истина
		ИЛИ ИсторияПримененияПКО.ЕстьОшибкаКонвертацииСтруктурыXDTO = Истина
		ИЛИ ИсторияПримененияПКО.ЕстьОшибкаКонвертацииСвойстваСтруктурыXDTO = Истина
		ИЛИ ИсторияПримененияПКО.ЕстьОшибкаОпределенияПКО = Истина
		ИЛИ ИсторияПримененияПКО.ЕстьОшибкаПоддерживаемыхОбъектовXDTO = Истина
		ИЛИ ИсторияПримененияПКО.ЕстьПредупреждениеИзмененияНеразделенныхДанных = Истина
		ИЛИ ИсторияПримененияПКО.ЕстьОшибкаСобытияПередЗаписьюПолученныхДанных = Истина
		ИЛИ ИсторияПримененияПКО.ЕстьОшибкаСобытияПриОбработкеСсылокБлокирующихКонвертацию = Истина
		ИЛИ ИсторияПримененияПКО.ЕстьОшибкаСобытияПослеКонвертацииОбъекта = Истина
		Тогда
		
		Если ИсторияПримененияПКО.ЭтоНовыйОбъект = Истина Тогда
			
			СтатусОбновленияОбъектаВИБ = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеСоздан;
			
		Иначе
			
			СтатусОбновленияОбъектаВИБ = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеОбновлен;
			
		КонецЕсли;
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьОшибкаОбработкиУдаленияОбъекта = Истина Тогда
		
		СтатусОбновленияОбъектаВИБ = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеОбновлен;
		
	Иначе
		
		// Нет ошибок или :
		// - ИсторияПримененияПКО.ЕстьПредупреждениеОбъектнойБлокировкиОбъекта = Истина
		// - ИсторияПримененияПКО.ЕстьИнформированиеОтказаОтКонвертацииОбъекта ИсторияПримененияПКО
		
	КонецЕсли;
	
	Возврат СтатусОбновленияОбъектаВИБ;
	
КонецФункции

// Получает текст ошибки, которая возникла при работе Правил Конвертации Объекта (нового).
//
// Параметры:
//   ИсторияПримененияПКО - см. КонвертацияОбъектноРезультатыСлужебный.КонструкторИсторииПримененияПКО
//
// Возвращаемое значение:
//   Строка
//
Функция ПредставлениеОшибкиПКО(ИсторияПримененияПКО) Экспорт
	
	ПолноеПредставлениеОшибки = "";
	Если ИсторияПримененияПКО.ЕстьПредупреждениеПриСохранении = Истина Тогда
		
		ПолноеПредставлениеОшибки = ИсторияПримененияПКО.ТекстыОшибокПКО["ПредупреждениеПриСохранении"];
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьПредупреждениеПриЗаписи = Истина Тогда
		
		ПолноеПредставлениеОшибки = ИсторияПримененияПКО.ТекстыОшибокПКО["ПредупреждениеПриЗаписи"];
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьПредупреждениеПриПроведении = Истина Тогда
		
		ПолноеПредставлениеОшибки = ИсторияПримененияПКО.ТекстыОшибокПКО["ПредупреждениеПриПроведении"];
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьПредупреждениеУстановитьВручнуюСоответствие = Истина Тогда
	
		ПолноеПредставлениеОшибки = ИсторияПримененияПКО.ТекстыОшибокПКО["ПредупреждениеУстановитьВручнуюСоответствие"];
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьПредупреждениеНеобходимостиПодтвердитьЗагрузкуДанных = Истина Тогда
		
		ПолноеПредставлениеОшибки = ИсторияПримененияПКО.ТекстыОшибокПКО["ПредупреждениеНеобходимостиПодтвердитьЗагрузкуДанных"];
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьПредупреждениеБлокировкиОбъектаДругимиОбъектами = Истина Тогда
		
		ПолноеПредставлениеОшибки = ИсторияПримененияПКО.ТекстыОшибокПКО["ПредупреждениеБлокировкиОбъектаДругимиОбъектами"];
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьОшибкаКонвертацииСтруктурыXDTO = Истина Тогда
		
		ПолноеПредставлениеОшибки = ИсторияПримененияПКО.ТекстыОшибокПКО["ОшибкаКонвертацииСтруктурыXDTO"];
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьОшибкаКонвертацииСвойстваСтруктурыXDTO = Истина Тогда
		
		ПолноеПредставлениеОшибки = ИсторияПримененияПКО.ТекстыОшибокПКО["ОшибкаКонвертацииСвойстваСтруктурыXDTO"];
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьОшибкаОпределенияПКО = Истина Тогда
		
		ПолноеПредставлениеОшибки = ИсторияПримененияПКО.ТекстыОшибокПКО["ОшибкаОпределенияПКО"];
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьОшибкаПоддерживаемыхОбъектовXDTO = Истина Тогда
		
		ПолноеПредставлениеОшибки = ИсторияПримененияПКО.ТекстыОшибокПКО["ОшибкаПоддерживаемыхОбъектовXDTO"];
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьПредупреждениеИзмененияНеразделенныхДанных = Истина Тогда
		
		ПолноеПредставлениеОшибки = ИсторияПримененияПКО.ТекстыОшибокПКО["ПредупреждениеИзмененияНеразделенныхДанных"];
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьПредупреждениеОбъектнойБлокировкиОбъекта = Истина Тогда
		
		ПолноеПредставлениеОшибки = ИсторияПримененияПКО.ТекстыОшибокПКО["ПредупреждениеОбъектнойБлокировкиОбъекта"];
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьОшибкаСобытияПередЗаписьюПолученныхДанных = Истина Тогда
		
		ПолноеПредставлениеОшибки = ИсторияПримененияПКО.ТекстыОшибокПКО["ОшибкаСобытияПередЗаписьюПолученныхДанных"];
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьОшибкаСобытияПриОбработкеСсылокБлокирующихКонвертацию = Истина Тогда
		
		ПолноеПредставлениеОшибки = ИсторияПримененияПКО.ТекстыОшибокПКО["ОшибкаСобытияПриОбработкеСсылокБлокирующихКонвертацию"];
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьОшибкаСобытияПослеКонвертацииОбъекта = Истина Тогда
		
		ПолноеПредставлениеОшибки = ИсторияПримененияПКО.ТекстыОшибокПКО["ОшибкаСобытияПослеКонвертацииОбъекта"];
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьОшибкаОбработкиУдаленияОбъекта = Истина Тогда
		
		ПолноеПредставлениеОшибки = ИсторияПримененияПКО.ТекстыОшибокПКО["ОшибкаОбработкиУдаленияОбъекта"];
		
	ИначеЕсли ИсторияПримененияПКО.ЕстьИнформированиеОтказаОтКонвертацииОбъекта = Истина Тогда
		
		ПолноеПредставлениеОшибки = ИсторияПримененияПКО.ТекстыОшибокПКО["ИнформированиеОтказаОтКонвертацииОбъекта"];
		
	КонецЕсли;
	
	Возврат ПолноеПредставлениеОшибки;
	
КонецФункции

#КонецОбласти

// Возвращаемое значение:
//   Строка
//
Функция СобытиеЖурналаРегистрацииИнтерактивногоЗапускаОбъектнойКонвертации() Экспорт
	
	Возврат НСтр("ru = 'Обмен данным.Объектно.Интерактивная конвертация'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

Процедура ОтразитьОшибкиПредупрежденияПослеКонвертации(КомпонентыОбмена, ВыборкаДанныхДляОбработки) Экспорт
	
	ЕстьОшибкиПОД = ЕстьОшибкиПОД(КомпонентыОбмена.ИсторияКонвертацииОбъекта);
	
	// Если есть ошибки ПОД, то до выполнения ПКО алгоритм не дошел
	Если ЕстьОшибкиПОД Тогда
		
		ОтразитьОшибкуКонвертацииПОД(КомпонентыОбмена, ВыборкаДанныхДляОбработки);
		
	Иначе
		
		ОтразитьОшибкиКонвертацииПКО(КомпонентыОбмена, ВыборкаДанныхДляОбработки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьОтметкаОПроблемеЗаписиОбъекта(ПричиныДобавления = Неопределено) Экспорт
	
	Если ПричиныДобавления = Неопределено Тогда
		
		МассивПричинДобавления = Новый Массив(2);
		МассивПричинДобавления[0] = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи;
		МассивПричинДобавления[1] = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи;
		
	ИначеЕсли ТипЗнч(ПричиныДобавления) = Тип(Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ПустаяСсылка()) Тогда
		
		МассивПричинДобавления = Новый Массив(1);
		МассивПричинДобавления[0] = ПричиныДобавления;
		
	Иначе
		
		МассивПричинДобавления = ПричиныДобавления;
		
	КонецЕсли;
	
	Возврат РегистрыСведений.ОбъектыКЗагрузке.ЕстьОтметкаОПроблеме(МассивПричинДобавления);
	
КонецФункции

Функция ЕстьОшибкиПКО(ИсторияПримененияПКО) Экспорт
	
	Для каждого ЗаписьСтруктуры Из ИсторияПримененияПКО Цикл
		
		Если (СтрНайти(ЗаписьСтруктуры.Ключ, "ЕстьОшибка") > 0
				ИЛИ СтрНайти(ЗаписьСтруктуры.Ключ, "ЕстьПредупреждение") > 0)
			И ЗаписьСтруктуры.Значение = Истина Тогда
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ЕстьОшибкиПОД(ИсторияКонвертацииОбъекта) Экспорт
	
	Для каждого ЗаписьСтруктуры Из ИсторияКонвертацииОбъекта Цикл
		
		Если (СтрНайти(ЗаписьСтруктуры.Ключ, "ЕстьОшибка") > 0
				ИЛИ СтрНайти(ЗаписьСтруктуры.Ключ, "ЕстьПредупреждение") > 0)
			И ЗаписьСтруктуры.Значение = Истина Тогда
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Получает текст ошибки, которая возникла при работе ПОД.
//
// Параметры:
//   ИсторияКонвертацииОбъекта - см. КонвертацияОбъектноРезультатыСлужебный.КонструкторИсторииПримененияПОД
//
// Возвращаемое значение:
//   Строка
//
Функция ПредставлениеОшибкиПОД(ИсторияКонвертацииОбъекта)
	
	ПолноеПредставлениеОшибки = "";
	ТекстыОшибокПОД = ИсторияКонвертацииОбъекта.ТекстыОшибокПОД;
	
	Для каждого ЭлементСтруктуры Из ИсторияКонвертацииОбъекта Цикл
		
		Если СтрНайти(ЭлементСтруктуры.Ключ, "Есть") > 0
			И ЭлементСтруктуры.Значение = Истина Тогда
			
			ИмяКлюча = СтрЗаменить(ЭлементСтруктуры.Ключ, "Есть", "");
			ПолноеПредставлениеОшибки = ТекстыОшибокПОД[ИмяКлюча];
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПолноеПредставлениеОшибки;
	
КонецФункции

// Возвращает причину добавления ошибки, которая возникла при работе ПОД.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке
//
Функция ПричинаДобавленияОшибкиПОД()
	
	Возврат Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаКонвертации;
	
КонецФункции

// Параметры:
//   СтепеньСжатия - Число - степень сжатия
//   
// Возвращаемое значение:
//   СжатиеДанных
//
Функция СжатиеДанныхПриОтраженииПроблемКонвертации(СтепеньСжатия = 6)
	
	Возврат Новый СжатиеДанных(СтепеньСжатия);
	
КонецФункции

// Возвращает статус ошибки, которая возникла при работе ПОД.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.СтатусыОбновленияОбъектаПриПроблемахЗаписи
//
Функция СтатусОшибкиПОД()
	
	Возврат Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеОбновлен;
	
КонецФункции

Процедура ОтметитьНаличиеПредупреждения(КомпонентыОбмена)
	
	Если НЕ КомпонентыОбмена.Свойство("СостояниеОбменаДанными") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если КомпонентыОбмена.СостояниеОбменаДанными.РезультатВыполненияОбмена = Неопределено
		ИЛИ КомпонентыОбмена.СостояниеОбменаДанными.РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Выполнено Тогда
		
		КомпонентыОбмена.СостояниеОбменаДанными.РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.ВыполненоСПредупреждениями;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПредставлениеБлокировкиОбъекта(ОписаниеНедостающихСсылок, ОписаниеБлокера, ИмяТипа)
	
	ШаблонОписанияСсылки = НСтр("ru ='- нет соответствия для входящего идентификатора %1,
		|из-за этого не получается заполнить реквизит объекта %2.
		|Необходимо назначить соответствие вручную или прислать в это приложение полную выгрузку объекта,
		|который соответствует идентификатору %1.'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	
	Если НЕ ПустаяСтрока(ОписаниеНедостающихСсылок) Тогда
		
		Разделитель = "--------------------------------------------------------------------------";
		ОписаниеНедостающихСсылок = ОписаниеНедостающихСсылок + Символы.ПС + Символы.ПС + Разделитель + Символы.ПС;
		
	КонецЕсли;
	
	ПредставлениеСвойства = ИмяТипа + "." + ОписаниеБлокера.ИмяРеквизита;
	
	ОписаниеНедостающихСсылок = ОписаниеНедостающихСсылок
		+ СтрШаблон(ШаблонОписанияСсылки,
			ОписаниеБлокера.БлокирующийИдентификатор,	// UID вложенной ссылки, которую не смогли распознать (UID блокера)
			ПредставлениеСвойства);						// Имя свойства конвертируемого объекта, которое не смогли заполнить
	
КонецПроцедуры

#Область ОтражениеОшибокНаОбъектыКЗагрузке

Функция ПредставлениеОбъектаJSONВХранилищеЗначений(ПредставлениеОбъектаJSON)
	
	Если НЕ ЗначениеЗаполнено(ПредставлениеОбъектаJSON) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	СжатиеДанных = СжатиеДанныхПриОтраженииПроблемКонвертации();
	Возврат Новый ХранилищеЗначения(ПредставлениеОбъектаJSON, СжатиеДанных);
	
КонецФункции

Функция ИдентификаторОбъектаМетаданныхИзПравилаКонвертации(ПравилоКонвертации)
	
	ОбъектМетаданных = Неопределено;
	Если ПравилоКонвертации = Неопределено Тогда
		
		Возврат ОбъектМетаданных;
		
	КонецЕсли;
	
	Если ПравилоКонвертации.ОбъектДанных <> Неопределено Тогда
		
		ОбъектМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПравилоКонвертации.ОбъектДанных);
		
	КонецЕсли;
	
	Возврат ОбъектМетаданных;
	
КонецФункции

Процедура ОтразитьОшибкиКонвертацииПКО(КомпонентыОбмена, ВыборкаДанныхДляОбработки)
	
	ЭтоСложнаяКонвертация               = (КомпонентыОбмена.ИсторияПримененияПКО.Количество() > 1);
	ИмяОперацииОценкаПроизводительности = "ЗаписьНовойПричиныДобавленияОбъектыКЗагрузке";
	
	Для каждого ЭлементСоответствия Из КомпонентыОбмена.ИсторияПримененияПКО Цикл
		
		ВремяНачала = ОбменДаннымиОценкаПроизводительности.НачатьЗамер();
		
		ИмяПКО = ЭлементСоответствия.Ключ;
		ИсторияПримененияПКО = ЭлементСоответствия.Значение;
		
		Если ТипЗнч(ИсторияПримененияПКО) <> Тип("Структура") Тогда
			
			Продолжить; // Например, "Неопределено", если ПКО не использовалось или были ошибки ПОД. Пропустим.
			
		ИначеЕсли ИсторияПримененияПКО.ЕстьОшибкаКонвертацииСтруктурыXDTO = Истина
			ИЛИ ИсторияПримененияПКО.ЕстьОшибкаОпределенияПКО = Истина
			ИЛИ ИсторияПримененияПКО.ЕстьОшибкаПоддерживаемыхОбъектовXDTO = Истина
			ИЛИ ИсторияПримененияПКО.ЕстьОшибкаСобытияПередЗаписьюПолученныхДанных = Истина
			ИЛИ ИсторияПримененияПКО.ЕстьОшибкаСобытияПриОбработкеСсылокБлокирующихКонвертацию = Истина
			ИЛИ ИсторияПримененияПКО.ЕстьОшибкаСобытияПослеКонвертацииОбъекта = Истина
			Тогда
			
			ОтразитьОшибкуВыполненияПКО(КомпонентыОбмена, ИмяПКО, ИсторияПримененияПКО, ВыборкаДанныхДляОбработки);
			
		ИначеЕсли ИсторияПримененияПКО.ЕстьПредупреждениеБлокировкиОбъектаДругимиОбъектами = Истина Тогда
			
			ОтразитьПроблемуОтсутствующихСсылок(КомпонентыОбмена, ИмяПКО, ИсторияПримененияПКО, ВыборкаДанныхДляОбработки);
			
		ИначеЕсли ИсторияПримененияПКО.ЕстьПредупреждениеУстановитьВручнуюСоответствие = Истина Тогда
			
			ОтразитьПроблемуТребующуюУстановкиСоответствияВручную(КомпонентыОбмена, ИсторияПримененияПКО, ВыборкаДанныхДляОбработки);
			
		ИначеЕсли ИсторияПримененияПКО.ЕстьПредупреждениеНеобходимостиПодтвердитьЗагрузкуДанных = Истина Тогда
			
			ОтразитьНеобходимостьПодтвержденияЗагрузкиДанных(КомпонентыОбмена, ИсторияПримененияПКО, ВыборкаДанныхДляОбработки);
			
		ИначеЕсли ИсторияПримененияПКО.ЕстьПредупреждениеПриПроведении = Истина
			ИЛИ ИсторияПримененияПКО.ЕстьПредупреждениеПриЗаписи = Истина
			ИЛИ ИсторияПримененияПКО.ЕстьПредупреждениеПриСохранении = Истина
			Тогда
			
			ОтразитьПроблемуЗаписиОбъекта(ИмяПКО, ИсторияПримененияПКО, ЭтоСложнаяКонвертация, ВыборкаДанныхДляОбработки);
			
		ИначеЕсли ИсторияПримененияПКО.ЕстьОшибкаОбработкиУдаленияОбъекта = Истина Тогда
			
			ОтразитьПроблемуУдаленияОбъекта(ИмяПКО, ИсторияПримененияПКО, ВыборкаДанныхДляОбработки);
			
		Иначе
			
			// Если хоть одно ПКО отработано удачно, то можно попробовать снять блокировку,
			// т.к. часть, которая удачно обработана снимает проблему конвертации других объектов
			РегистрыСведений.ОбъектыБлокирующиеЗагрузку.СнятьБлокировкуОбъектомДругихОбъектов(ВыборкаДанныхДляОбработки.ПолученныйОбъект);
			КомпонентыОбмена.СчетчикЗагруженныхОбъектов = КомпонентыОбмена.СчетчикЗагруженныхОбъектов + 1;
			
			ИмяОперацииОценкаПроизводительности = "СнятиеБлокировкиОбъектомДругихОбъектов";
			
		КонецЕсли;
		
		ОбменДаннымиОценкаПроизводительности.ЗавершитьЗамер(
				ВремяНачала, ИмяОперацииОценкаПроизводительности, "", КомпонентыОбмена, 
				ОбменДаннымиОценкаПроизводительности.ТипСобытияБиблиотека());
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтразитьОшибкуКонвертацииПОД(КомпонентыОбмена, ВыборкаДанныхДляОбработки)
	
	ВремяНачала = ОбменДаннымиОценкаПроизводительности.НачатьЗамер();
	
	ДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеОбработкиОбъекта();
	ДанныеЗаписи.ПолученныйОбъект = ВыборкаДанныхДляОбработки.ПолученныйОбъект;
	ДанныеЗаписи.ОбъектФормата = ВыборкаДанныхДляОбработки.ОбъектФормата;
	ДанныеЗаписи.УзелПланаОбмена = ВыборкаДанныхДляОбработки.УзелПланаОбмена;
	ДанныеЗаписи.ДатаОбрабатываемойВерсии = ВыборкаДанныхДляОбработки.ДатаДобавления;
	ДанныеЗаписи.ПричинаДобавления = ПричинаДобавленияОшибкиПОД();
	ДанныеЗаписи.СтатусОбновленияОбъектаВИБ = СтатусОшибкиПОД();
	ДанныеЗаписи.ПолноеПредставлениеОшибки = ПредставлениеОшибкиПОД(КомпонентыОбмена.ИсторияКонвертацииОбъекта);

	// Пропускаем:
	// - ПравилоКонвертации: упали при выполнении ПОД, еще не знаем, какие ПКО должны были бы выполниться
	// - ОбъектМетаданных: и по каким метаданным
	РегистрыСведений.ОбъектыКЗагрузке.ОтразитьОбработкуОбъекта(ДанныеЗаписи);
	
	ОбменДаннымиОценкаПроизводительности.ЗавершитьЗамер(
			ВремяНачала, "ЗаписьНовойПричиныДобавленияОбъектыКЗагрузке", "", КомпонентыОбмена, 
			ОбменДаннымиОценкаПроизводительности.ТипСобытияБиблиотека());
	
КонецПроцедуры

Процедура ОтразитьОшибкуВыполненияПКО(КомпонентыОбмена, ИмяПКО, ИсторияПримененияПКО, ВыборкаДанныхДляОбработки)
	
	ОбъектМетаданных = ИдентификаторОбъектаМетаданныхИзПравилаКонвертации(ИсторияПримененияПКО.ПравилоКонвертации);
	ДанныеСконвертированногоОбъекта = ПредставлениеОбъектаJSONВХранилищеЗначений(ИсторияПримененияПКО.ПолученныеДанныеJSON);
	
	ДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеОбработкиОбъекта();
	ДанныеЗаписи.ПолученныйОбъект = ВыборкаДанныхДляОбработки.ПолученныйОбъект;
	ДанныеЗаписи.ОбъектФормата = ВыборкаДанныхДляОбработки.ОбъектФормата;
	ДанныеЗаписи.ПравилоКонвертации = ИмяПКО;
	ДанныеЗаписи.УзелПланаОбмена = ВыборкаДанныхДляОбработки.УзелПланаОбмена;
	ДанныеЗаписи.ВнешняяСсылкаНаОбъект = ИсторияПримененияПКО.НавигационнаяСсылка;
	ДанныеЗаписи.ДатаОбрабатываемойВерсии = ВыборкаДанныхДляОбработки.ДатаДобавления;
	ДанныеЗаписи.ОбъектМетаданных = ОбъектМетаданных;
	ДанныеЗаписи.ПричинаДобавления = ПричинаДобавленияОшибкиПКО(ИсторияПримененияПКО);
	ДанныеЗаписи.СтатусОбновленияОбъектаВИБ = СтатусОшибкиПКО(ИсторияПримененияПКО);
	ДанныеЗаписи.ПолноеПредставлениеОшибки = ПредставлениеОшибкиПКО(ИсторияПримененияПКО);
	ДанныеЗаписи.ДанныеСконвертированногоОбъекта = ДанныеСконвертированногоОбъекта;
	
	РегистрыСведений.ОбъектыКЗагрузке.ОтразитьОбработкуОбъекта(ДанныеЗаписи);
	
КонецПроцедуры

Процедура ОтразитьПроблемуЗаписиОбъекта(ИмяПКО, ИсторияПримененияПКО, ЭтоСложнаяКонвертация, ВыборкаДанныхДляОбработки)
	
	ДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеОбработкиОбъекта();
	ДанныеЗаписи.ПолученныйОбъект = ВыборкаДанныхДляОбработки.ПолученныйОбъект;
	ДанныеЗаписи.ОбъектФормата = ВыборкаДанныхДляОбработки.ОбъектФормата;
	ДанныеЗаписи.ПравилоКонвертации = ИмяПКО;
	ДанныеЗаписи.УзелПланаОбмена = ВыборкаДанныхДляОбработки.УзелПланаОбмена;
	ДанныеЗаписи.ВнешняяСсылкаНаОбъект = ИсторияПримененияПКО.НавигационнаяСсылка;
	ДанныеЗаписи.ДатаОбрабатываемойВерсии = ВыборкаДанныхДляОбработки.ДатаДобавления;
	ДанныеЗаписи.ПричинаДобавления = ПричинаДобавленияОшибкиПКО(ИсторияПримененияПКО);
	ДанныеЗаписи.СтатусОбновленияОбъектаВИБ = СтатусОшибкиПКО(ИсторияПримененияПКО);
	ДанныеЗаписи.ПолноеПредставлениеОшибки = ПредставлениеОшибкиПКО(ИсторияПримененияПКО);
	ДанныеЗаписи.СсылкаНаОбъект = ИсторияПримененияПКО.ДанныеИБСсылка;
	
	Если НЕ ЭтоСложнаяКонвертация Тогда
		
		ОбъектМетаданных = ИдентификаторОбъектаМетаданныхИзПравилаКонвертации(ИсторияПримененияПКО.ПравилоКонвертации);
		ДанныеЗаписи.ОбъектМетаданных = ОбъектМетаданных;
		
	КонецЕсли;
	
	// При выполнении процедуры будет удалена запись без ПКО (если такая есть) и добавлена новая.
	РегистрыСведений.ОбъектыКЗагрузке.ОтразитьОбработкуОбъекта(ДанныеЗаписи);
	
КонецПроцедуры

Процедура ОтразитьПроблемуУдаленияОбъекта(ИмяПКО, ИсторияПримененияПКО, ВыборкаДанныхДляОбработки)
	
	ОбъектМетаданных = ИдентификаторОбъектаМетаданныхИзПравилаКонвертации(ИсторияПримененияПКО.ПравилоКонвертации);
	
	ДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеОбработкиОбъекта();
	ДанныеЗаписи.ПолученныйОбъект = ВыборкаДанныхДляОбработки.ПолученныйОбъект;
	ДанныеЗаписи.ОбъектФормата = ВыборкаДанныхДляОбработки.ОбъектФормата;
	ДанныеЗаписи.ПравилоКонвертации = ИмяПКО;
	ДанныеЗаписи.УзелПланаОбмена = ВыборкаДанныхДляОбработки.УзелПланаОбмена;
	ДанныеЗаписи.ВнешняяСсылкаНаОбъект = ИсторияПримененияПКО.НавигационнаяСсылка;
	ДанныеЗаписи.ДатаОбрабатываемойВерсии = ВыборкаДанныхДляОбработки.ДатаДобавления;
	ДанныеЗаписи.ОбъектМетаданных = ОбъектМетаданных;
	ДанныеЗаписи.СсылкаНаОбъект = ИсторияПримененияПКО.ДанныеИБСсылка;
	ДанныеЗаписи.ПричинаДобавления = ПричинаДобавленияОшибкиПКО(ИсторияПримененияПКО);
	ДанныеЗаписи.СтатусОбновленияОбъектаВИБ = СтатусОшибкиПКО(ИсторияПримененияПКО);
	ДанныеЗаписи.ПолноеПредставлениеОшибки = ПредставлениеОшибкиПКО(ИсторияПримененияПКО);
	
	// При выполнении процедуры будет удалена запись без ПКО (если такая есть) и добавлена новая.
	РегистрыСведений.ОбъектыКЗагрузке.ОтразитьОбработкуОбъекта(ДанныеЗаписи);
	
КонецПроцедуры

Процедура ОтразитьПроблемуОтсутствующихСсылок(КомпонентыОбмена, ИмяПКО, ИсторияПримененияПКО, ВыборкаДанныхДляОбработки)
	
	ОбъектМетаданных = ИдентификаторОбъектаМетаданныхИзПравилаКонвертации(ИсторияПримененияПКО.ПравилоКонвертации);
	ДанныеСконвертированногоОбъекта = ПредставлениеОбъектаJSONВХранилищеЗначений(ИсторияПримененияПКО.ПолученныеДанныеJSON);
	
	ДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеОбработкиОбъекта();
	ДанныеЗаписи.ПолученныйОбъект = ВыборкаДанныхДляОбработки.ПолученныйОбъект;
	ДанныеЗаписи.ОбъектФормата = ВыборкаДанныхДляОбработки.ОбъектФормата;
	ДанныеЗаписи.ПравилоКонвертации = ИмяПКО;
	ДанныеЗаписи.УзелПланаОбмена = ВыборкаДанныхДляОбработки.УзелПланаОбмена;
	ДанныеЗаписи.ВнешняяСсылкаНаОбъект = ИсторияПримененияПКО.НавигационнаяСсылка;
	ДанныеЗаписи.ДатаОбрабатываемойВерсии = ВыборкаДанныхДляОбработки.ДатаДобавления;
	ДанныеЗаписи.ОбъектМетаданных = ОбъектМетаданных;
	ДанныеЗаписи.ПричинаДобавления = ПричинаДобавленияОшибкиПКО(ИсторияПримененияПКО);
	ДанныеЗаписи.СтатусОбновленияОбъектаВИБ = СтатусОшибкиПКО(ИсторияПримененияПКО);
	ДанныеЗаписи.ПолноеПредставлениеОшибки = ПредставлениеОшибкиПКО(ИсторияПримененияПКО);
	ДанныеЗаписи.ДанныеСконвертированногоОбъекта = ДанныеСконвертированногоОбъекта;
	РегистрыСведений.ОбъектыКЗагрузке.ОтразитьОбработкуОбъекта(ДанныеЗаписи);
	
	Для каждого СсылкаБлокирующая Из ИсторияПримененияПКО.СсылкиБлокирующиеКонвертацию Цикл
		
		ДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеОбработкиОбъекта();
		ДанныеЗаписи.ПолученныйОбъект = СсылкаБлокирующая.БлокирующийИдентификатор;
		ДанныеЗаписи.УзелПланаОбмена = ВыборкаДанныхДляОбработки.УзелПланаОбмена;
		ДанныеЗаписи.ВнешняяСсылкаНаОбъект = СсылкаБлокирующая.ВнешняяНавигационнаяСсылка;
		ДанныеЗаписи.ДатаОбрабатываемойВерсии = ВыборкаДанныхДляОбработки.ДатаДобавления;
		ДанныеЗаписи.ОбъектМетаданных = СсылкаБлокирующая.ОписаниеТипа;
		ДанныеЗаписи.ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетсяПолучениеЭтогоОбъекта;
		ДанныеЗаписи.ОбъектФормата = СсылкаБлокирующая.ОбъектФормата;
		ДанныеЗаписи.ПространствоИменОбъектаФормата = СсылкаБлокирующая.ПространствоИменОбъектаФормата;
		РегистрыСведений.ОбъектыКЗагрузке.ОтразитьОбработкуОбъекта(ДанныеЗаписи);
		
		ДанныеЗаписиРегистра = РегистрыСведений.ОбъектыБлокирующиеЗагрузку.НовыйДанныеЗаписиРегистра();
		ДанныеЗаписиРегистра.ПолученныйОбъект = ВыборкаДанныхДляОбработки.ПолученныйОбъект;
		ДанныеЗаписиРегистра.УзелПланаОбмена = ВыборкаДанныхДляОбработки.УзелПланаОбмена;
		ДанныеЗаписиРегистра.ОбъектФормата = ВыборкаДанныхДляОбработки.ОбъектФормата;
		ДанныеЗаписиРегистра.ПравилоКонвертации = ИмяПКО;
		ДанныеЗаписиРегистра.ОбъектКПолучению = СсылкаБлокирующая.БлокирующийИдентификатор;
		ДанныеЗаписиРегистра.ИмяРеквизита = СсылкаБлокирующая.ИмяРеквизита;
		ДанныеЗаписиРегистра.ОписаниеТипа = СсылкаБлокирующая.ОписаниеТипа;
		ДанныеЗаписиРегистра.ОбъектФорматаКПолучению = СсылкаБлокирующая.ОбъектФормата;
		РегистрыСведений.ОбъектыБлокирующиеЗагрузку.ЗаписатьДанные(ДанныеЗаписиРегистра);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтразитьНеобходимостьПодтвержденияЗагрузкиДанных(КомпонентыОбмена, ИсторияПримененияПКО, ВыборкаДанныхДляОбработки)
	
	ОбъектМетаданных = ИдентификаторОбъектаМетаданныхИзПравилаКонвертации(ИсторияПримененияПКО.ПравилоКонвертации);
	ДанныеСконвертированногоОбъекта = ПредставлениеОбъектаJSONВХранилищеЗначений(ИсторияПримененияПКО.ПолученныеДанныеJSON);
	
	ДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеОбработкиОбъекта();
	ДанныеЗаписи.ПолученныйОбъект = КомпонентыОбмена.ИсторияКонвертацииОбъекта.ПолученныйОбъект;
	ДанныеЗаписи.ОбъектФормата = КомпонентыОбмена.ИсторияКонвертацииОбъекта.ОбъектФормата;
	ДанныеЗаписи.ПравилоКонвертации = ИсторияПримененияПКО.ПравилоКонвертации.ИмяПКО;
	ДанныеЗаписи.УзелПланаОбмена = ВыборкаДанныхДляОбработки.УзелПланаОбмена;
	ДанныеЗаписи.ВнешняяСсылкаНаОбъект = ИсторияПримененияПКО.НавигационнаяСсылка;
	ДанныеЗаписи.ДатаОбрабатываемойВерсии = ВыборкаДанныхДляОбработки.ДатаДобавления;
	ДанныеЗаписи.ОбъектМетаданных = ОбъектМетаданных;
	ДанныеЗаписи.СсылкаНаОбъект = ИсторияПримененияПКО.ДанныеИБСсылка;
	ДанныеЗаписи.ПричинаДобавления = ПричинаДобавленияОшибкиПКО(ИсторияПримененияПКО);
	ДанныеЗаписи.СтатусОбновленияОбъектаВИБ = СтатусОшибкиПКО(ИсторияПримененияПКО);
	ДанныеЗаписи.ПолноеПредставлениеОшибки = ПредставлениеОшибкиПКО(ИсторияПримененияПКО);
	ДанныеЗаписи.ДанныеСконвертированногоОбъекта = ДанныеСконвертированногоОбъекта;
	
	РегистрыСведений.ОбъектыКЗагрузке.ОтразитьОбработкуОбъекта(ДанныеЗаписи);
	
КонецПроцедуры

Процедура ОтразитьПроблемуТребующуюУстановкиСоответствияВручную(КомпонентыОбмена, ИсторияПримененияПКО, ВыборкаДанныхДляОбработки)
	
	ПравилоКонвертации = ИсторияПримененияПКО.ПравилоКонвертации;
	ОбъектМетаданных = ИдентификаторОбъектаМетаданныхИзПравилаКонвертации(ПравилоКонвертации);
	ПредставлениеОбъекта = ПредставлениеОбъектаJSONВХранилищеЗначений(ИсторияПримененияПКО.ПолученныеДанныеJSON);
	
	ДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеОбработкиОбъекта();
	ДанныеЗаписи.ПолученныйОбъект = КомпонентыОбмена.ИсторияКонвертацииОбъекта.ПолученныйОбъект;
	ДанныеЗаписи.ОбъектФормата = КомпонентыОбмена.ИсторияКонвертацииОбъекта.ОбъектФормата;
	ДанныеЗаписи.ПравилоКонвертации = ПравилоКонвертации.ИмяПКО;
	ДанныеЗаписи.УзелПланаОбмена = ВыборкаДанныхДляОбработки.УзелПланаОбмена;
	ДанныеЗаписи.ВнешняяСсылкаНаОбъект = ИсторияПримененияПКО.НавигационнаяСсылка;
	ДанныеЗаписи.ДатаОбрабатываемойВерсии = ВыборкаДанныхДляОбработки.ДатаДобавления;
	ДанныеЗаписи.ОбъектМетаданных = ОбъектМетаданных;
	ДанныеЗаписи.ПричинаДобавления = ПричинаДобавленияОшибкиПКО(ИсторияПримененияПКО);
	ДанныеЗаписи.СтатусОбновленияОбъектаВИБ = СтатусОшибкиПКО(ИсторияПримененияПКО);
	ДанныеЗаписи.ПолноеПредставлениеОшибки = ПредставлениеОшибкиПКО(ИсторияПримененияПКО);
	ДанныеЗаписи.ДанныеСконвертированногоОбъекта = ПредставлениеОбъекта;
	
	РегистрыСведений.ОбъектыКЗагрузке.ОтразитьОбработкуОбъекта(ДанныеЗаписи);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти