///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПереданныеПараметры();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ДанныеВозврата());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ДанныеВозврата()
	
	ДанныеВозврата = Новый Структура;
	ДанныеВозврата.Вставить("ПрименитьИзменения",          ПрименитьИзменения);
	ДанныеВозврата.Вставить("НеПоказыватьБольше",          НеПоказыватьБольше); 
	ДанныеВозврата.Вставить("ЗагрузитьОставшиесяКакНовые", Истина);
	
	Возврат ДанныеВозврата;
	
КонецФункции

&НаСервере
Процедура ОбработатьПереданныеПараметры()
	
	ПолноеИмяТипаМетаданных = Параметры.ПолноеИмяТипаМетаданных;
	СинонимТипаМетаданных   = Параметры.СинонимТипаМетаданных;
	
	СформироватьПодсказкиФормы(ПолноеИмяТипаМетаданных, СинонимТипаМетаданных);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПодсказкиФормы(ПолноеИмяТипаМетаданных, СинонимТипаМетаданных)
	
	ТекстДля = РаботаСРезультатамиОбменаКлиентСервер.ТекстДляПоИмениОбъектаМетаданных(
		РаботаСРезультатамиОбменаКлиентСервер.ИмяТипаМетаданныхПоПолномуИмени(ПолноеИмяТипаМетаданных));
		
	ПодсказкаЗаголовок = СтрШаблон(НСтр("ru = '%1 ""%2"" в информационной базе нет объектов, которым не установлено соответствие. Рекомендуется для объектов к загрузке установить действие ""Создать новые"". Ок?'"),
	                               ТекстДля,
	                               СинонимТипаМетаданных);
	
	Элементы.ДекорацияПояснение.Заголовок = Новый ФорматированнаяСтрока(ПодсказкаЗаголовок, , ЦветаСтиля.ПоясняющийТекст);
	
	ПодсказкаПрименитьИзменения = СтрШаблон(НСтр("ru = 'Будет не только установлено действие, но и сразу же применены изменения %1 ""%2""'"),
	                              НРег(ТекстДля),
	                              СинонимТипаМетаданных);
	
	Элементы.ДекорацияПояснениеПрименитьИзменения.Заголовок = Новый ФорматированнаяСтрока(ПодсказкаПрименитьИзменения, , ЦветаСтиля.ПоясняющийТекст);

КонецПроцедуры

#КонецОбласти


