///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	АдресаСерверовМетокВремени = ЭлектроннаяПодписьСлужебный.АдресаСерверовМетокВремени(Значение);
	ТекстОшибки = НСтр("ru = 'Недопустимое значение адреса сервера меток времени: %1.'");
	
	Для Каждого Адрес Из АдресаСерверовМетокВремени Цикл
		СтруктураURL = ОбщегоНазначенияКлиентСервер.СтруктураURI(Адрес);
		Если Не ОбщегоНазначения.ДоменноеИмяКорректное(СтруктураURL.Хост) Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Адрес);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли