///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияПоУмолчанию();
	
	УправлениеДоступностью(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИзменитьНастройкиЗагрузкиПриИзменении(Элемент)
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьПриИзменении(Элемент)
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКомментарийПриИзменении(Элемент)
	
	УправлениеДоступностью(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ДанныеВозврата());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьЗначенияПоУмолчанию()
	
	Загружать                 = "Загружать";
	УстанавливатьСоответствия = Перечисления.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных.Помощником;
	КакЗагружать              = Перечисления.ВариантыДействийПриПолученииДанныхОбмена.Автоматически;
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеВозврата()
	
	ДанныеВозврата = Новый Структура;
	ДанныеВозврата.Вставить("ИзменитьНастройкиЗагрузки", ИзменитьНастройкиЗагрузки);
	ДанныеВозврата.Вставить("Загружать",                 Загружать = "Загружать");
	ДанныеВозврата.Вставить("УстанавливатьСоответствия", УстанавливатьСоответствия);
	ДанныеВозврата.Вставить("КакЗагружать",              КакЗагружать);
	ДанныеВозврата.Вставить("ИзменитьКомментарий",       ИзменитьКомментарий);
	ДанныеВозврата.Вставить("Комментарий",               Комментарий);
	
	Возврат ДанныеВозврата;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностью(Форма)
	
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементыФормы.ГруппаДляНастройкиЗагрузки.ТолькоПросмотр = Не Форма.ИзменитьНастройкиЗагрузки;

	ЭлементыФормы.ГруппаКакЗагружать.ТолькоПросмотр              = (Форма.Загружать = "НеЗагружать");
	ЭлементыФормы.ГруппаУстанавливатьСоответствия.ТолькоПросмотр = (Форма.Загружать = "НеЗагружать");
	
	ЭлементыФормы.Комментарий.ТолькоПросмотр           = Не Форма.ИзменитьКомментарий;
	
	ЭлементыФормы.ФормаОК.Доступность = Форма.ИзменитьНастройкиЗагрузки Или Форма.ИзменитьКомментарий;

КонецПроцедуры

#КонецОбласти 
