///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Позволяет переопределить процедуру выбора при установке соответствия в рабочих местах разбора результатов обмена.
//
// Параметры:
//  СтандартнаяОбработка        - Булево - признак того, что выполнено переопределение стандартной обработки.
//  Форма                       - ФормаКлиентскогоПриложения - форма, из которой выполняется операция.
//  ПолноеИмяОбъектаМетаданных  - Строка - полное имя объекта метаданных, который требуется выбрать.
//  ОповещениеПослеВыбора       - ОписаниеОповещения - его требуется передать в форму, в которой будет происходить выбор.
//
Процедура ПриНачалеВыбораОбъектаДляУстановкиСоответствия(СтандартнаяОбработка, Форма, ПолноеИмяОбъектаМетаданных, ОповещениеПослеВыбора) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти 