///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция ДлительнаяОперацияСклоненияПоПадежам(ИдентификаторФормы, Представление, ПараметрыСклонения) Экспорт
	
	ПараметрыПроцедуры = Новый Структура(
		"Представление,
		|ПараметрыСклонения");
	ПараметрыПроцедуры.Представление = Представление;
	ПараметрыПроцедуры.ПараметрыСклонения = ПараметрыСклонения;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Склонение'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("СклонениеПредставленийОбъектов.ПросклонятьПредставлениеПоВсемПадежамДлительнаяОперация", 
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

Функция ЕстьПравоДоступаКОбъекту(Ссылка) Экспорт
	
	Возврат СклонениеПредставленийОбъектов.ЕстьПравоДоступаКОбъекту(Ссылка);
	
КонецФункции

#КонецОбласти