///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область БазовыеМетодыЗаписи

// Конструктор новой записи регистра
// 
// Возвращаемое значение:
//  Структура - Новый данные записи регистра:
// * ОбъектКПолучению                          - Строка - идентификатор объекта, который блокирует загрузку других объектов.
// * ОбъектФормата                             - Строка - идентификатор объекта формата блокирующего объекта.
// * УзелПланаОбмена                           - ПланОбменаСсылкаИмяПланаОбмена, Неопределено - узел плана обмена, для
//     которого поступило сообщение.
// * Количество                                - Число - количество блокируемых объектов
// * МинимальнаяДатаУстановкиПричиныДобавления - Дата - дата самого раннего заблокированного объекта
//
Функция НовыйДанныеЗаписиРегистра() Экспорт
	
	ДанныеЗаписиРегистра = Новый Структура;
	
	ДанныеЗаписиРегистра.Вставить("ОбъектКПолучению",                          "");
	ДанныеЗаписиРегистра.Вставить("ОбъектФормата",                             "");
	ДанныеЗаписиРегистра.Вставить("УзелПланаОбмена",                           Неопределено);
	ДанныеЗаписиРегистра.Вставить("Количество",                                0);
	ДанныеЗаписиРегистра.Вставить("МинимальнаяДатаУстановкиПричиныДобавления", Дата(1, 1, 1));
	
	Возврат ДанныеЗаписиРегистра;
	
КонецФункции

// Выполняет запись в регистр
// 
// Параметры:
//  ДанныеЗаписи - см. НовыйДанныеЗаписиРегистра
//
Процедура ЗаписатьДанные(ДанныеЗаписи) Экспорт
	
	ДанныеРегистра = НаборИЗаписьРегистра(ДанныеЗаписи);
	
	ЗаполнитьЗначенияСвойств(ДанныеРегистра.ЗаписьНабора, ДанныеЗаписи);
	
	ДанныеРегистра.НаборЗаписей.Записать();
	
КонецПроцедуры

// Удаляет запись из регистра
// 
// Параметры:
//  ДанныеЗаписи - см. НовыйДанныеЗаписиРегистра
//
Процедура УдалитьЗаписьРегистра(ДанныеЗаписи) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектКПолучению.Установить(ДанныеЗаписи.ОбъектКПолучению);
	НаборЗаписей.Отбор.УзелПланаОбмена.Установить(ДанныеЗаписи.УзелПланаОбмена);
	НаборЗаписей.Отбор.ОбъектФормата.Установить(ДанныеЗаписи.ОбъектФормата);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область РасчетЗаписейРегистра

// Рассчитывает данные записей регистра для переданных объектов к получению в виде таблицы.
// 
// Параметры:
//  ТаблицаОбъектыКПолучению - ТаблицаЗначений - содержит объекты к получению:
//   * ОбъектКПолучению - Строка 
// 
Процедура РассчитатьДанныеПоТаблицеОбъектов(ТаблицаОбъектыКПолучению) Экспорт
	
	Если ТаблицаОбъектыКПолучению.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыКПолучению.ОбъектКПолучению        КАК ОбъектКПолучению,
	|	ОбъектыКПолучению.ОбъектФорматаКПолучению КАК ОбъектФорматаКПолучению,
	|	ОбъектыКПолучению.УзелПланаОбмена         КАК УзелПланаОбмена
	|ПОМЕСТИТЬ ОбъектыКПолучению
	|ИЗ
	|	&ОбъектыКПолучению КАК ОбъектыКПолучению
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыКПолучению.ОбъектКПолучению                       КАК ОбъектКПолучению,
	|	ОбъектыКПолучению.ОбъектФорматаКПолучению                КАК ОбъектФорматаКПолучению,
	|	ОбъектыКПолучению.УзелПланаОбмена                        КАК УзелПланаОбмена,
	|	СУММА(ВЫБОР
	|			КОГДА ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ)                                               КАК Количество,
	|	МИНИМУМ(ОбъектыКЗагрузке.ДатаУстановкиПричиныДобавления) КАК МинимальнаяДатаУстановкиПричиныДобавления
	|ИЗ
	|	ОбъектыКПолучению КАК ОбъектыКПолучению
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыБлокирующиеЗагрузку КАК ОбъектыБлокирующиеЗагрузку
	|		ПО ОбъектыКПолучению.ОбъектКПолучению = ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению
	|		И ОбъектыКПолучению.УзелПланаОбмена = ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена
	|		И ОбъектыКПолучению.ОбъектФорматаКПолучению = ОбъектыБлокирующиеЗагрузку.ОбъектФорматаКПолучению
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ПО ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект = ОбъектыКЗагрузке.ПолученныйОбъект
	|			И ОбъектыБлокирующиеЗагрузку.ПравилоКонвертации = ОбъектыКЗагрузке.ПравилоКонвертации
	|			И ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена = ОбъектыКЗагрузке.УзелПланаОбмена
	|			И ОбъектыБлокирующиеЗагрузку.ОбъектФормата = ОбъектыКЗагрузке.ОбъектФормата
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыКПолучению.ОбъектКПолучению,
	|	ОбъектыКПолучению.ОбъектФорматаКПолучению,
	|	ОбъектыКПолучению.УзелПланаОбмена";
	 
	Запрос.УстановитьПараметр("ОбъектыКПолучению", ТаблицаОбъектыКПолучению);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеЗаписи = НовыйДанныеЗаписиРегистра();
		ДанныеЗаписи.ОбъектКПолучению                          = Выборка.ОбъектКПолучению;
		ДанныеЗаписи.ОбъектФормата                             = Выборка.ОбъектФорматаКПолучению;
		ДанныеЗаписи.МинимальнаяДатаУстановкиПричиныДобавления = Выборка.МинимальнаяДатаУстановкиПричиныДобавления;
		ДанныеЗаписи.УзелПланаОбмена                           = Выборка.УзелПланаОбмена;
		
		Если Выборка.Количество = 0 Тогда
			
			УдалитьЗаписьРегистра(ДанныеЗаписи);
			
		Иначе
			
			ДанныеЗаписи.Количество = Выборка.Количество;
			ЗаписатьДанные(ДанныеЗаписи);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняет перерасчет всех записей регистра
Процедура ПересчитатьВсеЗаписиРегистра() Экспорт
	
	ОчиститьЗаписиРегистра();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению              КАК ОбъектКПолучению,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектФорматаКПолучению       КАК ОбъектФорматаКПолучению,
	|	ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена               КАК УзелПланаОбмена,
	|	КОЛИЧЕСТВО(ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению)  КАК Количество,
	|	МИНИМУМ(ОбъектыКЗагрузке.ДатаУстановкиПричиныДобавления) КАК МинимальнаяДатаУстановкиПричиныДобавления
	|ИЗ
	|	РегистрСведений.ОбъектыБлокирующиеЗагрузку КАК ОбъектыБлокирующиеЗагрузку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ПО ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект = ОбъектыКЗагрузке.ПолученныйОбъект
	|			И ОбъектыБлокирующиеЗагрузку.ПравилоКонвертации = ОбъектыКЗагрузке.ПравилоКонвертации
	|			И ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена    = ОбъектыКЗагрузке.УзелПланаОбмена
	|			И ОбъектыБлокирующиеЗагрузку.ОбъектФормата      = ОбъектыКЗагрузке.ОбъектФормата
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению,
	|	ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектФорматаКПолучению";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ДанныеЗаписи = НовыйДанныеЗаписиРегистра();
		ДанныеЗаписи.ОбъектКПолучению                          = Выборка.ОбъектКПолучению;
		ДанныеЗаписи.УзелПланаОбмена                           = Выборка.УзелПланаОбмена;
		ДанныеЗаписи.ОбъектФормата                             = Выборка.ОбъектФорматаКПолучению;
		ДанныеЗаписи.Количество                                = Выборка.Количество;
		ДанныеЗаписи.МинимальнаяДатаУстановкиПричиныДобавления = Выборка.МинимальнаяДатаУстановкиПричиныДобавления;
		
		ЗаписатьДанные(ДанныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция НаборИЗаписьРегистра(ДанныеЗаписи)
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектКПолучению.Установить(ДанныеЗаписи.ОбъектКПолучению);
	НаборЗаписей.Отбор.УзелПланаОбмена.Установить(ДанныеЗаписи.УзелПланаОбмена);
	НаборЗаписей.Отбор.ОбъектФормата.Установить(ДанныеЗаписи.ОбъектФормата);
	
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		
		ЗаписьНабора = НаборЗаписей.Добавить();
		
	Иначе
		
		ЗаписьНабора = НаборЗаписей[0];
		
	КонецЕсли; 
	
	ДанныеРегистра = Новый Структура;
	ДанныеРегистра.Вставить("НаборЗаписей", НаборЗаписей);
	ДанныеРегистра.Вставить("ЗаписьНабора", ЗаписьНабора);
	
	Возврат ДанныеРегистра;
	
КонецФункции

Процедура ОчиститьЗаписиРегистра()
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли