///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Проверяет использование томов хранения файлов для переданного способа хранения.
//
// Параметры:
//  ПроверяемыйСпособХраненияФайлов - Строка - см. значения для "Константа.СпособХраненияФайлов".
//
// Возвращаемое значение:
//  Булево
//
Функция СпособХраненияИспользуетТома(ПроверяемыйСпособХраненияФайлов) Экспорт

	Возврат ПроверяемыйСпособХраненияФайлов <> "ВИнформационнойБазе";

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Изменяет видимость элементов управления "ГруппаПути" и "ИмяХранилищаДвоичныхДанных" на форме элемента справочника "ТомаХраненияФайлов".
//
// Параметры:
//  Форма							- ФормаКлиентскогоПриложения - форма-владелец элементов управления.
//  ПараметрыВидимостиРеквизитов	- Структура - см. РаботаСФайловымАрхивомКлиентСервер.ПараметрыВидимостиРеквизитовОтСпособаХраненияФайлов
//
Процедура ОбновитьВидимостьРеквизитовТомаХраненияФайлов(Форма, ПараметрыВидимостиРеквизитов) Экспорт

	Форма.Элементы.ГруппаПути.Видимость					= ПараметрыВидимостиРеквизитов.ВидимостьГруппаПути;
	Форма.Элементы.ИмяХранилищаДвоичныхДанных.Видимость = ПараметрыВидимостиРеквизитов.ВидимостьИмяХранилищаДвоичныхДанных;

КонецПроцедуры

// Возвращает коллекцию параметров видимости реквизитов на форме элемента справочника "ТомаХраненияФайлов"
//
// Возвращаемое значение:
//  Структура
//
Функция ПараметрыВидимостиРеквизитовОтСпособаХраненияФайлов() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ВидимостьГруппаПути"				, Ложь);
	Результат.Вставить("ВидимостьИмяХранилищаДвоичныхДанных", Ложь);

	Возврат Результат;

КонецФункции

#КонецОбласти