///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область БазовыеМетодыЗаписи

// Конструктор новой записи регистра
// 
// Возвращаемое значение:
//  Структура - Содержит:
// * ПолученныйОбъект                            - Строка - идентификатор полученного объекта. 
// * ПравилоКонвертации                          - Строка - правило, по которому конвертируется полученный объект.
// * ОбъектФормата                               - Строка - имя объекта в пространстве имен.
// * УзелПланаОбмена                             - ПланОбменаСсылкаИмяПланаОбмена 
//                                               - Неопределено - план обмена корреспондент,
//                                                                из которого был получен объект.
// * ПричинаДобавления                           - ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке -
//                                                 причина, по которой выла выполнена запись в регистр
// * СсылкаНаОбъект                              - Произвольный, Неопределено - ссылка на объект в ИБ.
// * ДатаУстановкиПричиныДобавления              - Дата - дата установки текущей причины добавления.
// * ПолноеПредставлениеОшибки                   - Строка - подробное сообщение об ошибке.
// * КраткоеПредставлениеОшибки                  - Строка - краткое сообщение об ошибке.
// * КомментарийАдминистратора                   - Строка - комментарий добавленный администратором при разборе проблемы
// * ДатаОбрабатываемойВерсии                    - Дата   - дата обрабатываемой версии, соответствующая "Дате
//                                                          добавления" в РС "Прочитанные сообщения обмена"
// * ОбъектМетаданных                            - Неопределено, СправочникСсылка.ИдентификаторыОбъектовМетаданных   -
//     дата обрабатываемой версии, соответствующая "Дате добавления" в РС "Прочитанные сообщения обмена"
// * ДанныеСконвертированногоОбъекта             - Неопределено,ХранилищеЗначения   - Данные сконвертированного объекта
//                                                                                    в формате JSON
// * КлючОбрабатывающегоЗадания                  - Строка   - ключ фонового задания, который должен обработать эту запись
// * СтатусОбновленияОбъектаВИБ                  - ПеречислениеСсылка.СтатусыОбновленияОбъектаПриПроблемахЗаписи   -
//                                                 статус обновления, если возникла проблема при записи
// * ДатаОтправкиЗапросаНаВыгрузку               - Дата - дата отправки запроса на выгрузку.
//
Функция НовыйДанныеЗаписиРегистра() Экспорт
	
	ДанныеЗаписиРегистра = Новый Структура;
	
	ДанныеЗаписиРегистра.Вставить("ПолученныйОбъект",                           "");
	ДанныеЗаписиРегистра.Вставить("ПравилоКонвертации",                         "");
	ДанныеЗаписиРегистра.Вставить("УзелПланаОбмена",                            Неопределено);
	ДанныеЗаписиРегистра.Вставить("ОбъектФормата",                              "");

	ДанныеЗаписиРегистра.Вставить("ПричинаДобавления",                          Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ПустаяСсылка());
	ДанныеЗаписиРегистра.Вставить("СсылкаНаОбъект",                             Неопределено);
	ДанныеЗаписиРегистра.Вставить("ДатаУстановкиПричиныДобавления",             Дата(1,1,1));
	ДанныеЗаписиРегистра.Вставить("ПолноеПредставлениеОшибки",                  "");
	ДанныеЗаписиРегистра.Вставить("КраткоеПредставлениеОшибки",                 "");
	ДанныеЗаписиРегистра.Вставить("КомментарийАдминистратора",                  "");
	ДанныеЗаписиРегистра.Вставить("ДатаОбрабатываемойВерсии",                   Дата(1,1,1));
	ДанныеЗаписиРегистра.Вставить("ОбъектМетаданных",                           Неопределено);
	ДанныеЗаписиРегистра.Вставить("ДанныеСконвертированногоОбъекта",            Неопределено);
	ДанныеЗаписиРегистра.Вставить("КлючОбрабатывающегоЗадания",                 "");
	ДанныеЗаписиРегистра.Вставить("СтатусОбновленияОбъектаВИБ",                 Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ПустаяСсылка());
	ДанныеЗаписиРегистра.Вставить("ДатаОтправкиЗапросаНаВыгрузку",              Дата(1,1,1));
	
	Возврат ДанныеЗаписиРегистра;
	
КонецФункции

// Конструктор изменяемой записи регистра. Используется в том случае, если требуется изменить уже существующую запись регистра.
// При изменении записи будут изменены только те данные записи, которые в переданной структуре не будут иметь значение Неопределено.
// 
// Возвращаемое значение:
//  Структура - Содержит:
// * ПолученныйОбъект                            - Строка - идентификатор полученного объекта. 
// * ПравилоКонвертации                          - Строка - правило, по которому конвертируется полученный объект.
// * УзелПланаОбмена                             - ПланОбменаСсылкаИмяПланаОбмена
//                                               - Неопределено - план обмена корреспондент,
//                                                                из которого был получен объект.
// * ОбъектФормата                               - Строка - имя объекта в пространстве имен.
// * ПричинаДобавления                           - Неопределено - причина, по которой выла выполнена запись в регистр.
// * СсылкаНаОбъект                              - Неопределено - ссылка на объект в ИБ.
// * ДатаУстановкиПричиныДобавления              - Неопределено - дата установки текущей причины добавления.
// * ПолноеПредставлениеОшибки                   - Неопределено - подробное сообщение об ошибке.
// * КраткоеПредставлениеОшибки                  - Неопределено - краткое сообщение об ошибке.
// * КомментарийАдминистратора                   - Неопределено - комментарий добавленный администратором при разборе проблемы
// * ДатаОбрабатываемойВерсии                    - Неопределено - необходимо для понимания, соответствует ли информации
//     в данном регистре данным регистра "Прочитанные сообщения обмена"
// * ОбъектМетаданных                            - Неопределено - объект метаданных, который будет получен в результате
//                                                                применения правила конвертации.
// * ДанныеСконвертированногоОбъекта             - Неопределено - Данные сконвертированного объекта в формате JSON
// * КлючОбрабатывающегоЗадания                  - Неопределено - ключ фонового задания, который должен обработать эту запись
// * СтатусОбновленияОбъектаВИБ                  - Неопределено - статус обновления, если возникла проблема при записи
// * ВнешняяСсылкаНаОбъект                       - Неопределено - навигационная ссылка на объект в корреспонденте
// * ИмяОбъектаФорматаЗапросаНаВыгрузку          - Неопределено - имя объекта формата обмена, 
//                                                                по которому отправлен запрос на выгрузку
// * ПространствоИменОбъектаФормата              - Неопределено - пространство имен формата обмена
// * ДатаОтправкиЗапросаНаВыгрузку               - Неопределено - дата отправки запроса на выгрузку объекта
//
Функция НовыйДанныеИзмененияЗаписиРегистра() Экспорт
	
	ДанныеЗаписиРегистра = Новый Структура;
	
	ДанныеЗаписиРегистра.Вставить("ПолученныйОбъект",                           "");
	ДанныеЗаписиРегистра.Вставить("ПравилоКонвертации",                         "");
	ДанныеЗаписиРегистра.Вставить("УзелПланаОбмена",                            Неопределено);
	ДанныеЗаписиРегистра.Вставить("ОбъектФормата",                              "");
	
	ДанныеЗаписиРегистра.Вставить("ПричинаДобавления",                          Неопределено);
	ДанныеЗаписиРегистра.Вставить("СтатусОбновленияОбъектаВИБ",                 Неопределено);
	ДанныеЗаписиРегистра.Вставить("СсылкаНаОбъект",                             Неопределено);
	ДанныеЗаписиРегистра.Вставить("ДатаУстановкиПричиныДобавления",             Неопределено);
	ДанныеЗаписиРегистра.Вставить("ПолноеПредставлениеОшибки",                  Неопределено);
	ДанныеЗаписиРегистра.Вставить("КраткоеПредставлениеОшибки",                 Неопределено);
	ДанныеЗаписиРегистра.Вставить("КомментарийАдминистратора",                  Неопределено);
	ДанныеЗаписиРегистра.Вставить("ДатаОбрабатываемойВерсии",                   Неопределено);
	ДанныеЗаписиРегистра.Вставить("ОбъектМетаданных",                           Неопределено);
	ДанныеЗаписиРегистра.Вставить("ДанныеСконвертированногоОбъекта",            Неопределено);
	ДанныеЗаписиРегистра.Вставить("КлючОбрабатывающегоЗадания",                 Неопределено);
	ДанныеЗаписиРегистра.Вставить("СтатусОбновленияОбъектаВИБ",                 Неопределено);
	ДанныеЗаписиРегистра.Вставить("ВнешняяСсылкаНаОбъект",                      Неопределено);
	ДанныеЗаписиРегистра.Вставить("ИмяОбъектаФорматаЗапросаНаВыгрузку",         Неопределено);
	ДанныеЗаписиРегистра.Вставить("ПространствоИменОбъектаФормата",             Неопределено);
	ДанныеЗаписиРегистра.Вставить("ДатаОтправкиЗапросаНаВыгрузку",              Неопределено);
	
	Возврат ДанныеЗаписиРегистра;
	
КонецФункции

// Конструктор данных успешной обработки объекта
// 
// Возвращаемое значение:
//  Структура - содержит:
// * ПолученныйОбъект                      - Строка - идентификатор полученного объекта.
// * ПравилоКонвертации                    - Строка - правило конвертации, согласно которому обрабатывается объект.
// * УзелПланаОбмена                       - ПланОбменаСсылкаИмяПланаОбмена, Неопределено - узел плана обмена, для
//     которого поступило сообщение.
// * ОбъектФормата                         - Строка - имя объекта в пространстве имен.
// * ДатаОбрабатываемойВерсии              - Дата - соответствует "Дате добавления" в РС "Прочитанные сообщения обмена",
//                                                  если отличается, то были прочитанные новые данные по объекту.
//
Функция НовыйДанныеУспешнойОбработкиОбъекта() Экспорт
	
	ДанныеОбработки = Новый Структура;
	ДанныеОбработки.Вставить("ПолученныйОбъект",                      "");
	ДанныеОбработки.Вставить("ПравилоКонвертации",                    "");
	ДанныеОбработки.Вставить("УзелПланаОбмена",                       Неопределено);
	ДанныеОбработки.Вставить("ОбъектФормата",                         "");
	ДанныеОбработки.Вставить("ДатаОбрабатываемойВерсии",              Дата(1, 1, 1));
	
	Возврат ДанныеОбработки;
	
КонецФункции

// Конструктор данных ошибки обработки объекта
// 
// Возвращаемое значение:
//  Структура - содержит:
// * ПолученныйОбъект                - Строка - идентификатор полученного объекта.
// * ПравилоКонвертации              - Строка - применяемое правило конвертации объекта.
// * УзелПланаОбмена                 - ПланОбменаСсылкаИмяПланаОбмена, Неопределено - узел плана обмена, из которого
//                                                                                    поступило сообщение.
// * ОбъектФормата                   - Строка - имя объекта в пространстве имен.
// * ДатаОбрабатываемойВерсии        - Дата - дата получения объекта.
// * ПричинаДобавления               - ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке, Неопределено -
//                                     причина, по которой выполняется запись в регистр.
// * ПолноеПредставлениеОшибки       - Строка - полное представление ошибки.
// * КраткоеПредставлениеОшибки      - Строка - краткое представление ошибки.
// * ОбъектМетаданных                - СправочникСсылка.ИдентификаторыОбъектовМетаданных, Неопределено - тип объекта
//     метаданных, который будет загружен в ИБ.
// * СсылкаНаОбъект                  - Неопределено - ссылка на объект в ИБ.
// * ДанныеСконвертированногоОбъекта - Неопределено - Данные сконвертированного объекта в формате JSON
// * СтатусОбновленияОбъектаВИБ      - Неопределено - статус обновления, если возникла проблема при записи
//
Функция НовыйДанныеОбработкиОбъекта() Экспорт
	
	ДанныеОбработки = Новый Структура;
	ДанныеОбработки.Вставить("ПолученныйОбъект",                   "");
	ДанныеОбработки.Вставить("ПравилоКонвертации",                 "");
	ДанныеОбработки.Вставить("УзелПланаОбмена",                    Неопределено);
	ДанныеОбработки.Вставить("ОбъектФормата",                      "");
	ДанныеОбработки.Вставить("ДатаОбрабатываемойВерсии",           Дата(1, 1, 1));
	ДанныеОбработки.Вставить("ОбъектМетаданных",                   Неопределено);
	ДанныеОбработки.Вставить("ПричинаДобавления",                  Неопределено);
	ДанныеОбработки.Вставить("ПолноеПредставлениеОшибки",          "");
	ДанныеОбработки.Вставить("КраткоеПредставлениеОшибки",         "");
	ДанныеОбработки.Вставить("ДанныеСконвертированногоОбъекта",    Неопределено);
	ДанныеОбработки.Вставить("СтатусОбновленияОбъектаВИБ",         Неопределено);
	ДанныеОбработки.Вставить("СсылкаНаОбъект",                     Неопределено);
	ДанныеОбработки.Вставить("ВнешняяСсылкаНаОбъект",              "");
	ДанныеОбработки.Вставить("ИмяОбъектаФорматаЗапросаНаВыгрузку", "");
	ДанныеОбработки.Вставить("ПространствоИменОбъектаФормата" ,    "");
	
	Возврат ДанныеОбработки;
	
КонецФункции

// Изменяет существующую запись регистра. Будут изменены только те данные, которые в структуре ДанныеЗаписи не равны Неопределено. 
// 
// Параметры:
//  ДанныеЗаписи - см. НовыйДанныеИзмененияЗаписиРегистра
// 
Процедура ИзменитьЗаписьРегистра(ДанныеЗаписи) Экспорт
	
	ДанныеРегистра = НаборИЗаписьРегистра(ДанныеЗаписи);
	
	Для Каждого КлючИЗначение Из ДанныеЗаписи Цикл
		
		Если КлючИЗначение.Значение <> Неопределено Тогда
			
			ДанныеРегистра.ЗаписьНабора[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеРегистра.НаборЗаписей.Записать();
	
КонецПроцедуры

// Блокирует запись регистра для дальнейшего изменения.
// 
// Параметры:
//  ПолученныйОбъект    - Строка - идентификатор полученного объекта.
//  ПравилоКонвертации  - Строка - применяемое правило конвертации объекта.
//  УзелПланаОбмена     - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, из которого поступило сообщение.
//  ОбъектФормата       - Строка - имя объекта в пространстве имен.
//
Процедура ЗаблокироватьЗаписьРегистра(ПолученныйОбъект, ПравилоКонвертации, УзелПланаОбмена, ОбъектФормата) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОбъектыКЗагрузке");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки.УстановитьЗначение("ПолученныйОбъект",   ПолученныйОбъект);
	ЭлементБлокировки.УстановитьЗначение("ПравилоКонвертации", ПравилоКонвертации);
	ЭлементБлокировки.УстановитьЗначение("ОбъектФормата",      ОбъектФормата);
	ЭлементБлокировки.УстановитьЗначение("УзелПланаОбмена",    УзелПланаОбмена);
	
	// @skip-warning
	Блокировка.Заблокировать();
	
КонецПроцедуры

// Выполняет запись в регистр
// 
// Параметры:
//  ДанныеЗаписи - см. НовыйДанныеЗаписиРегистра
//
Процедура ЗаписатьДанные(ДанныеЗаписи) Экспорт
	
	ДанныеРегистра = НаборИЗаписьРегистра(ДанныеЗаписи);
	
	ЗаполнитьЗначенияСвойств(ДанныеРегистра.ЗаписьНабора, ДанныеЗаписи);
	
	ДанныеРегистра.НаборЗаписей.Записать();
	
КонецПроцедуры

// Удаляет запись из регистра
// 
// Параметры:
//  ДанныеЗаписи - см. НовыйДанныеЗаписиРегистра
//
Процедура УдалитьЗаписьРегистра(ДанныеЗаписи) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПолученныйОбъект.Установить(ДанныеЗаписи.ПолученныйОбъект);
	НаборЗаписей.Отбор.ПравилоКонвертации.Установить(ДанныеЗаписи.ПравилоКонвертации);
	НаборЗаписей.Отбор.УзелПланаОбмена.Установить(ДанныеЗаписи.УзелПланаОбмена);
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Конструктор таблицы ключей записей.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит:
// * ПолученныйОбъект   - Строка
// * ПравилоКонвертации - Строка
// 
Функция НовыйТаблицаКлючейЗаписей() Экспорт
	
	ТаблицаКлючей = Новый ТаблицаЗначений;
	ТаблицаКлючей.Колонки.Добавить("ПолученныйОбъект",   ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаКлючей.Колонки.Добавить("ПравилоКонвертации", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаКлючей.Колонки.Добавить("ОбъектФормата",      ОбщегоНазначения.ОписаниеТипаСтрока(110));
	
	Возврат ТаблицаКлючей;
	
КонецФункции

// Выполняет поиск записей с указанной причиной добавления
// 
// Параметры:
//   ПричиныДобавления - Массив из ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке
//
// Возвращаемое значение:
//   Булево - Истина, если запись с указанной причиной есть
//
Функция ЕстьОтметкаОПроблеме(ПричиныДобавления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПричиныДобавления", ПричиныДобавления);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыКЗагрузке.ДатаУстановкиПричиныДобавления КАК ДатаУстановкиПричиныДобавления,
	|	ОбъектыКЗагрузке.ПолученныйОбъект               КАК ПолученныйОбъект,
	|	ОбъектыКЗагрузке.ПравилоКонвертации             КАК ПравилоКонвертации,
	|	ОбъектыКЗагрузке.ПричинаДобавления              КАК ПричинаДобавления
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|ГДЕ
	|	ОбъектыКЗагрузке.ПричинаДобавления В(&ПричиныДобавления)";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область ПолучениеДанныхДляЗагрузкиФоновымЗаданием

// Формирует данные для загрузки фоновым заданием, которое обрабатывает пользовательскую команду
// 
// Параметры:
//  ИдентификаторФоновогоЗадания - Строка - идентификатор фонового задания
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - содержит:
//   * ПолученныйОбъект                - Строка
//   * ПравилоКонвертации              - Строка 
//   * СсылкаНаОбъект                  - Произвольный
//   * ОбъектМетаданных                - СправочникСсылка.ИдентификаторыОбъектовМетаданных
//   * ДанныеСконвертированногоОбъекта - ХранилищеЗначения
//   * СтатусОбновленияОбъектаВИБ      - ПеречислениеСсылка.СтатусыОбновленияОбъектаПриПроблемахЗаписи
//   * УзелПланаОбмена                 - ПланОбменаСсылкаИмяПланаОбмена
//   * ПространствоИменURI             - Строка
//   * ЛокальноеИмяОбъектаФормата      - Строка
//   * ДатаДобавления                  - Дата
//   * СодержимоеЗаписи                - Строка
//   * ДатаОбрабатываемойВерсии        - Дата
//
Функция ДанныеДляЗагрузкиПоИдентификаторуФоновогоЗадания(ИдентификаторФоновогоЗадания) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыКЗагрузке.ПолученныйОбъект                           КАК ПолученныйОбъект,
	|	ОбъектыКЗагрузке.ПравилоКонвертации                         КАК ПравилоКонвертации,
	|	ОбъектыКЗагрузке.СсылкаНаОбъект                             КАК СсылкаНаОбъект,
	|	ОбъектыКЗагрузке.ОбъектМетаданных                           КАК ОбъектМетаданных,
	|	ОбъектыКЗагрузке.ДанныеСконвертированногоОбъекта            КАК ДанныеСконвертированногоОбъекта,
	|	ОбъектыКЗагрузке.СтатусОбновленияОбъектаВИБ                 КАК СтатусОбновленияОбъектаВИБ,
	|	ОбъектыКЗагрузке.УзелПланаОбмена                            КАК УзелПланаОбмена,
	|	ПрочитанныеДанныеСообщенийОбмена.ПространствоИменURI        КАК ПространствоИменURI,
	|	ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата              КАК ОбъектФормата,
	|	ПрочитанныеДанныеСообщенийОбмена.ДатаДобавления             КАК ДатаДобавления,
	|	ПрочитанныеДанныеСообщенийОбмена.СодержимоеЗаписи           КАК СодержимоеЗаписи,
	|	ОбъектыКЗагрузке.ДатаОбрабатываемойВерсии                   КАК ДатаОбрабатываемойВерсии
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрочитанныеДанныеСообщенийОбмена КАК ПрочитанныеДанныеСообщенийОбмена
	|		ПО ОбъектыКЗагрузке.ПолученныйОбъект = ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект
	|			И ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена = ОбъектыКЗагрузке.УзелПланаОбмена
	|			И ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата   = ОбъектыКЗагрузке.ОбъектФормата
	|ГДЕ
	|	ОбъектыКЗагрузке.КлючОбрабатывающегоЗадания = &ИдентификаторФоновогоЗадания
	|	И ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ГотовоКЗагрузке)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПрочитанныеДанныеСообщенийОбмена.Приоритет";
	
	Запрос.УстановитьПараметр("ИдентификаторФоновогоЗадания", ИдентификаторФоновогоЗадания);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#КонецОбласти

#Область КомплексныеМетодыЗаписи

// Отражает обработку объекта
// 
// Параметры:
//  ДанныеЗаписи  - см. НовыйДанныеОбработкиОбъекта
//
Процедура ОтразитьОбработкуОбъекта(ДанныеЗаписи) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		Если Не ПустаяСтрока(ДанныеЗаписи.ПравилоКонвертации) Тогда
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ПолученныйОбъект.Установить(ДанныеЗаписи.ПолученныйОбъект);
			НаборЗаписей.Отбор.УзелПланаОбмена.Установить(ДанныеЗаписи.УзелПланаОбмена);
			НаборЗаписей.Отбор.ОбъектФормата.Установить(ДанныеЗаписи.ОбъектФормата);
			НаборЗаписей.Отбор.ПравилоКонвертации.Установить(""); 
			
			НаборЗаписей.Прочитать();
	
			Если НаборЗаписей.Количество() > 0 Тогда
				
				ДанныеУдаляемойЗаписи = НовыйДанныеЗаписиРегистра();
				ДанныеУдаляемойЗаписи.ПолученныйОбъект = ДанныеЗаписи.ПолученныйОбъект;
				ДанныеУдаляемойЗаписи.ОбъектФормата    = ДанныеЗаписи.ОбъектФормата;
				ДанныеУдаляемойЗаписи.УзелПланаОбмена  = ДанныеЗаписи.УзелПланаОбмена;
				
				УдалитьЗаписьРегистра(ДанныеУдаляемойЗаписи);
				
			КонецЕсли;
			
		ИначеЕсли ДанныеЗаписи.ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетсяПолучениеЭтогоОбъекта Тогда
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ПолученныйОбъект.Установить(ДанныеЗаписи.ПолученныйОбъект);
			НаборЗаписей.Отбор.ОбъектФормата.Установить(ДанныеЗаписи.ОбъектФормата);
			НаборЗаписей.Отбор.УзелПланаОбмена.Установить(ДанныеЗаписи.УзелПланаОбмена);
			
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() > 0 Тогда
				
				ОтменитьТранзакцию();
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ЗаблокироватьЗаписьРегистра(ДанныеЗаписи.ПолученныйОбъект, ДанныеЗаписи.ПравилоКонвертации, ДанныеЗаписи.УзелПланаОбмена, ДанныеЗаписи.ОбъектФормата);
		
		ПараметрыИзмененияЗаписи = НовыйДанныеИзмененияЗаписиРегистра();
		
		ПараметрыИзмененияЗаписи.ПолученныйОбъект                   = ДанныеЗаписи.ПолученныйОбъект;
		ПараметрыИзмененияЗаписи.ПравилоКонвертации                 = ДанныеЗаписи.ПравилоКонвертации;
		ПараметрыИзмененияЗаписи.УзелПланаОбмена                    = ДанныеЗаписи.УзелПланаОбмена;
		ПараметрыИзмененияЗаписи.ОбъектФормата                      = ДанныеЗаписи.ОбъектФормата;
		ПараметрыИзмененияЗаписи.ПолноеПредставлениеОшибки          = ДанныеЗаписи.ПолноеПредставлениеОшибки;
		ПараметрыИзмененияЗаписи.КраткоеПредставлениеОшибки         = ДанныеЗаписи.КраткоеПредставлениеОшибки;
		ПараметрыИзмененияЗаписи.ОбъектМетаданных                   = ДанныеЗаписи.ОбъектМетаданных;
		ПараметрыИзмененияЗаписи.ПричинаДобавления                  = ДанныеЗаписи.ПричинаДобавления;
		ПараметрыИзмененияЗаписи.ДатаУстановкиПричиныДобавления     = ТекущаяДатаСеанса();
		ПараметрыИзмененияЗаписи.ВнешняяСсылкаНаОбъект              = ДанныеЗаписи.ВнешняяСсылкаНаОбъект;
		ПараметрыИзмененияЗаписи.ПространствоИменОбъектаФормата     = ДанныеЗаписи.ПространствоИменОбъектаФормата;
		
		Если ЗначениеЗаполнено(ДанныеЗаписи.ДанныеСконвертированногоОбъекта) Тогда
			ПараметрыИзмененияЗаписи.ДанныеСконвертированногоОбъекта = ДанныеЗаписи.ДанныеСконвертированногоОбъекта;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЗаписи.СтатусОбновленияОбъектаВИБ) Тогда
			ПараметрыИзмененияЗаписи.СтатусОбновленияОбъектаВИБ = ДанныеЗаписи.СтатусОбновленияОбъектаВИБ;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЗаписи.СсылкаНаОбъект) Тогда
			ПараметрыИзмененияЗаписи.СсылкаНаОбъект = ДанныеЗаписи.СсылкаНаОбъект;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЗаписи.ДатаОбрабатываемойВерсии) Тогда
			ПараметрыИзмененияЗаписи.ДатаОбрабатываемойВерсии = ДанныеЗаписи.ДатаОбрабатываемойВерсии;
		КонецЕсли;
		
		ИзменитьЗаписьРегистра(ПараметрыИзмененияЗаписи);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Отражает успешную обработку объекта. Удаляет запись из регистров "Объекты к загрузке" и "Полученные сообщения обмена"
// 
// Параметры:
//  ДанныеУспешнойОбработки - см. НовыйДанныеУспешнойОбработкиОбъекта
//
Процедура ОтразитьУспешнуюОбработкуОбъекта(ДанныеУспешнойОбработки) Экспорт
	
	НачатьТранзакцию();
	
	Попытка 
		
		Если ПустаяСтрока(ДанныеУспешнойОбработки.ПравилоКонвертации) Тогда 
			
			УдалитьЗаписиРегистраПоПолученномуОбъектуИУзлу(
				ДанныеУспешнойОбработки.ПолученныйОбъект,
				ДанныеУспешнойОбработки.УзелПланаОбмена,
				ДанныеУспешнойОбработки.ОбъектФормата);
			
			УдалитьЗаписьРегистраПрочитанныеДанныеСообщенийОбмена(ДанныеУспешнойОбработки);
			
		Иначе
		
			ЗаблокироватьЗаписьРегистра(ДанныеУспешнойОбработки.ПолученныйОбъект,
			                            ДанныеУспешнойОбработки.ПравилоКонвертации,
			                            ДанныеУспешнойОбработки.УзелПланаОбмена,
			                            ДанныеУспешнойОбработки.ОбъектФормата);
			
			ДанныеЗаписи = НовыйДанныеЗаписиРегистра();
			
			ДанныеЗаписи.ПолученныйОбъект   = ДанныеУспешнойОбработки.ПолученныйОбъект;
			ДанныеЗаписи.ПравилоКонвертации = ДанныеУспешнойОбработки.ПравилоКонвертации;
			ДанныеЗаписи.УзелПланаОбмена    = ДанныеУспешнойОбработки.УзелПланаОбмена;
			ДанныеЗаписи.ОбъектФормата      = ДанныеУспешнойОбработки.ОбъектФормата;
			
			УдалитьЗаписьРегистра(ДанныеЗаписи);
			
			УдалитьЗаписьРегистраПрочитанныеДанныеСообщенийОбменаЕслиНеобходимо(ДанныеУспешнойОбработки);
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		
		ОтменитьТранзакцию();
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Изменяет комментарий у записи
// 
// Параметры:
//  ПолученныйОбъект          - Строка
//  ПравилоКонвертации        - Строка
//  ОбъектФормата             - Строка - имя объекта в пространстве имен
//  УзелПланаОбмена           - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, из которого поступило сообщение.
//  КомментарийАдминистратора - Строка
//
Процедура ИзменитьКомментарий(ПолученныйОбъект, ПравилоКонвертации,  ОбъектФормата, УзелПланаОбмена, КомментарийАдминистратора) Экспорт

	ДанныеИзменения = НовыйДанныеИзмененияЗаписиРегистра();
	ДанныеИзменения.ПолученныйОбъект          = ПолученныйОбъект;
	ДанныеИзменения.ПравилоКонвертации        = ПравилоКонвертации;
	ДанныеИзменения.УзелПланаОбмена           = УзелПланаОбмена;
	ДанныеИзменения.ОбъектФормата             = ОбъектФормата;
	ДанныеИзменения.КомментарийАдминистратора = КомментарийАдминистратора;
	
	ИзменитьЗаписьРегистра(ДанныеИзменения);

КонецПроцедуры

#КонецОбласти

#Область СервисныеПроцедуры

// Удаляет записи РС "Объекты к загрузке" у которых "Дата обрабатываемой версии" меньше чем у записи в РС "Прочитанные
// данные сообщений обмена".
//
Процедура ОчиститьЗаписиПодлежащиеУдалениюПередПередачейНаКонвертацию(ПараметрыОбработки) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыКЗагрузке.ПолученныйОбъект   КАК ПолученныйОбъект,
	|	ОбъектыКЗагрузке.ПравилоКонвертации КАК ПравилоКонвертации,
	|	ОбъектыКЗагрузке.УзелПланаОбмена    КАК УзелПланаОбмена,
	|	ОбъектыКЗагрузке.ОбъектФормата      КАК ОбъектФормата,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)                          КАК ЕстьОбъектыБлокирующиеЗагрузку
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыБлокирующиеЗагрузку КАК ОбъектыБлокирующиеЗагрузку
	|		ПО ОбъектыКЗагрузке.ПолученныйОбъект = ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект
	|			И ОбъектыКЗагрузке.УзелПланаОбмена = ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена
	|			И ОбъектыКЗагрузке.ОбъектФормата = ОбъектыБлокирующиеЗагрузку.ОбъектФормата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрочитанныеДанныеСообщенийОбмена КАК ПрочитанныеДанныеСообщенийОбмена
	|		ПО ОбъектыКЗагрузке.ПолученныйОбъект = ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект
	|			И ОбъектыКЗагрузке.УзелПланаОбмена = ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена
	|			И ОбъектыКЗагрузке.ОбъектФормата   = ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата
	|			И ОбъектыКЗагрузке.ПричинаДобавления <> ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетсяПолучениеЭтогоОбъекта)
	|ГДЕ
	|	ОбъектыКЗагрузке.ДатаОбрабатываемойВерсии < ПрочитанныеДанныеСообщенийОбмена.ДатаДобавления
	|	И &ТекстУсловияПрочитанныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыКЗагрузке.ПолученныйОбъект,
	|	ОбъектыКЗагрузке.ПравилоКонвертации,
	|	ОбъектыКЗагрузке.УзелПланаОбмена,
	|	ОбъектыКЗагрузке.ОбъектФормата";
	
	ТекстУсловияПрочитанныеДанные = "";
	
	Если ЗначениеЗаполнено(ПараметрыОбработки.УзелПланаОбмена) Тогда
		
		ТекстУсловияПрочитанныеДанные = ТекстУсловияПрочитанныеДанные + Символы.ПС + "И ОбъектыКЗагрузке.УзелПланаОбмена = &УзелПланаОбмена";
		Запрос.УстановитьПараметр("УзелПланаОбмена", ПараметрыОбработки.УзелПланаОбмена);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбработки.КлючОбрабатывающегоЗадания) Тогда
		
		ТекстУсловияПрочитанныеДанные = ТекстУсловияПрочитанныеДанные + Символы.ПС + "И ПрочитанныеДанныеСообщенийОбмена.КлючОбрабатывающегоЗадания = &КлючОбрабатывающегоЗадания";
		Запрос.УстановитьПараметр("КлючОбрабатывающегоЗадания", ПараметрыОбработки.КлючОбрабатывающегоЗадания);
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ТекстУсловияПрочитанныеДанные", ТекстУсловияПрочитанныеДанные);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДанныеНеАктуальны = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДанныеНеАктуальны.Количество() > 0 Тогда
		
		НачатьТранзакцию();
		
		Попытка
			
			Пока ВыборкаДанныеНеАктуальны.Следующий() Цикл
				
				ДанныеЗаписи = НовыйДанныеЗаписиРегистра();
				ДанныеЗаписи.ПолученныйОбъект   = ВыборкаДанныеНеАктуальны.ПолученныйОбъект;
				ДанныеЗаписи.ПравилоКонвертации = ВыборкаДанныеНеАктуальны.ПравилоКонвертации;
				ДанныеЗаписи.УзелПланаОбмена    = ВыборкаДанныеНеАктуальны.УзелПланаОбмена;
				ДанныеЗаписи.ОбъектФормата      = ВыборкаДанныеНеАктуальны.ОбъектФормата;
				УдалитьЗаписьРегистра(ДанныеЗаписи);
				
				Если ВыборкаДанныеНеАктуальны.ЕстьОбъектыБлокирующиеЗагрузку Тогда
					
					РегистрыСведений.ОбъектыБлокирующиеЗагрузку.УдалитьЗаписиРегистраПоПолученномуОбъектуПравилуКонвертации(
						ВыборкаДанныеНеАктуальны.ПолученныйОбъект,
						ВыборкаДанныеНеАктуальны.ПравилоКонвертации,
						ВыборкаДанныеНеАктуальны.УзелПланаОбмена,
						ВыборкаДанныеНеАктуальны.ОбъектФормата);
					
				КонецЕсли;
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

// Проверяет есть ли информация о том, что записываемый объект был загружен, но были проблемы при записи.
// Если да, то удаляет запись о проблеме в случае, если форма проблемы не открыта пользователем.
//
// Параметры:
//  Источник - Произвольный - записываемый объект ИБ.
//
Процедура ОбработатьЗаписьПроблемыЗагруженногоОбъектаПриЕгоЗаписи(Источник) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ КонвертацияОбъектноСлужебныйПовтИсп.ЕстьУзлыИспользующиеПообъектныйОбмен() Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеОбъекта = Источник.Метаданные();
	
	Если ОбщегоНазначения.ЭтоРегистр(МетаданныеОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	Если МетаданныеОбъекта.РасширениеКонфигурации() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипыИсключения = ОбменДаннымиСервер.ТипыИсключаемыеИзПроверкиУстраненияПроблемы();
	Если ТипыИсключения.Найти(Источник.Метаданные()) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыКЗагрузке.ПолученныйОбъект         КАК ПолученныйОбъект,
	|	ОбъектыКЗагрузке.ПравилоКонвертации       КАК ПравилоКонвертации,
	|	ОбъектыКЗагрузке.УзелПланаОбмена          КАК УзелПланаОбмена,
	|	ОбъектыКЗагрузке.ОбъектФормата            КАК ОбъектФормата,
	|	ОбъектыКЗагрузке.ДатаОбрабатываемойВерсии КАК ДатаОбрабатываемойВерсии
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|ГДЕ
	|	ОбъектыКЗагрузке.ПричинаДобавления В (ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи),ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи), ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроведения))
	|	И ОбъектыКЗагрузке.СсылкаНаОбъект  = &СсылкаНаОбъект
	|	И ОбъектыКЗагрузке.СтатусОбновленияОбъектаВИБ В (ЗНАЧЕНИЕ(Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженСозданНовый),ЗНАЧЕНИЕ(Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженОбновлен))";
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ОбрабатываемыеПользователемДанные = ПараметрыСеанса.ПроблемыЗагруженныхОбъектовОбрабатываемыеПользователем.Получить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ДанныеУспешнойОбработки = НовыйДанныеУспешнойОбработкиОбъекта();
		ДанныеУспешнойОбработки.ПолученныйОбъект          = Выборка.ПолученныйОбъект;
		ДанныеУспешнойОбработки.ПравилоКонвертации        = Выборка.ПравилоКонвертации;
		ДанныеУспешнойОбработки.УзелПланаОбмена           = Выборка.УзелПланаОбмена;
		ДанныеУспешнойОбработки.ОбъектФормата             = Выборка.ОбъектФормата;
		ДанныеУспешнойОбработки.ДатаОбрабатываемойВерсии  = Выборка.ДатаОбрабатываемойВерсии;
		
		Если ТипЗнч(ОбрабатываемыеПользователемДанные) = Тип("Массив")
			И ОбрабатываемыеПользователемДанные.Количество() > 0 Тогда
			
			ДанныеЗаписи = РаботаСРезультатамиОбменаКлиентСервер.НовыйКлючЗаписиОбъектыКЗагрузке();
			ДанныеЗаписи.ПолученныйОбъект   = Выборка.ПолученныйОбъект;
			ДанныеЗаписи.ПравилоКонвертации = Выборка.ПравилоКонвертации;
			ДанныеЗаписи.УзелПланаОбмена    = Выборка.УзелПланаОбмена;
			ДанныеЗаписи.ОбъектФормата      = Выборка.ОбъектФормата;
			
			Если ИдентификаторНайденнойСтруктурыМассива(ОбрабатываемыеПользователемДанные, ДанныеЗаписи) <> - 1 Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		ОтразитьУспешнуюОбработкуОбъекта(ДанныеУспешнойОбработки);
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтметитьПроблемуКакОбрабатываемуюПользователем(ДанныеЗаписи) Экспорт
	
	ОбрабатываемыеЗаписи = Новый Массив;
	ОбрабатываемыеЗаписи.Добавить(ДанныеЗаписи.ПолученныйОбъект);
	
	ТекущиеДанные = ПараметрыСеанса.ПроблемыЗагруженныхОбъектовОбрабатываемыеПользователем.Получить();
	
	Если ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные = Новый Массив;
	Иначе
		
		ИдентификаторНайденногоЭлемента = ИдентификаторНайденнойСтруктурыМассива(ТекущиеДанные, ДанныеЗаписи);
		
		Если ИдентификаторНайденногоЭлемента <> -1 Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ТекущиеДанные.Добавить(ДанныеЗаписи);
	
	ПараметрыСеанса.ПроблемыЗагруженныхОбъектовОбрабатываемыеПользователем = Новый ХранилищеЗначения(ТекущиеДанные);
	
КонецПроцедуры

Процедура ОтметитьПроблемуКакНеОбрабатываемуюПользователем(ДанныеЗаписи) Экспорт
	
	ТекущиеДанные = ПараметрыСеанса.ПроблемыЗагруженныхОбъектовОбрабатываемыеПользователем.Получить();
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	Иначе
		
		ИдентификаторНайденногоЭлемента = ИдентификаторНайденнойСтруктурыМассива(ТекущиеДанные, ДанныеЗаписи);
		
		Если ИдентификаторНайденногоЭлемента <> -1 Тогда
			ТекущиеДанные.Удалить(ИдентификаторНайденногоЭлемента);
			ПараметрыСеанса.ПроблемыЗагруженныхОбъектовОбрабатываемыеПользователем = Новый ХранилищеЗначения(ТекущиеДанные);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеДанных

// Определяет количество записей по узлам планов обмена.
// 
// Параметры:
//  УзлыПлановОбмена - Массив из ПланОбменаСсылка
// 
// Возвращаемое значение:
//  Неопределено, Соответствие Из Строка - содержит пары "узел" и "количество записей"
//
Функция КоличествоЗаписейПоУзламПланаОбмена(УзлыПлановОбмена) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ОбъектыКЗагрузке.ПолученныйОбъект)     КАК Количество,
	|	ОбъектыКЗагрузке.УзелПланаОбмена                  КАК УзелПланаОбмена
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|ГДЕ
	|	ОбъектыКЗагрузке.УзелПланаОбмена В (&УзлыПлановОбмена)
	|	И ОбъектыКЗагрузке.ПричинаДобавления НЕ В (ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ГотовоКЗагрузке), ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ЗагрузкаОтклонена))
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыКЗагрузке.УзелПланаОбмена";
	
	Запрос.УстановитьПараметр("УзлыПлановОбмена", УзлыПлановОбмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВозвращаемыеДанные = Новый Соответствие;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ВозвращаемыеДанные.Вставить(Выборка.УзелПланаОбмена, Выборка.Количество);
		
	КонецЦикла;
	
	Возврат ВозвращаемыеДанные;
	
КонецФункции

// Определяет количество записей по типам проблем для узлов плана обмена.
// 
// Параметры:
//  УзелПланаОбмена - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, для которого получаются данные
//  ТипыПроблем     - Массив Из ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке - типы проблем, для которых
//                                                                                             получаются данные
//  ТребуютсяИтоги  - Булево - Истина, если в итоговом результате нужно общее количество проблем
// 
// Возвращаемое значение:
//   Соответствие Из ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке - содержит пары "тип проблемы" и
//   "количество записей"
//
Функция КоличествоТиповПроблемПоУзлуПланаОбмена(УзелПланаОбмена, ТипыПроблем = Неопределено, ТребуютсяИтоги = Истина) Экспорт
	
	ДанныеПроблем = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ВложенныйЗапрос.КоличествоОбъектов) КАК КоличествоПроблем,
	|	ВложенныйЗапрос.ПричинаДобавления              КАК ПричинаДобавления
	|ИЗ
	|	(ВЫБРАТЬ
	|		1                                                                                  КАК КоличествоОбъектов,
	|		ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаКонвертации) КАК ПричинаДобавления
	|	ИЗ
	|		РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|	ГДЕ
	|		ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаКонвертации)
	|		И ОбъектыКЗагрузке.УзелПланаОбмена = &УзелПланаОбмена
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		1,
	|		ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетсяПолучениеЭтогоОбъекта) КАК ПричинаДобавления
	|	ИЗ
	|		РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|	ГДЕ
	|		ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетсяПолучениеЭтогоОбъекта)
	|		И ОбъектыКЗагрузке.УзелПланаОбмена = &УзелПланаОбмена
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		1,
	|		ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПоискСоответствия) КАК ПричинаДобавления
	|	ИЗ
	|		РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|	ГДЕ
	|		ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПоискСоответствия)
	|		И ОбъектыКЗагрузке.ОбъектМетаданных <> ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка)
	|		И ОбъектыКЗагрузке.УзелПланаОбмена = &УзелПланаОбмена
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		1,
	|		ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПодтверждение) КАК ПричинаДобавления
	|	ИЗ
	|		РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|	ГДЕ
	|		ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПодтверждение)
	|		И ОбъектыКЗагрузке.УзелПланаОбмена = &УзелПланаОбмена
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		1,
	|		ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи)
	|	ИЗ
	|		РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|	ГДЕ
	|		(ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи)
	|				ИЛИ ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи)
	|				ИЛИ ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроведения)) 
	|		И (ОбъектыКЗагрузке.СтатусОбновленияОбъектаВИБ = ЗНАЧЕНИЕ(Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженСозданНовый)
	|			ИЛИ ОбъектыКЗагрузке.СтатусОбновленияОбъектаВИБ = ЗНАЧЕНИЕ(Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженОбновлен))
	|		И ОбъектыКЗагрузке.УзелПланаОбмена = &УзелПланаОбмена
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		1,
	|		ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи)
	|	ИЗ
	|		РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|	ГДЕ
	|		(ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи)
	|				ИЛИ ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи)
	|				ИЛИ ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроведения)) 
	|		И (ОбъектыКЗагрузке.СтатусОбновленияОбъектаВИБ = ЗНАЧЕНИЕ(Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеСоздан)
	|			ИЛИ ОбъектыКЗагрузке.СтатусОбновленияОбъектаВИБ = ЗНАЧЕНИЕ(Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеОбновлен))
	|		И ОбъектыКЗагрузке.УзелПланаОбмена = &УзелПланаОбмена
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		1,
	|		ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетЗагрузкуДругихОбъектов)
	|	ИЗ
	|		РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|	ГДЕ
	|		ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетЗагрузкуДругихОбъектов)
	|		И ОбъектыКЗагрузке.УзелПланаОбмена = &УзелПланаОбмена) КАК ВложенныйЗапрос
	|ГДЕ &УсловиеПоТипам
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ПричинаДобавления";
	
	Запрос.УстановитьПараметр("УзелПланаОбмена", УзелПланаОбмена);
	
	УсловиеПоТипам = "";
	
	Если ТипыПроблем <> Неопределено Тогда
		
		УсловиеПоТипам = "ГДЕ
		                 |ВложенныйЗапрос.ПричинаДобавления В(&ТипыПроблем)";
		
		Запрос.УстановитьПараметр("ТипыПроблем", ТипыПроблем);
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ &УсловиеПоТипам", УсловиеПоТипам);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВсегоПроблем = 0;
	
	ВыборкаПроблемы = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаПроблемы.Следующий() Цикл
	
		ДанныеПроблем.Вставить(ВыборкаПроблемы.ПричинаДобавления, ВыборкаПроблемы.КоличествоПроблем);
		
		ВсегоПроблем = ВсегоПроблем + ВыборкаПроблемы.КоличествоПроблем;
	
	КонецЦикла;
	
	Если ТребуютсяИтоги Тогда
		
		ДанныеПроблем.Вставить("ВсегоПроблем", ВсегоПроблем);
		
	КонецЕсли;
	
	Возврат ДанныеПроблем;
	
КонецФункции

// Определяет типы объектов метаданных, для которых есть записи.
// 
// Параметры:
//  УзелПланаОбмена       - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, из которого получаются данные.
//  ТипыПроблем           - Массив Из ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке- отбор по типам проблем.
//  ДополнительноеУсловие - Строка - дополнительное условие отбора записей  
// 
// Возвращаемое значение:
//  Неопределено, Соответствие Из Строка - содержит пары "тип проблемы" и "количество записей"
//
Функция ТипыОбъектовМетаданныхСПроблемами(УзелПланаОбмена, ТипыПроблем, ДополнительноеУсловие = "") Экспорт 
	
	ОбъектыМетаданныхСПроблемами = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ОбъектыКЗагрузке.ОбъектМетаданных = ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата, """")
	|			ИНАЧЕ ОбъектыКЗагрузке.ОбъектМетаданных
	|		КОНЕЦ КАК ОбъектМетаданных,
	|		ВЫБОР
	|			КОГДА ОбъектыКЗагрузке.ОбъектМетаданных = ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка)
	|				ТОГДА ЕСТЬNULL(ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата, """")
	|		ИНАЧЕ ИдентификаторыОбъектовМетаданных.Наименование
	|	КОНЕЦ КАК ПредставлениеОбъектаМетаданных
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрочитанныеДанныеСообщенийОбмена КАК ПрочитанныеДанныеСообщенийОбмена
	|		ПО ОбъектыКЗагрузке.ПолученныйОбъект = ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект
	|			И (ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена = ОбъектыКЗагрузке.УзелПланаОбмена)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|		ПО ОбъектыКЗагрузке.ОбъектМетаданных = ИдентификаторыОбъектовМетаданных.Ссылка
	|ГДЕ
	|	ОбъектыКЗагрузке.ПричинаДобавления В(&ТипыПроблем)
	|	И ОбъектыКЗагрузке.УзелПланаОбмена = &УзелПланаОбмена
	|	И &ДополнительноеУсловие";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ДополнительноеУсловие", ДополнительноеУсловие);
	
	Запрос.УстановитьПараметр("УзелПланаОбмена", УзелПланаОбмена);
	Запрос.УстановитьПараметр("ТипыПроблем",     ТипыПроблем);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат ОбъектыМетаданныхСПроблемами;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ОбъектыМетаданныхСПроблемами.Добавить(Выборка.ОбъектМетаданных, Выборка.ПредставлениеОбъектаМетаданных);
	
	КонецЦикла;
	
	ОбъектыМетаданныхСПроблемами.СортироватьПоПредставлению();
	
	Возврат ОбъектыМетаданныхСПроблемами;
	
КонецФункции

// Возвращает сконвертированные данные и соответствие в ИБ полученного объекта
// // 
// Параметры:
//  ДанныеЗаписи - см. НовыйДанныеЗаписиРегистра
// 
// Возвращаемое значение:
//  Неопределено, Структура - Данные полученного объекта:
// * ПолученныйОбъектJSON - Неопределено, Строка - сконвертированные данные
// * СоответствиеВИБ      - Неопределено, Произвольный - установленное полученному объекту соответствие в ИБ
//
Функция ДанныеПолученногоОбъекта(ДанныеЗаписи) Экспорт
	
	ДанныеПолученногоОбъекта = Новый Структура;
	ДанныеПолученногоОбъекта.Вставить("ПолученныйОбъектJSON", Неопределено);
	ДанныеПолученногоОбъекта.Вставить("СоответствиеВИБ",      Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыКЗагрузке.ДанныеСконвертированногоОбъекта КАК ПолученныйОбъект,
	|	ОбъектыКЗагрузке.СсылкаНаОбъект                  КАК СсылкаНаОбъект
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|ГДЕ
	|	ОбъектыКЗагрузке.ПолученныйОбъект     = &ПолученныйОбъект
	|	И ОбъектыКЗагрузке.ПравилоКонвертации = &ПравилоКонвертации
	|	И ОбъектыКЗагрузке.УзелПланаОбмена    = &УзелПланаОбмена
	|	И ОбъектыКЗагрузке.ОбъектФормата      = &ОбъектФормата";
	
	Запрос.УстановитьПараметр("ПолученныйОбъект",   ДанныеЗаписи.ПолученныйОбъект);
	Запрос.УстановитьПараметр("ПравилоКонвертации", ДанныеЗаписи.ПравилоКонвертации);
	Запрос.УстановитьПараметр("УзелПланаОбмена",    ДанныеЗаписи.УзелПланаОбмена);
	Запрос.УстановитьПараметр("ОбъектФормата",      ДанныеЗаписи.ОбъектФормата);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	ДанныеПолученногоОбъекта.ПолученныйОбъектJSON = Выборка.ПолученныйОбъект.Получить();
	ДанныеПолученногоОбъекта.СоответствиеВИБ      = Выборка.СсылкаНаОбъект;
	
	Возврат ДанныеПолученногоОбъекта;
	
КонецФункции

// Возвращает данные записи регистра по ключу записи.
// 
// Параметры:
//  ДанныеЗаписи - Структура - содержит:
//  *  ПолученныйОбъект          - Строка
//  *  ПравилоКонвертации        - Строка
//  *  УзелПланаОбмена           - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, из которого получаются данные.
//  *  ОбъектФормата             - Строка - имя объекта в пространстве имен
// Возвращаемое значение:
//  РегистрСведенийЗапись.ОбъектыКЗагрузке - Данные записи регистра
Функция ДанныеЗаписиРегистра(ДанныеЗаписи) Экспорт
	
	НаборИЗапись = НаборИЗаписьРегистра(ДанныеЗаписи);
	
	Возврат НаборИЗапись.ЗаписьНабора;
	
КонецФункции

// Определяет, есть ли регистре записи, предназначенные для ручного сопоставления.
// 
// Параметры:
//  УзелИнформационнойБазы - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, для которого получаются данные
// 
// Возвращаемое значение:
//  Булево
//
Функция ЕстьДанныеДляРучногоСопоставления(УзелИнформационнойБазы) Экспорт
	
	ЗначениеПеречисления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПоискСоответствия;
	
	ТипыПроблем = Новый Массив;
	ТипыПроблем.Добавить(ЗначениеПеречисления);
	
	КоличествоПроблемПоТипам = КоличествоТиповПроблемПоУзлуПланаОбмена(УзелИнформационнойБазы, ТипыПроблем, Ложь);
	
	Возврат КоличествоПроблемПоТипам.Количество() <> 0
		И (КоличествоПроблемПоТипам[ЗначениеПеречисления] <> Неопределено
			И КоличествоПроблемПоТипам[ЗначениеПеречисления] > 0);
	
КонецФункции

// Возвращает данные этого регистра, которые записаны с причиной добавления "ОжидаетсяПолучениеЭтогоОбъекта".
// 
// Параметры:
//  УзелКорреспондента - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, для которого получаются данные
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//    * ПолученныйОбъект                   - Строка - строка содержащая уникальный идентификатор объекта, который ожидается.
//    * ВнешняяСсылкаНаОбъект              - Строка - внешняя навигационная ссылка на объект, который ожидается к получению.
//    * ОбъектФормата                      - Строка - имя объекта формата EnterpriseData, по которому будет 
//                                                    формироваться запрос повторной выгрузки.
//    * ПространствоИменОбъектаФормата     - Строка - пространство имен объекта формата в котором запрашивается объект.
//    * ПравилоКонвертации                 - Строка - правило конвертации.
//
Функция ОжидаетсяПолучениеДанных(УзелКорреспондента) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОбъектыКЗагрузке.ПолученныйОбъект                   КАК ПолученныйОбъект,
		|	ОбъектыКЗагрузке.ВнешняяСсылкаНаОбъект              КАК ВнешняяСсылкаНаОбъект,
		|	ОбъектыКЗагрузке.ОбъектФормата                      КАК ОбъектФормата,
		|	ОбъектыКЗагрузке.ПространствоИменОбъектаФормата     КАК ПространствоИменОбъектаФормата,
		|	ОбъектыКЗагрузке.ПравилоКонвертации                 КАК ПравилоКонвертации
		|ИЗ
		|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
		|ГДЕ
		|	ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетсяПолучениеЭтогоОбъекта)
		|	И ОбъектыКЗагрузке.УзелПланаОбмена = &УзелКорреспондента";
	
	Запрос.УстановитьПараметр("УзелКорреспондента", УзелКорреспондента);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Отмечает дату отправки запроса на выгрузку объекта.
// 
// Параметры:
//  ОписаниеОтсутствующегоОбъекта - см. ОжидаетсяПолучениеДанных
//  УзелПланаОбмена -  - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, для которого получаются данные
// 
Процедура ОтметитьВыполнениеЗапросаНаВыгрузку(ОписаниеОтсутствующегоОбъекта, УзелПланаОбмена) Экспорт
	
	ДанныеДляИзменения = НовыйДанныеИзмененияЗаписиРегистра();
	
	ДанныеДляИзменения.ПолученныйОбъект   = ОписаниеОтсутствующегоОбъекта.ПолученныйОбъект;
	ДанныеДляИзменения.ПравилоКонвертации = ОписаниеОтсутствующегоОбъекта.ПравилоКонвертации;
	ДанныеДляИзменения.ОбъектФормата      = ОписаниеОтсутствующегоОбъекта.ОбъектФормата;
	ДанныеДляИзменения.УзелПланаОбмена    = УзелПланаОбмена; 
	
	ДанныеЗаписи = ДанныеЗаписиРегистра(ДанныеДляИзменения);
	
	Если ЗначениеЗаполнено(ДанныеЗаписи.ДатаОтправкиЗапросаНаВыгрузку) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляИзменения.ДатаОтправкиЗапросаНаВыгрузку = ТекущаяДатаСеанса();
	
	ИзменитьЗаписьРегистра(ДанныеДляИзменения);
	
КонецПроцедуры

// Возвращает массив ключей записей регистра по переданным типам объектов и причинам добавления.
// 
// Параметры:
//  УзелПланаОбмена   - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, для которого получаются данные
//  ТипыОбъектов      - Массив Из СправочникСсылка.ИдентификаторыОбъектовМетаданных  - типы объектов, для которых
//                                                                                     получаются данные
//  ПричиныДобавления - Массив Из ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке - узел плана обмена, для
//      которого получаются данные
// 
// Возвращаемое значение:
//  Массив Из Структура
//
Функция КлючиЗаписейПоТипамОбъектовИПричинамДобавления(УзелПланаОбмена, ТипыОбъектов, ПричиныДобавления) Экспорт
	
	КлючиЗаписей = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыКЗагрузке.ПолученныйОбъект   КАК ПолученныйОбъект,
	|	ОбъектыКЗагрузке.ПравилоКонвертации КАК ПравилоКонвертации,
	|	ОбъектыКЗагрузке.ОбъектФормата      КАК ОбъектФормата,
	|	ОбъектыКЗагрузке.УзелПланаОбмена    КАК УзелПланаОбмена
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|ГДЕ
	|	ОбъектыКЗагрузке.ПричинаДобавления В(&ПричиныДобавления)
	|	И ОбъектыКЗагрузке.ОбъектМетаданных В(&ТипыОбъектов)
	|	И ОбъектыКЗагрузке.УзелПланаОбмена = &УзелПланаОбмена";
	
	Запрос.УстановитьПараметр("УзелПланаОбмена",   УзелПланаОбмена);
	Запрос.УстановитьПараметр("ПричиныДобавления", ПричиныДобавления);
	Запрос.УстановитьПараметр("ТипыОбъектов",      ТипыОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат КлючиЗаписей;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		КлючЗаписи = РаботаСРезультатамиОбменаКлиентСервер.НовыйКлючЗаписиОбъектыКЗагрузке();
		
		КлючЗаписи.ПолученныйОбъект   = Выборка.ПолученныйОбъект;
		КлючЗаписи.ОбъектФормата      = Выборка.ОбъектФормата;
		КлючЗаписи.ПравилоКонвертации = Выборка.ПравилоКонвертации;
		КлючЗаписи.УзелПланаОбмена    = Выборка.УзелПланаОбмена;
		
		КлючиЗаписей.Добавить(КлючЗаписи);
	
	КонецЦикла;
	
	Возврат КлючиЗаписей;
	
КонецФункции

#КонецОбласти

#Область ПриПолученииОжидаемогоОбъекта

// Определяет причину добавления по настройкам действий при получении и наличию соответствия.
// 
// Параметры:
//  Загружать                 - Булево 
//  КакЗагружать              - ПеречислениеСсылка.ВариантыДействийПриПолученииДанныхОбмена
//  УстанавливатьСоответствия - ПеречислениеСсылка.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных 
//  СсылкаНаОбъект            - Неопределено, Произвольный - соответствие объекту в ИБ, если таковое имеется
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке - Причина добавления по действиям и наличию сопоставления
//
Функция ПричинаДобавленияПоДействиямИНаличиюСопоставления(Загружать, КакЗагружать, УстанавливатьСоответствия, СсылкаНаОбъект) Экспорт
	
	Если Не Загружать Тогда
		
		Возврат Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ЗагрузкаОтклонена;
		
	ИначеЕсли Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		
		Если УстанавливатьСоответствия = Перечисления.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных.Помощником Тогда
			
			Возврат Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПоискСоответствия;
			
		ИначеЕсли КакЗагружать = Перечисления.ВариантыДействийПриПолученииДанныхОбмена.ПослеПодтверждения Тогда
			
			Возврат Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПодтверждение;
			
		Иначе
			
			Возврат Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ГотовоКЗагрузке;
			
		КонецЕсли;
			
	Иначе
		
		Если КакЗагружать = Перечисления.ВариантыДействийПриПолученииДанныхОбмена.ПослеПодтверждения Тогда
			
			Возврат Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПодтверждение;
			
		Иначе
			
			Возврат Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ГотовоКЗагрузке;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

// Выполняет необходимые изменения при установке соответствия другим объектам
// 
// Параметры:
//  ТаблицаОбъектов - ТаблицаЗначений - содержит:
//   * ПолученныйОбъект          - Строка
//   * ПравилоКонвертации        - Строка
//   * УзелПланаОбмена       - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, из которого получаются данные.
//
Процедура ОтразитьИзмененияПриУстановкеСоответствийОбъектамПоТаблице(ТаблицаОбъектов, КлючОбрабатывающегоЗадания = Неопределено) Экспорт
	
	ОбъектыКИзменению = ДанныеОбъектовКИзменениюПоТаблицеДляПроверки(ТаблицаОбъектов);
	
	Если ОбъектыКИзменению = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ДанныеОбъекта Из ОбъектыКИзменению Цикл
		
		ДанныеЗаписи = НовыйДанныеИзмененияЗаписиРегистра();
		ДанныеЗаписи.ПолученныйОбъект   = ДанныеОбъекта.ПолученныйОбъект;
		ДанныеЗаписи.ПравилоКонвертации = ДанныеОбъекта.ПравилоКонвертации;
		ДанныеЗаписи.УзелПланаОбмена    = ДанныеОбъекта.УзелПланаОбмена;
		ДанныеЗаписи.ОбъектФормата      = ДанныеОбъекта.ОбъектФормата;
		Если КлючОбрабатывающегоЗадания <> Неопределено Тогда
			ДанныеЗаписи.КлючОбрабатывающегоЗадания = КлючОбрабатывающегоЗадания;
		КонецЕсли;
		ДанныеЗаписи.ПричинаДобавления =
			ПричинаДобавленияПоДействиямИНаличиюСопоставления(ДанныеОбъекта.Загружать,
			                                                  ДанныеОбъекта.КакЗагружать,
			                                                  ДанныеОбъекта.УстанавливатьСоответствия,
			                                                  ДанныеОбъекта.СсылкаНаОбъект);
		
		ДанныеЗаписи.ПолноеПредставлениеОшибки  = "";
		ДанныеЗаписи.КраткоеПредставлениеОшибки = "";
		
		ИзменитьЗаписьРегистра(ДанныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры

// Получает данные записей объектов, которые нужно изменить, так как они не блокируются другими объектами
// 
// Параметры:
//  ТаблицаОбъектов - ТаблицаЗначений - содержит:
//   *  ПолученныйОбъект          - Строка
//   *  ПравилоКонвертации        - Строка
//   *  УзелПланаОбмена           - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, из которого получаются данные.
//   *  ОбъектФормата             - Строка - имя объекта в пространстве имен
//
// Возвращаемое значение:
// Неопределено, ТаблицаЗначений - содержит:
//  *  ПолученныйОбъект          - Строка
//  *  ПравилоКонвертации        - Строка
//  *  Загружать                 - Булево
//  *  КакЗагружать              - ПеречислениеСсылка.ВариантыДействийПриПолученииДанныхОбмена
//  *  УстанавливатьСоответствия - ПеречислениеСсылка.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных 
//
Функция ДанныеОбъектовКИзменениюПоТаблицеДляПроверки(ТаблицаОбъектов) Экспорт
	
	Если ТаблицаОбъектов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаОбъектов.ПолученныйОбъект   КАК ПолученныйОбъект,
	|	ТаблицаОбъектов.ПравилоКонвертации КАК ПравилоКонвертации,
	|	ТаблицаОбъектов.УзелПланаОбмена    КАК УзелПланаОбмена,
	|	ТаблицаОбъектов.ОбъектФормата      КАК ОбъектФормата
	|ПОМЕСТИТЬ ТаблицаОбъектовКПроверке
	|ИЗ
	|	&ТаблицаОбъектов КАК ТаблицаОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОбъектовКПроверке.ПолученныйОбъект        КАК ПолученныйОбъект,
	|	ТаблицаОбъектовКПроверке.ПравилоКонвертации      КАК ПравилоКонвертации,
	|	ТаблицаОбъектовКПроверке.УзелПланаОбмена         КАК УзелПланаОбмена,
	|	ТаблицаОбъектовКПроверке.ОбъектФормата           КАК ОбъектФормата,
	|	ОбъектыКЗагрузке.ОбъектМетаданных                КАК ОбъектМетаданных,
	|	ОбъектыКЗагрузке.СсылкаНаОбъект                  КАК СсылкаНаОбъект
	|ПОМЕСТИТЬ ОбъектыДляИзмененияПричины
	|ИЗ
	|	ТаблицаОбъектовКПроверке КАК ТаблицаОбъектовКПроверке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|			ПО ТаблицаОбъектовКПроверке.ПолученныйОбъект = ОбъектыКЗагрузке.ПолученныйОбъект
	|			И ТаблицаОбъектовКПроверке.ПравилоКонвертации = ОбъектыКЗагрузке.ПравилоКонвертации
	|			И ТаблицаОбъектовКПроверке.УзелПланаОбмена = ОбъектыКЗагрузке.УзелПланаОбмена
	|			И ТаблицаОбъектовКПроверке.ОбъектФормата   = ОбъектыКЗагрузке.ОбъектФормата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрочитанныеДанныеСообщенийОбмена КАК ПрочитанныеДанныеСообщенийОбмена
	|			ПО ОбъектыКЗагрузке.ПолученныйОбъект = ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект
	|			И ОбъектыКЗагрузке.УзелПланаОбмена = ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена
	|			И ОбъектыКЗагрузке.ОбъектФормата   = ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыБлокирующиеЗагрузку КАК ОбъектыБлокирующиеЗагрузку
	|		ПО (ОбъектыКЗагрузке.ПолученныйОбъект = ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект)
	|			И (ОбъектыКЗагрузке.ПравилоКонвертации = ОбъектыБлокирующиеЗагрузку.ПравилоКонвертации)
	|			И (ОбъектыКЗагрузке.УзелПланаОбмена = ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена)
	|			И (ОбъектыКЗагрузке.ОбъектФормата = ОбъектыБлокирующиеЗагрузку.ОбъектФормата)
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОбъектовКПроверке.ПолученныйОбъект,
	|	ТаблицаОбъектовКПроверке.ПравилоКонвертации,
	|	ТаблицаОбъектовКПроверке.УзелПланаОбмена,
	|	ТаблицаОбъектовКПроверке.ОбъектФормата,
	|	ОбъектыКЗагрузке.ОбъектМетаданных,
	|	ОбъектыКЗагрузке.СсылкаНаОбъект
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению) = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыДляИзмененияПричины.ПолученныйОбъект                                                                                                                          КАК ПолученныйОбъект,
	|	ОбъектыДляИзмененияПричины.ПравилоКонвертации                                                                                                                        КАК ПравилоКонвертации,
	|	ОбъектыДляИзмененияПричины.УзелПланаОбмена                                                                                                                           КАК УзелПланаОбмена,
	|	ОбъектыДляИзмененияПричины.ОбъектФормата                                                                                                                             КАК ОбъектФормата,
	|	ЕСТЬNULL(ДействияПриПолученииДанныхОбмена.Загружать, ИСТИНА)                                                                                                         КАК Загружать,
	|	ЕСТЬNULL(ДействияПриПолученииДанныхОбмена.КакЗагружать, ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПриПолученииДанныхОбмена.ПослеПодтверждения))                          КАК КакЗагружать,
	|	ЕСТЬNULL(ДействияПриПолученииДанныхОбмена.УстанавливатьСоответствия, ЗНАЧЕНИЕ(Перечисление.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных.Помощником)) КАК УстанавливатьСоответствия,
	|	ОбъектыДляИзмененияПричины.СсылкаНаОбъект КАК СсылкаНаОбъект
	|ИЗ
	|	ОбъектыДляИзмененияПричины КАК ОбъектыДляИзмененияПричины
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействияПриПолученииДанныхОбмена КАК ДействияПриПолученииДанныхОбмена
	|		ПО ОбъектыДляИзмененияПричины.УзелПланаОбмена = ДействияПриПолученииДанныхОбмена.УзелПланаОбмена
	|			И ОбъектыДляИзмененияПричины.ОбъектМетаданных = ДействияПриПолученииДанныхОбмена.ОбъектМетаданных";
	
	Запрос.УстановитьПараметр("ТаблицаОбъектов",        ТаблицаОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецОбласти

#Область ОчисткаНекорректныхЗаписей

// Проверяет наличие объектов с причинами добавления "Требуется ожидание этого объекта" или "Ожидает загрузку других объектов"
// и удаляет их или переводит в статус "Готово к загрузке"
//
Процедура ПеревестиБолееНеБлокируемыеОбъектыВСтатусГотовКЗагрузке() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыКЗагрузке.ПолученныйОбъект   КАК ПолученныйОбъект,
	|	ОбъектыКЗагрузке.ПравилоКонвертации КАК ПравилоКонвертации,
	|	ОбъектыКЗагрузке.УзелПланаОбмена    КАК УзелПланаОбмена,
	|	ОбъектыКЗагрузке.ОбъектФормата      КАК ОбъектФормата,
	|	ОбъектыКЗагрузке.ПричинаДобавления  КАК ПричинаДобавления,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)                           КАК ЕстьБлокирующиеЗагрузку
	|ПОМЕСТИТЬ ОжидающиеЗагрузкуДругих
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыБлокирующиеЗагрузку КАК ОбъектыБлокирующиеЗагрузку
	|		ПО ОбъектыКЗагрузке.ПолученныйОбъект = ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект
	|			И ОбъектыКЗагрузке.ПравилоКонвертации = ОбъектыБлокирующиеЗагрузку.ПравилоКонвертации
	|			И ОбъектыКЗагрузке.УзелПланаОбмена = ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена
	|			И ОбъектыКЗагрузке.ОбъектФормата = ОбъектыБлокирующиеЗагрузку.ОбъектФормата
	|ГДЕ
	|	ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетЗагрузкуДругихОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыКЗагрузке.ПолученныйОбъект,
	|	ОбъектыКЗагрузке.ПравилоКонвертации,
	|	ОбъектыКЗагрузке.УзелПланаОбмена,
	|	ОбъектыКЗагрузке.ОбъектФормата,
	|	ОбъектыКЗагрузке.ПричинаДобавления
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) = ЛОЖЬ
	|;
	|
	|/////////////////////////////////////////////////////////////////////////1
	|ВЫБРАТЬ
	|	ОбъектыКЗагрузке.ПолученныйОбъект   КАК ПолученныйОбъект,
	|	""""                                КАК ПравилоКонвертации,
	|	ОбъектыКЗагрузке.УзелПланаОбмена    КАК УзелПланаОбмена,
	|	ОбъектыКЗагрузке.ОбъектФормата      КАК ОбъектФормата,
	|	ОбъектыКЗагрузке.ПричинаДобавления  КАК ПричинаДобавления,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)                           КАК ЕстьБлокирующиеЗагрузку
	|ПОМЕСТИТЬ ОжидающиеПолученияЭтого
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыБлокирующиеЗагрузку КАК ОбъектыБлокирующиеЗагрузку
	|		ПО ОбъектыКЗагрузке.ПолученныйОбъект = ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению
	|		И ОбъектыКЗагрузке.УзелПланаОбмена = ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена
	|		И ОбъектыКЗагрузке.ОбъектФормата = ОбъектыБлокирующиеЗагрузку.ОбъектФорматаКПолучению
	|ГДЕ
	|	ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетсяПолучениеЭтогоОбъекта)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыКЗагрузке.ПолученныйОбъект,
	|	ОбъектыКЗагрузке.ПравилоКонвертации,
	|	ОбъектыКЗагрузке.УзелПланаОбмена,
	|	ОбъектыКЗагрузке.ОбъектФормата,
	|	ОбъектыКЗагрузке.ПричинаДобавления
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) = ЛОЖЬ
	|;
	|
	|/////////////////////////////////////////////////////////////////////////2
	|ВЫБРАТЬ
	|	ОжидающиеЗагрузкуДругих.ПолученныйОбъект    КАК ПолученныйОбъект,
	|	ОжидающиеЗагрузкуДругих.ПравилоКонвертации  КАК ПравилоКонвертации,
	|	ОжидающиеЗагрузкуДругих.УзелПланаОбмена     КАК УзелПланаОбмена,
	|	ОжидающиеЗагрузкуДругих.ОбъектФормата       КАК ОбъектФормата,
	|	ОжидающиеЗагрузкуДругих.ПричинаДобавления   КАК ПричинаДобавления
	|ИЗ
	|	ОжидающиеЗагрузкуДругих КАК ОжидающиеЗагрузкуДругих
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОжидающиеПолученияЭтого.ПолученныйОбъект,
	|	ОжидающиеПолученияЭтого.ПравилоКонвертации,
	|	ОжидающиеПолученияЭтого.УзелПланаОбмена,
	|	ОжидающиеПолученияЭтого.ОбъектФормата,
	|	ОжидающиеПолученияЭтого.ПричинаДобавления
	|ИЗ
	|	ОжидающиеПолученияЭтого КАК ОжидающиеПолученияЭтого";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетсяПолучениеЭтогоОбъекта Тогда
			
			ДанныеЗаписи = НовыйДанныеЗаписиРегистра();
			ДанныеЗаписи.ПолученныйОбъект   = Выборка.ПолученныйОбъект;
			ДанныеЗаписи.ПравилоКонвертации = Выборка.ПравилоКонвертации;
			ДанныеЗаписи.УзелПланаОбмена    = Выборка.УзелПланаОбмена;
			ДанныеЗаписи.ОбъектФормата      = Выборка.ОбъектФормата;
			
			УдалитьЗаписьРегистра(ДанныеЗаписи);
			
			
		ИначеЕсли Выборка.ПричинаДобавления = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетЗагрузкуДругихОбъектов Тогда
			
			ДанныеЗаписи = НовыйДанныеИзмененияЗаписиРегистра();
			ДанныеЗаписи.ПолученныйОбъект               = Выборка.ПолученныйОбъект;
			ДанныеЗаписи.ПравилоКонвертации             = Выборка.ПравилоКонвертации;
			ДанныеЗаписи.УзелПланаОбмена                = Выборка.УзелПланаОбмена;
			ДанныеЗаписи.ОбъектФормата                  = Выборка.ОбъектФормата;
			ДанныеЗаписи.ПричинаДобавления              = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ГотовоКЗагрузке;
			ДанныеЗаписи.ДатаУстановкиПричиныДобавления = ТекущаяДатаСеанса();
			
			УдалитьЗаписьРегистра(ДанныеЗаписи);
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

// Проверяет наличие записей, у которых указано правило конвертации,  но данные правила уже не поддерживаются текущей
// версией приложения.
//
Процедура ПроверитьНаличиеЗаписейБезАктуальныхПКО() Экспорт
	
	УзлыПоКоторымЕстьЗаписи = УзлыПлановОбменаПоКоторымЕстьЗаписи();
	
	Если УзлыПоКоторымЕстьЗаписи.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаАктуальныхПКО = НовыйТаблицаДляПроверкиАктуальностиПКО();
	
	Для Каждого УзелПланаОбмена Из УзлыПоКоторымЕстьЗаписи Цикл
		
		Если Не ЗначениеЗаполнено(УзелПланаОбмена) Тогда
			Продолжить;
		КонецЕсли;
		
		КомпонентыОбмена = КонвертацияОбъектноСлужебныйПовтИсп.КомпонентыОбменаДляИнтерактивнойРаботы(УзелПланаОбмена, "Получение");
	
		Если КомпонентыОбмена = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		КонвертацияОбъектноРецепцияСервер.ИнициализироватьТаблицыПравилОбмена(КомпонентыОбмена, Истина);
		
		Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(КомпонентыОбмена, "ПравилаКонвертацииОбъектов") Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если Не ТипЗнч(КомпонентыОбмена.ПравилаКонвертацииОбъектов) = Тип("ТаблицаЗначений") Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Для Каждого ОписаниеПравилаКонвертации Из КомпонентыОбмена.ПравилаКонвертацииОбъектов Цикл
			
			СтрокаТаблицыАктуальныхПКО = ТаблицаАктуальныхПКО.Добавить();
			СтрокаТаблицыАктуальныхПКО.УзелПланаОбмена            = УзелПланаОбмена;
			СтрокаТаблицыАктуальныхПКО.ОбъектФормата              = ОписаниеПравилаКонвертации.ОбъектФормата;
			СтрокаТаблицыАктуальныхПКО.ПравилоКонвертации         = ОписаниеПравилаКонвертации.ИмяПКО;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ТаблицаАктуальныхПКО.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьЗаписиПоТаблицеАктуальныхПКО(ТаблицаАктуальныхПКО)
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Функция НаборИЗаписьРегистра(ДанныеЗаписи)
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПолученныйОбъект.Установить(ДанныеЗаписи.ПолученныйОбъект);
	НаборЗаписей.Отбор.ПравилоКонвертации.Установить(ДанныеЗаписи.ПравилоКонвертации);
	НаборЗаписей.Отбор.УзелПланаОбмена.Установить(ДанныеЗаписи.УзелПланаОбмена);
	НаборЗаписей.Отбор.ОбъектФормата.Установить(ДанныеЗаписи.ОбъектФормата);
	
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		
		ЗаписьНабора = НаборЗаписей.Добавить();
		
	Иначе
		
		ЗаписьНабора = НаборЗаписей[0];
		
	КонецЕсли; 
	
	ДанныеРегистра = Новый Структура;
	ДанныеРегистра.Вставить("НаборЗаписей", НаборЗаписей);
	ДанныеРегистра.Вставить("ЗаписьНабора", ЗаписьНабора);
	
	Возврат ДанныеРегистра;
	
КонецФункции

Процедура УдалитьЗаписьРегистраПрочитанныеДанныеСообщенийОбмена(ДанныеУспешнойОбработки)
	
	РегистрыСведений.ПрочитанныеДанныеСообщенийОбмена.ЗаблокироватьЗаписьРегистра(ДанныеУспешнойОбработки.ПолученныйОбъект,
	                                                                              ДанныеУспешнойОбработки.УзелПланаОбмена,
	                                                                              ДанныеУспешнойОбработки.ОбъектФормата);
	
	ДанныеЗаписи = РегистрыСведений.ПрочитанныеДанныеСообщенийОбмена.НовыйДанныеЗаписиРегистра();
	ДанныеЗаписи.ПолученныйОбъект = ДанныеУспешнойОбработки.ПолученныйОбъект;
	ДанныеЗаписи.УзелПланаОбмена  = ДанныеУспешнойОбработки.УзелПланаОбмена;
	ДанныеЗаписи.ОбъектФормата    = ДанныеУспешнойОбработки.ОбъектФормата;
	ДанныеЗаписи.ДатаДобавления   = ДанныеУспешнойОбработки.ДатаОбрабатываемойВерсии;
	
	РегистрыСведений.ПрочитанныеДанныеСообщенийОбмена.УдалитьЗаписьРегистра(ДанныеЗаписи, Истина);
	
КонецПроцедуры

Процедура УдалитьЗаписьРегистраПрочитанныеДанныеСообщенийОбменаЕслиНеобходимо(ДанныеЗаписи)
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПолученныйОбъект.Установить(ДанныеЗаписи.ПолученныйОбъект);
	НаборЗаписей.Отбор.УзелПланаОбмена.Установить(ДанныеЗаписи.УзелПланаОбмена);
	НаборЗаписей.Отбор.ОбъектФормата.Установить(ДанныеЗаписи.ОбъектФормата);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		УдалитьЗаписьРегистраПрочитанныеДанныеСообщенийОбмена(ДанныеЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИдентификаторНайденнойСтруктурыМассива(МассивДанных, ИскомаяСтруктура)
	
	Для Инд = 0 По МассивДанных.Количество() - 1 Цикл
	
		Если ОбщегоНазначения.КоллекцииИдентичны(МассивДанных[Инд], ИскомаяСтруктура) Тогда
			Возврат Инд;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат - 1;
	
КонецФункции

// Блокирует запись регистра для дальнейшего изменения.
// 
// Параметры:
//  ПолученныйОбъект - Строка - идентификатор полученного объекта.
//  УзелПланаОбмена     - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, из которого поступило сообщение.
//
Процедура ЗаблокироватьНаборЗаписейПоПолученномуОбъектуИУзлу(ПолученныйОбъект, УзелПланаОбмена)
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОбъектыКЗагрузке");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки.УстановитьЗначение("ПолученныйОбъект", ПолученныйОбъект);
	ЭлементБлокировки.УстановитьЗначение("УзелПланаОбмена",  УзелПланаОбмена);
	
	// @skip-warning
	Блокировка.Заблокировать();
	
КонецПроцедуры

// Удаляет записи регистра по полученному объекту
// 
// Параметры:
//  ПолученныйОбъект  - Строка
//  УзелПланаОбмена   - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, из которого поступило сообщение.
//  ОбъектФормата       - Строка - имя объекта в пространстве имен
//
Процедура УдалитьЗаписиРегистраПоПолученномуОбъектуИУзлу(ПолученныйОбъект, УзелПланаОбмена, ОбъектФормата)
	
	НаборЗаписей = СоздатьНаборЗаписей();
	ЗаблокироватьНаборЗаписейПоПолученномуОбъектуИУзлу(ПолученныйОбъект, УзелПланаОбмена);
	НаборЗаписей.Отбор.ПолученныйОбъект.Установить(ПолученныйОбъект);
	НаборЗаписей.Отбор.УзелПланаОбмена.Установить(УзелПланаОбмена);
	НаборЗаписей.Отбор.ОбъектФормата.Установить(ОбъектФормата);
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОчисткаНекорректныхЗаписей

Процедура ПроверитьЗаписиПоТаблицеАктуальныхПКО(ТаблицаАктуальныхПКО)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	АктуальныеПравилаКонвертации.ОбъектФормата       КАК ОбъектФормата,
	|	АктуальныеПравилаКонвертации.ПравилоКонвертации  КАК ПравилоКонвертации,
	|	АктуальныеПравилаКонвертации.УзелПланаОбмена     КАК УзелПланаОбмена
	|ПОМЕСТИТЬ АктуальныеПравилаКонвертации
	|ИЗ
	|	&АктуальныеПравилаКонвертации КАК АктуальныеПравилаКонвертации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыКЗагрузке.ПолученныйОбъект    КАК ПолученныйОбъект,
	|	ОбъектыКЗагрузке.ПравилоКонвертации  КАК ПравилоКонвертации,
	|	ОбъектыКЗагрузке.УзелПланаОбмена     КАК УзелПланаОбмена,
	|	ОбъектыКЗагрузке.ОбъектФормата       КАК ОбъектФормата
	|ПОМЕСТИТЬ ЗаписиСПКО
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|ГДЕ
	|	ОбъектыКЗагрузке.ПравилоКонвертации <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписиСПКО.ПолученныйОбъект           КАК ПолученныйОбъект,
	|	ЗаписиСПКО.ПравилоКонвертации         КАК ПравилоКонвертации,
	|	ЗаписиСПКО.УзелПланаОбмена            КАК УзелПланаОбмена,
	|	ЗаписиСПКО.ОбъектФормата              КАК ОбъектФормата,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОбъектыБлокирующиеЗагрузку.ПравилоКонвертации ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ЕстьЗаписиБлокирующиеОбъекты
	|ИЗ
	|	ЗаписиСПКО КАК ЗаписиСПКО
	|		ЛЕВОЕ СОЕДИНЕНИЕ АктуальныеПравилаКонвертации КАК АктуальныеПравилаКонвертации
	|		ПО ЗаписиСПКО.ПравилоКонвертации = АктуальныеПравилаКонвертации.ПравилоКонвертации
	|			И ЗаписиСПКО.УзелПланаОбмена = АктуальныеПравилаКонвертации.УзелПланаОбмена
	|			И (ЗаписиСПКО.ОбъектФормата = АктуальныеПравилаКонвертации.ОбъектФормата
	|				ИЛИ ЗаписиСПКО.ОбъектФормата = &УдалениеОбъекта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыБлокирующиеЗагрузку КАК ОбъектыБлокирующиеЗагрузку
	|		ПО ЗаписиСПКО.ПолученныйОбъект = ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект
	|			И ЗаписиСПКО.ПравилоКонвертации = ОбъектыБлокирующиеЗагрузку.ПравилоКонвертации
	|			И ЗаписиСПКО.ОбъектФормата = ОбъектыБлокирующиеЗагрузку.ОбъектФормата
	|			И ЗаписиСПКО.УзелПланаОбмена = ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена
	|ГДЕ
	|	АктуальныеПравилаКонвертации.ОбъектФормата ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаписиСПКО.ПолученныйОбъект,
	|	ЗаписиСПКО.ПравилоКонвертации,
	|	ЗаписиСПКО.УзелПланаОбмена,
	|	ЗаписиСПКО.ОбъектФормата";
	
	Запрос.УстановитьПараметр("АктуальныеПравилаКонвертации", ТаблицаАктуальныхПКО);
	Запрос.УстановитьПараметр("УдалениеОбъекта", ОбменДаннымиXDTOСервер.КлассФорматаУдалениеОбъекта());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			ДанныеЗаписи = НовыйДанныеЗаписиРегистра();
			ДанныеЗаписи.ПолученныйОбъект   = Выборка.ПолученныйОбъект;
			ДанныеЗаписи.ПравилоКонвертации = Выборка.ПравилоКонвертации;
			ДанныеЗаписи.ОбъектФормата      = Выборка.ОбъектФормата;
			ДанныеЗаписи.УзелПланаОбмена    = Выборка.УзелПланаОбмена;
			
			УдалитьЗаписьРегистра(ДанныеЗаписи);
			
			Если Выборка.ЕстьЗаписиБлокирующиеОбъекты Тогда
				
				РегистрыСведений.ОбъектыБлокирующиеЗагрузку.УдалитьЗаписиРегистраПоПолученномуОбъектуПравилуКонвертации(
					Выборка.ПолученныйОбъект, Выборка.ПравилоКонвертации, Выборка.УзелПланаОбмена, Выборка.ОбъектФормата);
				
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НовыйТаблицаДляПроверкиАктуальностиПКО()
	
	ТаблицаДляПроверки = Новый ТаблицаЗначений;
	
	ТаблицаДляПроверки.Колонки.Добавить("ОбъектФормата",      ОбщегоНазначения.ОписаниеТипаСтрока(250));
	ТаблицаДляПроверки.Колонки.Добавить("ПравилоКонвертации", ОбщегоНазначения.ОписаниеТипаСтрока(250));
	ТаблицаДляПроверки.Колонки.Добавить("УзелПланаОбмена",    РаботаСРезультатамиОбмена.ОписаниеТипаПланыОбменаБСП());
	
	Возврат ТаблицаДляПроверки;
	
КонецФункции

Функция УзлыПлановОбменаПоКоторымЕстьЗаписи()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъектыКЗагрузке.УзелПланаОбмена КАК УзелПланаОбмена
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|ГДЕ
	|	ОбъектыКЗагрузке.ПравилоКонвертации <> """"";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("УзелПланаОбмена");
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли




