///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьПарольСинхронизацииДанных(Знач Корреспондент, Знач ДанныеАутентификации) Экспорт
	
	ТранспортСообщенийОбмена.УстановитьПарольСинхронизацииДанных(Корреспондент, ДанныеАутентификации);
	
КонецПроцедуры

Функция ПолноеИмяФормыПервойНастройки(Знач ИдентификаторТранспорта) Экспорт
	
	Возврат ТранспортСообщенийОбмена.ПолноеИмяФормыПервойНастройки(ИдентификаторТранспорта)
	
КонецФункции

Функция ПолноеИмяФормыНастройки(Знач ИдентификаторТранспорта) Экспорт
	
	Возврат ТранспортСообщенийОбмена.ПолноеИмяФормыНастройки(ИдентификаторТранспорта)
	
КонецФункции

Процедура СохранитьНастройкиТранспорта(Знач Корреспондент, Знач ИдентификаторТранспорта, Знач НастройкиТранспорта) Экспорт
	
	ТранспортСообщенийОбмена.СохранитьНастройкиТранспорта(Корреспондент, ИдентификаторТранспорта, НастройкиТранспорта);
	
КонецПроцедуры

Функция НастройкиТранспорта(Знач Корреспондент, Знач ИдентификаторТранспорта) Экспорт
	
	Возврат Справочники.НастройкиТранспортаСообщенийОбмена.НастройкиТранспорта(
		Корреспондент, ИдентификаторТранспорта);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТранспортПоУмолчанию(Знач Корреспондент) Экспорт

	Возврат Справочники.НастройкиТранспортаСообщенийОбмена.ТранспортПоУмолчанию(Корреспондент);
	
КонецФункции

Функция НазначитьТранспортПоУмолчанию(Знач Корреспондент, Знач ИдентификаторТранспорта) Экспорт
	
	Справочники.НастройкиТранспортаСообщенийОбмена.НазначитьТранспортПоУмолчанию(
		Корреспондент, ИдентификаторТранспорта);
	
КонецФункции

Функция ТребуетсяАутентификация(Знач ПараметрыАутентификации, ИмяФормы) Экспорт
	
	Возврат ТранспортСообщенийОбмена.ТребуетсяАутентификация(ПараметрыАутентификации, ИмяФормы);
	
КонецФункции

#КонецОбласти