///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// См. СтандартныеПодсистемыКлиент.ПриПолученииСерверногоОповещения
Процедура ПриПолученииСерверногоОповещения(ИмяОповещения, Результат) Экспорт
	
	Если ИмяОповещения <> РаботаСПочтовымиСообщениямиСлужебныйКлиентСервер.ИмяСерверногоОповещения() Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ИмяСобытия = "ОткрытаяАвторизацияПочтовогоСервиса" Тогда
		Оповестить("ОткрытаяАвторизацияПочтовогоСервиса", Результат.Контекст);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТемаОбращенияВПоддержку(Знач ТехническаяИнформация) Экспорт
	
	ОсновнаяПричина = СтрЗаменить(ТехническаяИнформация, Символы.ПС, " ");
	
	ОграничениеДлины = 500;
	ОсновнаяПричина = Лев(ОсновнаяПричина, ОграничениеДлины);
	
	Шаблон = НСтр("ru = 'Настройка почтового ящика: %1'");
	Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, ОсновнаяПричина);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстОбращенияВПоддержку(Знач АдресЭлектроннойПочты, Знач ТехническаяИнформация) Экспорт
	
	ОсновнаяПричина = СтрЗаменить(ТехническаяИнформация, Символы.ПС, " ");
	
	Шаблон = НСтр("ru = 'Проблема при настройке почтового ящика %1: %2.
		|
		|<Опишите возникшую проблему и приложите скриншоты ошибки.>'");
	
	Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		Шаблон,
		АдресЭлектроннойПочты,
		ОсновнаяПричина);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
