///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Отправляет SMS через SMS4B.
//
// Параметры:
//  НомераПолучателей - Массив - номера получателей в формате +7ХХХХХХХХХХ.
//  Текст             - Строка - текст сообщения, длиной не более 480 символов.
//  ИмяОтправителя    - Строка - имя отправителя, которое будет отображаться вместо номера входящего SMS.
//  Логин             - Строка - логин пользователя услуги отправки SMS.
//  Пароль            - Строка - пароль пользователя услуги отправки SMS.
//
// Возвращаемое значение:
//  см. ОтправкаSMS.ОтправитьSMS.
//
Функция ОтправитьSMS(НомераПолучателей, Текст, ИмяОтправителя, Логин, Пароль) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	НастройкиОтправкиSMS = ОтправкаSMS.НастройкиОтправкиSMS();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НастройкиОтправкиSMS.Свойство("СпособАвторизации") И НастройкиОтправкиSMS.СпособАвторизации = "ПоКлючу" Тогда
		Возврат ОтправитьSMSНовыйAPI(НомераПолучателей, Текст, ИмяОтправителя);
	Иначе
		Возврат ОтправитьSMSСтарыйAPI(НомераПолучателей, Текст, ИмяОтправителя, Логин, Пароль);
	КонецЕсли;
	
КонецФункции

// Возвращает текстовое представление статуса доставки сообщения.
//
// Параметры:
//  ИдентификаторСообщения - Строка - идентификатор, присвоенный sms при отправке.
//  НастройкиОтправкиSMS   - см. ОтправкаSMS.НастройкиОтправкиSMS.
//
// Возвращаемое значение:
//  см. ОтправкаSMS.СтатусДоставки.
//
Функция СтатусДоставки(ИдентификаторСообщения, НастройкиОтправкиSMS) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	НастройкиОтправкиSMS = ОтправкаSMS.НастройкиОтправкиSMS();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НастройкиОтправкиSMS.Свойство("СпособАвторизации") И НастройкиОтправкиSMS.СпособАвторизации = "ПоКлючу" Тогда
		ИдентификаторыСообщений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторСообщения);
		Возврат СтатусыДоставки(ИдентификаторыСообщений, НастройкиОтправкиSMS)[ИдентификаторСообщения];
	Иначе
		Возврат СтатусДоставкиСтарыйAPI(ИдентификаторСообщения, НастройкиОтправкиSMS);
	КонецЕсли;
	
КонецФункции

Функция СтатусДоставкиSMS(Знач КодСостояния)
	
	СоответствиеСтатусов = Новый Соответствие;
	СоответствиеСтатусов.Вставить("-21", "НеОтправлялось");
	СоответствиеСтатусов.Вставить("-22", "НеОтправлялось");
	
	Если ПустаяСтрока(КодСостояния) Или СтрНачинаетсяС(КодСостояния, "-") 
		Или Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(КодСостояния) Тогда
			Результат = СоответствиеСтатусов[НРег(КодСостояния)];
			Возврат ?(Результат = Неопределено, "Ошибка", Результат);
	КонецЕсли;
	
	КодСостояния = Число(КодСостояния);
	
	ВсегоФрагментов = КодСостояния % 256;
	ОтправленоФрагментов = Цел(КодСостояния / 256) % 256;
	ОкончательныйСтатус = КодСостояния >= 256*256;
	
	Если ОкончательныйСтатус Тогда
		Если ВсегоФрагментов = 0 Или ВсегоФрагментов > ОтправленоФрагментов Тогда
			Результат = "НеДоставлено";
		Иначе
			Результат = "Доставлено";
		КонецЕсли;
	Иначе
		Если ВсегоФрагментов = 0 Или ВсегоФрагментов > ОтправленоФрагментов Тогда
			Результат = "Отправляется";
		Иначе
			Результат = "Отправлено";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область СтарыйAPI 

Функция ОтправитьSMSСтарыйAPI(НомераПолучателей, Текст, ИмяОтправителя, Логин, Пароль)
	
	Результат = Новый Структура("ОтправленныеСообщения,ОписаниеОшибки", Новый Массив, "");
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Login", Логин);
	ПараметрыЗапроса.Вставить("Password", Пароль);
	ПараметрыЗапроса.Вставить("Source", ИмяОтправителя);
	ПараметрыЗапроса.Вставить("Text", Текст);
	
	Для Каждого НомерПолучателя Из НомераПолучателей Цикл
		ПараметрыЗапроса.Вставить("Phone", ФорматироватьНомер(НомерПолучателя));
		РезультатЗапроса = ВыполнитьЗапрос("SendTXT", ПараметрыЗапроса);
		
		Если Не ЗначениеЗаполнено(РезультатЗапроса) Тогда
			Результат.ОписаниеОшибки = Результат.ОписаниеОшибки + НСтр("ru = 'Соединение не установлено'");
			Возврат Результат;
		КонецЕсли;
		
		Если СтрДлина(РезультатЗапроса) = 20 Тогда
			ОтправленноеСообщение = Новый Структура("НомерПолучателя,ИдентификаторСообщения", НомерПолучателя, РезультатЗапроса);
			Результат.ОтправленныеСообщения.Добавить(ОтправленноеСообщение);
		Иначе
			Результат.ОписаниеОшибки = Результат.ОписаниеОшибки + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'SMS на номер %1 не отправлено'"), НомерПолучателя) + ": " + ОписаниеОшибкиОтправки(РезультатЗапроса) + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	
	Результат.ОписаниеОшибки = СокрП(Результат.ОписаниеОшибки);
	Если Не ПустаяСтрока(Результат.ОписаниеОшибки) Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка SMS'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка, , , Результат.ОписаниеОшибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает текстовое представление статуса доставки сообщения.
//
// Параметры:
//  ИдентификаторСообщения - Строка - идентификатор, присвоенный sms при отправке.
//  НастройкиОтправкиSMS   - см. ОтправкаSMS.НастройкиОтправкиSMS.
//
// Возвращаемое значение:
//  см. ОтправкаSMS.СтатусДоставки.
//
Функция СтатусДоставкиСтарыйAPI(ИдентификаторСообщения, НастройкиОтправкиSMS)
	
	Логин = НастройкиОтправкиSMS.Логин;
	Пароль = НастройкиОтправкиSMS.Пароль;
	
	// Подготовка параметров запроса.
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Login", Логин);
	ПараметрыЗапроса.Вставить("Password", Пароль);
	ПараметрыЗапроса.Вставить("MessageId", ИдентификаторСообщения);
	
	// Отправка запроса.
	КодСостояния = ВыполнитьЗапрос("StatusTXT", ПараметрыЗапроса);
	Если ПустаяСтрока(КодСостояния) Тогда
		Возврат "Ошибка";
	КонецЕсли;
	
	Результат = СтатусДоставкиSMS(КодСостояния);
	Если Результат = "Ошибка" Тогда
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр(
			"ru = 'Не удалось получить статус доставки SMS (id: ""%3""):
			|%1 (код ошибки: %2)'"), ОписаниеОшибкиПолученияСтатуса(КодСостояния), КодСостояния, ИдентификаторСообщения);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка SMS'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОписанияОшибок()
	
	ОписанияОшибок = Новый Соответствие;
	
	ОписанияОшибок.Вставить("0", НСтр("ru = 'Превышен предел открытых сессий.'"));
	ОписанияОшибок.Вставить("-1", НСтр("ru = 'Неверный логин или пароль.'"));
	ОписанияОшибок.Вставить("-10", НСтр("ru = 'Отказ сервиса.'"));
	ОписанияОшибок.Вставить("-20", НСтр("ru = 'Сбой сеанса связи.'"));
	ОписанияОшибок.Вставить("-21", НСтр("ru = 'Сообщение не идентифицировано.'"));
	ОписанияОшибок.Вставить("-22", НСтр("ru = 'Неверный идентификатор сообщения.'"));
	ОписанияОшибок.Вставить("-29", НСтр("ru = 'Отвергнуто спам-фильтром.'"));
	ОписанияОшибок.Вставить("-30", НСтр("ru = 'Неверная кодировка сообщения.'"));
	ОписанияОшибок.Вставить("-31", НСтр("ru = 'Неразрешенная зона тарификации.'"));
	ОписанияОшибок.Вставить("-50", НСтр("ru = 'Неверный отправитель.'"));
	ОписанияОшибок.Вставить("-51", НСтр("ru = 'Неразрешенный получатель.'"));
	ОписанияОшибок.Вставить("-52", НСтр("ru = 'Недостаточно средств на счете.'"));
	ОписанияОшибок.Вставить("-53", НСтр("ru = 'Незарегистрированный отправитель.'"));
	ОписанияОшибок.Вставить("-65", НСтр("ru = 'Необходимы гарантии отправителя, обратитесь в техподдержку.'"));
	ОписанияОшибок.Вставить("-66", НСтр("ru = 'Не задан отправитель.'"));
	ОписанияОшибок.Вставить("-68", НСтр("ru = 'Аккаунт заблокирован.'"));
	
	Возврат ОписанияОшибок;
	
КонецФункции

Функция ОписаниеОшибкиОтправки(КодОшибки)
	
	ОписанияОшибок = ОписанияОшибок();
	ТекстСообщения = ОписанияОшибок[КодОшибки];
	
	Если ТекстСообщения = Неопределено Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Код ошибки: ""%1"".'"), КодОшибки);
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция ОписаниеОшибкиПолученияСтатуса(КодОшибки)
	
	ОписанияОшибок =ОписанияОшибок();
	ТекстСообщения = ОписанияОшибок[КодОшибки];
	
	Если ТекстСообщения = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Отказ выполнения операции'");
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция ВыполнитьЗапрос(ИмяМетода, ПараметрыЗапроса)
	
	HTTPЗапрос = ОтправкаSMS.ПодготовитьHTTPЗапрос("/ws/s1c.asmx/" + ИмяМетода, ПараметрыЗапроса);
	HTTPОтвет = Неопределено;
	
	Попытка
		Соединение = Новый HTTPСоединение("sms4b.ru",,,,
			ПолучениеФайловИзИнтернета.ПолучитьПрокси("https"),
			60,
			ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение());
			
		HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка SMS'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Результат = "";
	Если HTTPОтвет <> Неопределено Тогда
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Запрос ""%1"" не выполнен. Код состояния: %2.'"), ИмяМетода, HTTPОтвет.КодСостояния) + Символы.ПС
				+ HTTPОтвет.ПолучитьТелоКакСтроку();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка SMS'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		КонецЕсли;
		
		ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(ТекстОтвета);
		ЧтениеXML.Прочитать();
		Если ЧтениеXML.Имя = "string" Тогда
			Если ЧтениеXML.Прочитать() Тогда
				Результат = ЧтениеXML.Значение;
			КонецЕсли;
		КонецЕсли;
		ЧтениеXML.Закрыть();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область НовыйAPI

Функция ОтправитьSMSНовыйAPI(НомераПолучателей, Текст, ИмяОтправителя)
	
	УстановитьПривилегированныйРежим(Истина);
	НастройкиОтправкиSMS = ОтправкаSMS.НастройкиОтправкиSMS();
	УстановитьПривилегированныйРежим(Ложь);
	
	// Формирование пакетов.
	ПакетыОтправки = РазделитьМассивНомеровНаПакеты(НомераПолучателей);
	КоличествоПакетов = ПакетыОтправки.Количество();
	
	Результат = Новый Структура("ОтправленныеСообщения,ОписаниеОшибки", Новый Массив, "");
	
	Для Индекс = 0 По КоличествоПакетов - 1 Цикл
		
		ПакетНомеров = ПакетыОтправки[Индекс];
		
		ПараметрыЗапроса = Новый Структура;
		
		ТелоЗапроса = Новый Структура;
		ТелоЗапроса.Вставить("sender", ?(ЗначениеЗаполнено(ИмяОтправителя), ИмяОтправителя, НастройкиОтправкиSMS.ИмяОтправителя));
		
		Сообщения = Новый Массив;
		Для Каждого НомерПолучателя Из ПакетНомеров Цикл
			Сообщение = Новый Структура("number, text", "","");
			Сообщение.number = ФорматироватьНомер(НомерПолучателя);
			Сообщение.text = Текст;
			Сообщения.Добавить(Сообщение);
		КонецЦикла;
		
		ТелоЗапроса.Вставить("messages", Сообщения);
		ТекстОтвета = ВыполнитьЗапросНовыйAPI("sms", ПараметрыЗапроса, ТелоЗапроса, "POST");
		
		// Обработка результата.
		Если Не ЗначениеЗаполнено(ТекстОтвета) Тогда
			ДобавитьОшибку(Результат.ОписаниеОшибки, НСтр("ru = 'Соединение не установлено. Подробности см. в журнале регистрации.'"));
			Возврат Результат;
		КонецЕсли;
		
		Попытка
			РезультатЗапроса = ОбщегоНазначения.JSONВЗначение(ТекстОтвета,,Ложь);
		Исключение
			ДобавитьОшибку(Результат.ОписаниеОшибки, НСтр("ru = 'Ошибка сервера. Подробности см. в журнале регистрации.'"));
			Возврат Результат;
		КонецПопытки;
		
		// Разбор результата запроса.
		Если РезультатЗапроса.Свойство("errors") Тогда
			Результат.ОписаниеОшибки = ОписаниеОшибкиЗапросаНовыйAPI(РезультатЗапроса);
		Иначе
			ИдентификаторыСообщений = РезультатЗапроса["messages"];
			Переименования = Новый Соответствие;
			ТаблицаИдентификаторов = МассивСтруктурВТаблицуЗначений(ИдентификаторыСообщений);
			
			// Так как в сервис отправлен форматированный номер - выполняется перебор исходного пакета номеров.
			Для Каждого НомерПолучателя Из ПакетНомеров Цикл
				
				ИдентификаторСообщения = "";
				СтрокаИдентификатора = ТаблицаИдентификаторов.Найти(ФорматироватьНомер(НомерПолучателя), "number");
				Если Не СтрокаИдентификатора = Неопределено Тогда
					ИдентификаторСообщения = СтрокаИдентификатора["id"];
					
					Если Не ПустаяСтрока(НомерПолучателя) И ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
						ОтправленноеСообщение = Новый Структура("НомерПолучателя,ИдентификаторСообщения",
							НомерПолучателя,ИдентификаторСообщения);
						Результат.ОтправленныеСообщения.Добавить(ОтправленноеСообщение);
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Результат.ОписаниеОшибки = СокрП(Результат.ОписаниеОшибки);
		Если Не ПустаяСтрока(Результат.ОписаниеОшибки) Тогда
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка SMS'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , , Результат.ОписаниеОшибки);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьЗапросНовыйAPI(ИмяМетода, ПараметрыЗапроса, ТелоЗапроса, HTTPМетод)
	
	HTTPЗапрос = ПодготовитьHTTPЗапрос("/v1/" + ИмяМетода, ПараметрыЗапроса, ТелоЗапроса);
	HTTPЗапрос.Заголовки.Вставить("Accept-Encoding", "identity");
	
	АдресСервера = АдресСервера(); 
	
	HTTPОтвет = Неопределено;
	
	Попытка
		Соединение = Новый HTTPСоединение(АдресСервера,,,,
			ПолучениеФайловИзИнтернета.ПолучитьПрокси("https"),
			60,
			ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение());
		Если HTTPМетод = "POST" Тогда
			HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ИначеЕсли HTTPМетод = "GET" Тогда
			HTTPОтвет = Соединение.Получить(HTTPЗапрос);
		Иначе
			// Метод HTTP не поддерживается.
			Результат = "";
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Метод HTTP ""%1"" не поддерживается.'"), HTTPМетод);
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка SMS'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка SMS'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Результат = "";
	Если HTTPОтвет <> Неопределено Тогда
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Запрос ""%1"" не выполнен. Код состояния: %2.'"), ИмяМетода, HTTPОтвет.КодСостояния) + Символы.ПС
				+ HTTPОтвет.ПолучитьТелоКакСтроку();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка SMS'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		КонецЕсли;
		
		Результат = HTTPОтвет.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеОшибкиЗапросаНовыйAPI(РезультатЗапроса)
	
	РезультатСтатусЗапроса = РезультатЗапроса["status"];
	РезультатЗаголовокОшибки = РезультатЗапроса["title"];
	РезультатОшибки = РезультатЗапроса["errors"];
	ОписанияОшибок = Новый Массив;
	
	Для Каждого ОписаниеОшибки Из РезультатОшибки Цикл
		ДетализацияОшибки = ОписаниеОшибки["detail"];
		Если Не ПустаяСтрока(ДетализацияОшибки) Тогда
			ОписанияОшибок.Добавить(ДетализацияОшибки);
		КонецЕсли;
	КонецЦикла;
	
	ОписанияОшибокСтрокой = СтрСоединить(ОписанияОшибок, Символы.ПС);
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1
		|Детальное описание:
		|%2'"), РезультатЗаголовокОшибки, ОписанияОшибокСтрокой);
	
	Возврат ТекстСообщения;
	
КонецФункции

// Запрашивает статус доставки сообщения у поставщика услуг.
//
// Параметры:
//  ИдентификаторыСообщений - см. ОтправкаSMS.СтатусыДоставки.ИдентификаторыСообщений.
//  НастройкиОтправкиSMS    - см. ОтправкаSMS.НастройкиОтправкиSMS.
//
// Возвращаемое значение:
//  см. ОтправкаSMS.СтатусыДоставки.
//
Функция СтатусыДоставки(ИдентификаторыСообщений, НастройкиОтправкиSMS) Экспорт
	
	СтатусыДоставки = Новый Соответствие;
	
	// Инициализация значения статуса.
	Для Каждого ИдентификаторСообщения Из ИдентификаторыСообщений Цикл
		СтатусыДоставки[ИдентификаторСообщения] = "Ошибка";
	КонецЦикла;
	
	// Формирование пакетов.
	ПакетыОтправки = РазделитьМассивНомеровНаПакеты(ИдентификаторыСообщений);
	КоличествоПакетов = ПакетыОтправки.Количество();
	
	Для Индекс = 0 По КоличествоПакетов - 1 Цикл
		
		ТекущийПакет = ПакетыОтправки[Индекс];
		
		ПараметрыЗапроса = Новый Структура;
		
		ТелоЗапроса = Новый Структура;
		ТелоЗапроса.Вставить("ids", ТекущийПакет);
		
		ТекстОтвета = ВыполнитьЗапросНовыйAPI("sms/messages/status", ПараметрыЗапроса, ТелоЗапроса, "GET");
		
		Если Не ЗначениеЗаполнено(ТекстОтвета) Тогда
			Возврат СтатусыДоставки;
		КонецЕсли;
		
		Попытка
			РезультатЗапроса = ОбщегоНазначения.JSONВЗначение(ТекстОтвета,,Ложь);
		Исключение
			Возврат СтатусыДоставки;
		КонецПопытки;
		
		// Разбор результата запроса.
		Если РезультатЗапроса.Свойство("errors") Тогда
			Причина = ОписаниеОшибкиЗапросаНовыйAPI(РезультатЗапроса);
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось проверить статус доставки SMS по причине:
				|%1'"), Причина);
			
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка SMS'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
			
			Возврат СтатусыДоставки;
			
		Иначе
			СтатусыСообщений = РезультатЗапроса["statuses"];
			
			Для Каждого ТекСтатус Из СтатусыСообщений Цикл
				ИдентификаторСообщения = ТекСтатус["id"];
				КодСостояния = ТекСтатус["code"];
				СтатусДоставки = СтатусДоставкиSMSНовыйAPI(КодСостояния);
				СтатусыДоставки[ИдентификаторСообщения] = СтатусДоставки;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтатусыДоставки;
	
КонецФункции

Функция СтатусДоставкиSMSНовыйAPI(Знач КодСостояния)
	
	СоответствиеСтатусов = Новый Соответствие;
	СоответствиеСтатусов.Вставить("delivered", "Доставлено");
	СоответствиеСтатусов.Вставить("undelivered", "НеДоставлено");
	СоответствиеСтатусов.Вставить("in_process", "Отправляется");
	СоответствиеСтатусов.Вставить("in_queue", "Отправляется");
	СоответствиеСтатусов.Вставить("sent", "Отправлено");
	СоответствиеСтатусов.Вставить("not_sent", "НеОтправлено");
	СоответствиеСтатусов.Вставить("error", "НеОтправлялось");
	
	Результат = СоответствиеСтатусов[НРег(КодСостояния)];
	Возврат ?(Результат = Неопределено, "Ошибка", Результат);
	
КонецФункции

#КонецОбласти

Функция ФорматироватьНомер(Номер)
	
	Результат = "";
	ДопустимыеСимволы = "1234567890";
	Для Позиция = 1 По СтрДлина(Номер) Цикл
		Символ = Сред(Номер,Позиция,1);
		Если СтрНайти(ДопустимыеСимволы, Символ) > 0 Тогда
			Результат = Результат + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПодготовитьHTTPЗапрос(АдресРесурса, ПараметрыЗапроса, ТелоЗапроса="") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	НастройкиОтправкиSMS = ОтправкаSMS.НастройкиОтправкиSMS();
	УстановитьПривилегированныйРежим(Ложь);
	
	Заголовки = Новый Соответствие;
	
	Если Не ПустаяСтрока(ТелоЗапроса) Тогда
		Заголовки.Вставить("accept", "application/json");
	КонецЕсли;
	
	Если НастройкиОтправкиSMS.СпособАвторизации = "ПоКлючу" Тогда
		Заголовки.Вставить("Authorization", "Bearer " + НастройкиОтправкиSMS.Пароль);
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыЗапроса) = Тип("Строка") Тогда
		СтрокаПараметров = ПараметрыЗапроса;
	Иначе
		СписокПараметров = Новый Массив;
		Для Каждого Параметр Из ПараметрыЗапроса Цикл
			Значения = Параметр.Значение;
			Если ТипЗнч(Параметр.Значение) <> Тип("Массив") Тогда
				Значения = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметр.Значение);
			КонецЕсли;
			
			Для Каждого Значение Из Значения Цикл
				СписокПараметров.Добавить(Параметр.Ключ + "=" + КодироватьСтроку(Значение, СпособКодированияСтроки.КодировкаURL));
			КонецЦикла;
		КонецЦикла;
		СтрокаПараметров = СтрСоединить(СписокПараметров, "&");
	КонецЕсли;
	
	Если Не ПустаяСтрока(СтрокаПараметров) Тогда
		АдресРесурса = АдресРесурса + "?" + СтрокаПараметров;
	КонецЕсли;
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	
	Если Не ПустаяСтрока(ТелоЗапроса) Тогда
		HTTPЗапрос.УстановитьТелоИзСтроки(ОбщегоНазначения.ЗначениеВJSON(ТелоЗапроса));
	КонецЕсли;
	
	Возврат HTTPЗапрос;
	
КонецФункции

// Разделяет массив номеров на пакеты.
//
// Параметры:
//  НомераПолучателей- Массив из Строка - массив номеров или идентификаторов сообщений.
//
// Возвращаемое значение:
//  Массив из Массив
//
Функция РазделитьМассивНомеровНаПакеты(НомераПолучателей)
	
	РазмерПакета = РазмерПакета(); // Количество элементов в одном пакете.
	Пакеты = Новый Массив; // Массив для хранения пакетов.
	
	// Формируем пакеты.
	Для Индекс = 0 По НомераПолучателей.Количество() - 1 Цикл
		Если Индекс % РазмерПакета = 0 Тогда
			ТекущийПакет = Новый Массив;
			Пакеты.Добавить(ТекущийПакет);
		КонецЕсли;
		
		ПоследнийПакет = Пакеты[Пакеты.Количество() - 1];
		ПоследнийПакет.Добавить(НомераПолучателей[Индекс]);
	КонецЦикла;
	
	Возврат Пакеты;
	
КонецФункции

// Функция помещает массив структур в таблицу значений.
//
// Параметры:
//  МассивСтруктур - Массив из Структура.
//
// Возвращаемое значение:
//  ТаблицаЗначений.
//
Функция МассивСтруктурВТаблицуЗначений(МассивСтруктур) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	
	Если ТипЗнч(МассивСтруктур) = Тип("Массив")
		И МассивСтруктур.Количество() <> 0 Тогда
		
		// Создание колонок.
		СтруктураКолонок = МассивСтруктур[0];
		Для Каждого Поле Из СтруктураКолонок Цикл
			Результат.Колонки.Добавить(Поле.Ключ);
		КонецЦикла;
		
		// Заполнение таблицы.
		Для Каждого Строка Из МассивСтруктур Цикл
			СтрокаРезультат = Результат.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезультат, Строка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает количество элементов в пакете.
//
// Возвращаемое значение:
//  Число - количество элементов в пакете.
//
Функция РазмерПакета()
	
	Возврат 5000;
	
КонецФункции

Функция АдресСервера()
	
	Возврат "1c.sms4b.ru";
	
КонецФункции

// Добавляет строку к имеющимся.
//
// Параметры:
//  Ошибки - Строка - накопленное описание ошибок.
//  ТекстОшибки - Строка - описание очередной ошибки.
//
Процедура ДобавитьОшибку(Ошибки, ТекстОшибки)
	
	Ошибки = Ошибки + ?(Ошибки = "", "", "
		|") + ТекстОшибки;
	
КонецПроцедуры

// Возвращает список разрешений для отправки SMS с использованием всех доступных провайдеров.
//
// Возвращаемое значение:
//  Массив
//
Функция Разрешения() Экспорт
	
	МодульРаботаВБезопасномРежиме = ОбщегоНазначения.ОбщийМодуль("РаботаВБезопасномРежиме");
	
	Протокол = "HTTPS";
	Адрес = "sms4b.ru";
	Порт = Неопределено;
	Описание = НСтр("ru = 'Отправка SMS через ""SMS4B"" (старый).'");
	
	Разрешения = Новый Массив;
	Разрешения.Добавить(
	МодульРаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(Протокол, Адрес, Порт, Описание));
	
	Протокол = "HTTPS";
	Адрес = "https://1c.sms4b.ru";
	Порт = Неопределено;
	Описание = НСтр("ru = 'Отправка SMS через ""SMS4B"" (новый).'");
	
	Разрешения = Новый Массив;
	Разрешения.Добавить(
		МодульРаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(Протокол, Адрес, Порт, Описание));
	
	Возврат Разрешения;
	
КонецФункции

Процедура ПриОпределенииНастроек(Настройки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	НастройкиОтправкиSMS = ОтправкаSMS.НастройкиОтправкиSMS();
	УстановитьПривилегированныйРежим(Ложь);
	
	Настройки.АдресОписанияУслугиВИнтернете = "https://sms4b.ru";
	Настройки.ПриОпределенииСпособовАвторизации = Истина;
	Настройки.ПриОпределенииПолейАвторизации = Истина;
	
	Если НастройкиОтправкиSMS.Свойство("СпособАвторизации") И НастройкиОтправкиSMS.СпособАвторизации = "ПоКлючу" Тогда
		Настройки.СтатусыДоставкиОднимЗапросом = Истина;
	Иначе
		Настройки.СтатусыДоставкиОднимЗапросом = Ложь;
	КонецЕсли;
	
	Настройки.ПриЗаполненииСпискаТекущихДел = Истина;
	
	Настройки.ИнформацияПоСпособамАвторизации.Вставить("ПоЛогинуИПаролю", СтроковыеФункции.ФорматированнаяСтрока(
		НСтр("ru = 'Для сервиса SMS4B рекомендуем использовать новый способ авторизации по API-токену.
		|Авторизация по логину и паролю в будущем будет отключена.'")));
	
	Настройки.ИнформацияПоСпособамАвторизации.Вставить("ПоКлючу", СтроковыеФункции.ФорматированнаяСтрока(
		НСтр("ru = '<a href=""https://www.sms4b.ru/office/api/token/"">Получить API-токен</a>'")));
	
КонецПроцедуры

Процедура ПриОпределенииСпособовАвторизации(СпособыАвторизации) Экспорт
	
	СпособыАвторизации.Очистить();
	СпособыАвторизации.Добавить("ПоКлючу", НСтр("ru = 'По API-токену (рекомендуется)'"));
	СпособыАвторизации.Добавить("ПоЛогинуИПаролю", НСтр("ru = 'По логину и паролю'"));
	
КонецПроцедуры

Процедура ПриОпределенииПолейАвторизации(СпособыАвторизации) Экспорт
	
	ПоляАвторизации = Новый СписокЗначений;
	ПоляАвторизации.Добавить("Пароль", НСтр("ru = 'Токен'"));
	
	СпособыАвторизации.Вставить("ПоКлючу", ПоляАвторизации);
	
	ПоляАвторизации = Новый СписокЗначений;
	ПоляАвторизации.Добавить("Логин", НСтр("ru = 'Логин'"));
	ПоляАвторизации.Добавить("Пароль", НСтр("ru = 'Пароль'"));
	
	СпособыАвторизации.Вставить("ПоЛогинуИПаролю", ПоляАвторизации);
	
КонецПроцедуры

// Параметры:
//  ТекущиеДела - см. ТекущиеДелаСервер.ТекущиеДела.
//
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт
	
	ИмяДела = "ОтправкаSMS";
	МодульТекущиеДелаСервер = ОбщегоНазначения.ОбщийМодуль("ТекущиеДелаСервер");
	Если МодульТекущиеДелаСервер.ДелоОтключено(ИмяДела) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	НастройкиОтправкиSMS = ОтправкаSMS.НастройкиОтправкиSMS();
	УстановитьПривилегированныйРежим(Ложь);
	
	ТребуетсяНастройка = Не НастройкиОтправкиSMS.Свойство("СпособАвторизации") Или НастройкиОтправкиSMS.СпособАвторизации = "ПоЛогинуИПаролю";
	Если Не ТребуетсяНастройка Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоПроблем = 0;
	ПараметрыФормы = Новый Структура;
	
	Разделы = МодульТекущиеДелаСервер.РазделыДляОбъекта(Метаданные.ОбщиеФормы.НастройкаОтправкиSMS.ПолноеИмя());
	Для Каждого Раздел Из Разделы Цикл
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор  = ИмяДела + СтрЗаменить(Раздел.ПолноеИмя(), ".", "");
		Дело.ЕстьДела       = Истина;
		Дело.Представление  = НСтр("ru = 'Требуется настройка отправки SMS'");
		Дело.Количество     = КоличествоПроблем;
		Дело.Форма          = "ОбщаяФорма.НастройкаОтправкиSMS";
		Дело.ПараметрыФормы = ПараметрыФормы;
		Дело.Важное         = Истина;
		Дело.Владелец       = Раздел;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

