///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запись.ВладелецФайла = Параметры.ВладелецФайла;
	Запись.ТипВладельцаФайла = Параметры.ТипВладельцаФайла;
	Запись.ЭтоФайл = Параметры.ЭтоФайл;
	
	Если ЗначениеЗаполнено(Запись.УчетнаяЗапись) Тогда
		Элементы.УчетнаяЗапись.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ПредставлениеВладельца = ОбщегоНазначения.ПредметСтрокой(Запись.ВладелецФайла);
	
	Заголовок = НСтр("ru = 'Настройка синхронизации файлов:'")
		+ " " + ПредставлениеВладельца;
	
КонецПроцедуры

#КонецОбласти