///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗапускВнешнихПриложений

Функция БезопаснаяСтрокаКоманды(КомандаЗапуска) Экспорт
	
	СредаИсполнения = "";
	
	Если ОбщегоНазначения.ЭтоWindowsСервер() Тогда
		СредаИсполнения = "Windows";
	ИначеЕсли ОбщегоНазначения.ЭтоLinuxСервер() Тогда
		СредаИсполнения = "Linux";
	КонецЕсли;
	
	Результат = ОбщегоНазначенияСлужебныйКлиентСервер.БезопаснаяСтрокаКоманды(КомандаЗапуска, СредаИсполнения);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти