///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается при ошибке захвате файла.
//
// Параметры:
//  ДанныеФайла          - см. РаботаСФайлами.ДанныеФайла.
//  СтандартнаяОбработка - Булево - признак стандартной обработки события.
//
Процедура ПриОшибкеЗахватаФайла(ДанныеФайла, СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Вызывается в начале выполнения метода РаботаСФайламиСлужебныйКлиент.ДействиеСФайлом.
//		Позволяет реализовать собственную логику работы с файлами, размещенными в файловом архиве.
//		Например, проверять доступность файла в архивном хранилище. И в ситуации, когда файл недоступен, открывать 
//		собственную форму для оформления заявки к администратору на получение файла.
//
// Параметры:
//  ПараметрыДействияСФайлом	- см. РаботаСФайламиКлиент.ПараметрыАсинхронногоПолученияФайла
//  СтандартнаяОбработка		- Булево - если Ложь, то не будет выполнена стандартная 
//							  		логика метода РаботаСФайламиСлужебныйКлиент.ДействиеСФайлом.
//
Процедура ПриВыполненииДействияСФайлом(ПараметрыДействияСФайлом, СтандартнаяОбработка = Истина) Экспорт

КонецПроцедуры

#КонецОбласти
