///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область УстаревшиеПроцедурыИФункции

Функция СкачатьФайл(URL, ПараметрыПолучения, ЗаписыватьОшибку) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Статус", Ложь);
	Результат.Вставить("СообщениеОбОшибке");
	Результат.Вставить("Заголовки", Новый Соответствие);
	Результат.Вставить("КодСостояния", 403);
	
	Возврат Результат;
	
КонецФункции

Функция СостояниеНастроекПрокси() Экспорт
	
	Возврат ПолучениеФайловИзИнтернетаСлужебный.СостояниеНастроекПрокси();
	
КонецФункции

#КонецОбласти

#КонецОбласти
