///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет интерактивные действия по загрузке курсов валют.
//
// Параметры:
//  ПараметрыЗагрузки - Структура:
//   * ОткрытиеИзСписка - Булево - Истина, если действие вызывается  из списка валют.
// 
Процедура ПоказатьЗагрузкуКурсовВалют(ПараметрыЗагрузки) Экспорт
	
	// Локализация
	ОткрытьФорму("Обработка.ЗагрузкаКурсовВалют.Форма", ПараметрыЗагрузки);
	// Конец Локализация
	
КонецПроцедуры
#КонецОбласти
