///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ЗначениеДляОтбора = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ВидыХраненияФайлов.АрхивноеХранение");

	Отбор = Новый Структура("ВидТомаХраненияФайлов", ЗначениеДляОтбора);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("ЗначениеОтбораПоВидуТомаХраненияФайлов", ЗначениеДляОтбора);	

	ОткрытьФорму("Справочник.ТомаХраненияФайлов.ФормаСписка", 
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры

#КонецОбласти