///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("НеОтрабатыватьИзменениеНабора")
		И ДополнительныеСвойства.НеОтрабатыватьИзменениеНабора Тогда
		Возврат;
	Иначе
		
		ДополнительныеСвойства.Вставить("ДанныеДляОпределенияИзменений", ДанныеДляОпределенияИзменений());
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("ДанныеДляОпределенияИзменений")
		Или ДополнительныеСвойства.ДанныеДляОпределенияИзменений = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ТекстУсловия = РаботаСРезультатамиОбмена.УсловиеЗапросаПоОтборуНабораЗаписей(Запрос, Отбор);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СтарыйНабор.ПолученныйОбъект        КАК ПолученныйОбъект,
	|	СтарыйНабор.ПравилоКонвертации      КАК ПравилоКонвертации,
	|	СтарыйНабор.ОбъектФормата           КАК ОбъектФормата,
	|	СтарыйНабор.ОбъектФорматаКПолучению КАК ОбъектФорматаКПолучению,
	|	СтарыйНабор.ОбъектКПолучению        КАК ОбъектКПолучению,
	|	СтарыйНабор.УзелПланаОбмена         КАК УзелПланаОбмена
	|ПОМЕСТИТЬ СтарыйНабор
	|ИЗ
	|	&СтарыйНабор КАК СтарыйНабор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////1
	|ВЫБРАТЬ
	|	ТаблицаРегистра.ПолученныйОбъект        КАК ПолученныйОбъект,
	|	ТаблицаРегистра.ПравилоКонвертации      КАК ПравилоКонвертации,
	|	ТаблицаРегистра.ОбъектФормата           КАК ОбъектФормата,
	|	ТаблицаРегистра.ОбъектФорматаКПолучению КАК ОбъектФорматаКПолучению,
	|	ТаблицаРегистра.ОбъектКПолучению        КАК ОбъектКПолучению,
	|	ТаблицаРегистра.УзелПланаОбмена         КАК УзелПланаОбмена
	|ПОМЕСТИТЬ НовыйНабор
	|ИЗ
	|	РегистрСведений.ОбъектыБлокирующиеЗагрузку КАК ТаблицаРегистра
	|ГДЕ
	|	&УсловиеЗапроса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////2
	|ВЫБРАТЬ
	|	НовыйНабор.ОбъектКПолучению        КАК ОбъектКПолучению,
	|	НовыйНабор.ОбъектФорматаКПолучению КАК ОбъектФорматаКПолучению,
	|	НовыйНабор.УзелПланаОбмена         КАК УзелПланаОбмена
	|ИЗ
	|	НовыйНабор КАК НовыйНабор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтарыйНабор.ОбъектКПолучению,
	|	СтарыйНабор.ОбъектФорматаКПолучению,
	|	СтарыйНабор.УзелПланаОбмена
	|ИЗ
	|	СтарыйНабор КАК СтарыйНабор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////3
	|ВЫБРАТЬ
	|	СтарыйНабор.ПолученныйОбъект   КАК ПолученныйОбъект,
	|	СтарыйНабор.ПравилоКонвертации КАК ПравилоКонвертации,
	|	СтарыйНабор.ОбъектФормата      КАК ОбъектФормата,
	|	СтарыйНабор.УзелПланаОбмена    КАК УзелПланаОбмена
	|ИЗ
	|	СтарыйНабор КАК СтарыйНабор
	|ЛЕВОЕ СОЕДИНЕНИЕ НовыйНабор КАК НовыйНабор
	|	ПО СтарыйНабор.ПолученныйОбъект  = НовыйНабор.ПолученныйОбъект
	|	И СтарыйНабор.ПравилоКонвертации = НовыйНабор.ПравилоКонвертации
	|	И СтарыйНабор.ОбъектФормата      = НовыйНабор.ОбъектФормата
	|	И СтарыйНабор.ОбъектКПолучению   = НовыйНабор.ОбъектКПолучению
	|ГДЕ
	|	НовыйНабор.ОбъектКПолучению IS NULL
	|";
	
	Запрос.УстановитьПараметр("СтарыйНабор", ДополнительныеСвойства.ДанныеДляОпределенияИзменений);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЗапроса", ТекстУсловия);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	КлючОбрабатывающегоЗадания = Неопределено;
	Если ДополнительныеСвойства.Свойство("КлючОбрабатывающегоЗадания")
		И Не ПустаяСтрока(ДополнительныеСвойства.КлючОбрабатывающегоЗадания) Тогда
		
		КлючОбрабатывающегоЗадания = ДополнительныеСвойства.КлючОбрабатывающегоЗадания;
		
	КонецЕсли; 
	
	РегистрыСведений.КоличествоБлокируемыхОбъектовКЗагрузке.РассчитатьДанныеПоТаблицеОбъектов(РезультатЗапроса[2].Выгрузить());
	РегистрыСведений.ОбъектыКЗагрузке.ОтразитьИзмененияПриУстановкеСоответствийОбъектамПоТаблице(РезультатЗапроса[3].Выгрузить(),
	                                                                                             КлючОбрабатывающегоЗадания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Функция ДанныеДляОпределенияИзменений()
	
	Возврат РаботаСРезультатамиОбмена.ТаблицаЗаписейПоОтборуНабораЗаписей(
		Отбор,
		"ОбъектыБлокирующиеЗагрузку", "ПолученныйОбъект, ПравилоКонвертации, ОбъектКПолучению, УзелПланаОбмена, ОбъектФормата, ОбъектФорматаКПолучению");
	
КонецФункции

#КонецОбласти


#КонецЕсли