///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Конструктор параметров подписанта для отправки на подписание и добавления.
// 
// Возвращаемое значение:
//  Структура:
//    * ИНН - Строка - не заполнен для ИП
//    * ИННФЛ - Строка - ИНН физического лица (индивидуального предпринимателя)
//    * НомерТелефона - Строка - номер мобильного телефона, начинается с +7.
//    * Имя - Строка - (необязательный)
//    * Отчество - Строка - (необязательный)
//    * Фамилия - Строка - (необязательный)
//    * Должность - Строка - (необязательный)
//    * Организация - ОпределяемыйТип.Организация
//    * ОГРН - Строка - (необязательный)
//    * НаименованиеОрганизации - Строка - (необязательный) если не заполнена Организация
//    * ФизическоеЛицо - ОпределяемыйТип.ФизическоеЛицо - (необязательный)
//
Функция ПараметрыПодписанта() Экспорт
	
	ПараметрыПодписанта = Новый Структура;
	ПараметрыПодписанта.Вставить("ОГРН");
	ПараметрыПодписанта.Вставить("ИНН", "");
	ПараметрыПодписанта.Вставить("ИННФЛ");
	ПараметрыПодписанта.Вставить("Имя");
	ПараметрыПодписанта.Вставить("Отчество");
	ПараметрыПодписанта.Вставить("Фамилия");
	ПараметрыПодписанта.Вставить("НомерТелефона");
	ПараметрыПодписанта.Вставить("Должность");
	ПараметрыПодписанта.Вставить("Организация");
	ПараметрыПодписанта.Вставить("НаименованиеОрганизации");
	ПараметрыПодписанта.Вставить("ФизическоеЛицо");
	ПараметрыПодписанта.Вставить("Наименование");
	
	Возврат ПараметрыПодписанта;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТолькоЦифры(Строка) Экспорт
	
	ДлинаСтроки = СтрДлина(Строка);
	
	ОбработаннаяСтрока = "";
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		
		Символ = Сред(Строка, НомерСимвола, 1);
		Если Символ >= "0" И Символ <= "9" Тогда
			ОбработаннаяСтрока = ОбработаннаяСтрока + Символ;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОбработаннаяСтрока;
	
КонецФункции

#КонецОбласти
