///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. ОбработкаМенеджер.ТранспортСообщенийОбменаFILE.ПараметрыТранспорта
Функция ПараметрыТранспорта() Экспорт
	
	Описание = НСтр("ru = 'При таком варианте подключения эта программа отправляет и принимает данные только по запросу от программы-корреспондента.'");
	
	Параметры = ТранспортСообщенийОбмена.СтруктураПараметровТранспорта();
	
	Параметры.Псевдоним = НСтр("ru = 'Пассивный режим'");
	Параметры.ИдентификаторТранспорта = "ПассивныйРежим";
	Параметры.Описание = Описание;
	Параметры.ЗапускОбменаИзКорреспондента = Ложь;
	Параметры.ИспользоватьПрогресс = Ложь;
	Параметры.РежимРаботыПриложения = 1;
	Параметры.ПрямоеПодключение = Ложь;
	Параметры.ПассивныйРежим = Истина;
	Параметры.Картинка = БиблиотекаКартинок.ТранспортПассивныйРежим;
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НастройкиПодключенияВXML(НастройкиПодключения) Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.НастройкиПодключенияВСообщениеОбмена(НастройкиПодключения);
	
КонецФункции

Функция НастройкиПодключенияИзXML(ТекстXML) Экспорт
	
	Возврат ОбменДаннымиXDTOСервер.СообщениеОбменаВНастройкиПодключения(ТекстXML);
	
КонецФункции

Функция НастройкиТранспортаВJSON(НастройкиТранспорта) Экспорт
	
	Возврат Новый Структура;
	
КонецФункции

Функция НастройкиТранспортаИзJSON(НастройкиТранспортаJSON) Экспорт

	Возврат Новый Структура;
	
КонецФункции

Функция ИмяКаталогаСохраненияНастроек(НастройкиПодключения) Экспорт
	
	Возврат "";
	
КонецФункции

#КонецОбласти
	
#КонецЕсли