///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент = Неопределено;
	ИспользоватьДОДляХраненияФайловОбъекта =
		РаботаСФайламиСлужебныйКлиент.Используется1СДокументооборотДляХраненияФайловОбъекта(
			ПараметрКоманды,
			МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
			ПараметрыВыполненияКоманды.Источник,
			ЭтотОбъект);
	
	Если ИспользоватьДОДляХраненияФайловОбъекта Тогда
		
		// ИнтеграцияС1СДокументооборотом
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОткрытьПрисоединенныеФайлы(
			ПараметрКоманды,,
			ПараметрыВыполненияКоманды.Источник.ТолькоПросмотр,
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно);
		// Конец ИнтеграцияС1СДокументооборотом
		
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВладелецФайла",  ПараметрКоманды);
		ПараметрыФормы.Вставить("ТолькоПросмотр", ПараметрыВыполненияКоманды.Источник.ТолькоПросмотр);
		
		ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы",
			ПараметрыФормы,
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
