///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ПриОпределенииОписанияОбращенияВПоддержку(ОписаниеОбращенияВПоддержку, ВопросВПоддержкуДоступен) Экспорт
	
	// Локализация
	Если ВопросВПоддержкуДоступен Тогда
		ОписаниеОбращенияВПоддержку = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = 'При возникновении затруднений обратитесь в <a href = %1>службу поддержки фирмы ""1С""</a>. В случае необходимости предоставьте <a href = %2>техническую информацию</a> о возникшей проблеме.'"),
			"ВопросВПоддержку",
			"ИнформацияДляОтправкиВПоддержку");
	Иначе
		ОписаниеОбращенияВПоддержку = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = 'При возникновении затруднений обратитесь в службу поддержки фирмы ""1С"". В случае необходимости предоставьте <a href = %1>техническую информацию</a> о возникшей проблеме.'"),
			"ИнформацияДляОтправкиВПоддержку");
	КонецЕсли;
	// Конец Локализация
	
КонецПроцедуры

#КонецОбласти
